josuah/mcu-gd32vf103/registers.h
#ifndef REGISTERS_H
#define REGISTERS_H


#define ADC0 ((struct sdk_adc0 *)0x40012400)

struct sdk_adc0 {

	/* 0x00: status register */
	uint32_t volatile STAT;
	/* Start flag of regular channel group */
#define ADC0_STAT_STRC						4u
	/* Start flag of inserted channel group */
#define ADC0_STAT_STIC						3u
	/* End of inserted group conversion flag */
#define ADC0_STAT_EOIC						2u
	/* End of group conversion flag */
#define ADC0_STAT_EOC						1u
	/* Analog watchdog event flag */
#define ADC0_STAT_WDE						0u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: control register 0 */
	uint32_t volatile CTL0;
	/* Regular channel analog watchdog  enable */
#define ADC0_CTL0_RWDEN						23u
	/* Inserted channel analog watchdog */
#define ADC0_CTL0_IWDEN						22u
	/* sync mode selection */
#define ADC0_CTL0_SYNCM_msb					16u
#define ADC0_CTL0_SYNCM_lsb					19u
	/* Number of conversions in */
#define ADC0_CTL0_DISNUM_msb					13u
#define ADC0_CTL0_DISNUM_lsb					15u
	/* Discontinuous mode on */
#define ADC0_CTL0_DISIC						12u
	/* Discontinuous mode on regular */
#define ADC0_CTL0_DISRC						11u
	/* Inserted channel group convert */
#define ADC0_CTL0_ICA						10u
	/* When in scan mode, analog watchdog */
#define ADC0_CTL0_WDSC						9u
	/* Scan mode */
#define ADC0_CTL0_SM						8u
	/* Interrupt enable for EOIC */
#define ADC0_CTL0_EOICIE					7u
	/* Interrupt enable for WDE */
#define ADC0_CTL0_WDEIE						6u
	/* Interrupt enable for EOC */
#define ADC0_CTL0_EOCIE						5u
	/* Analog watchdog channel select */
#define ADC0_CTL0_WDCHSEL_msb					0u
#define ADC0_CTL0_WDCHSEL_lsb					4u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: control register 1 */
	uint32_t volatile CTL1;
	/* Channel 16 and 17 enable of ADC0 */
#define ADC0_CTL1_TSVREN					23u
	/* Start on regular channel */
#define ADC0_CTL1_SWRCST					22u
	/* Start on inserted channel */
#define ADC0_CTL1_SWICST					21u
	/* External trigger enable for regular channel */
#define ADC0_CTL1_ETERC						20u
	/* External trigger select for regular channel */
#define ADC0_CTL1_ETSRC_msb					17u
#define ADC0_CTL1_ETSRC_lsb					19u
	/* External trigger select for inserted channel */
#define ADC0_CTL1_ETEIC						15u
	/* External trigger select for inserted channel */
#define ADC0_CTL1_ETSIC_msb					12u
#define ADC0_CTL1_ETSIC_lsb					14u
	/* Data alignment */
#define ADC0_CTL1_DAL						11u
	/* DMA request enable */
#define ADC0_CTL1_DMA						8u
	/* Reset calibration */
#define ADC0_CTL1_RSTCLB					3u
	/* ADC calibration */
#define ADC0_CTL1_CLB						2u
	/* Continuous mode */
#define ADC0_CTL1_CTN						1u
	/* ADC on */
#define ADC0_CTL1_ADCON						0u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C: Sample time register 0 */
	uint32_t volatile SAMPT0;
	/* Channel 10 sample time */
#define ADC0_SAMPT0_SPT10_msb					0u
#define ADC0_SAMPT0_SPT10_lsb					2u
	/* Channel 11 sample time */
#define ADC0_SAMPT0_SPT11_msb					3u
#define ADC0_SAMPT0_SPT11_lsb					5u
	/* Channel 12 sample time */
#define ADC0_SAMPT0_SPT12_msb					6u
#define ADC0_SAMPT0_SPT12_lsb					8u
	/* Channel 13 sample time */
#define ADC0_SAMPT0_SPT13_msb					9u
#define ADC0_SAMPT0_SPT13_lsb					11u
	/* Channel 14 sample time */
#define ADC0_SAMPT0_SPT14_msb					12u
#define ADC0_SAMPT0_SPT14_lsb					14u
	/* Channel 15 sample time */
#define ADC0_SAMPT0_SPT15_msb					15u
#define ADC0_SAMPT0_SPT15_lsb					17u
	/* Channel 16 sample time */
#define ADC0_SAMPT0_SPT16_msb					18u
#define ADC0_SAMPT0_SPT16_lsb					20u
	/* Channel 17 sample time */
#define ADC0_SAMPT0_SPT17_msb					21u
#define ADC0_SAMPT0_SPT17_lsb					23u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

	/* 0x10: Sample time register 1 */
	uint32_t volatile SAMPT1;
	/* Channel 0 sample time */
#define ADC0_SAMPT1_SPT0_msb					0u
#define ADC0_SAMPT1_SPT0_lsb					2u
	/* Channel 1 sample time */
#define ADC0_SAMPT1_SPT1_msb					3u
#define ADC0_SAMPT1_SPT1_lsb					5u
	/* Channel 2 sample time */
#define ADC0_SAMPT1_SPT2_msb					6u
#define ADC0_SAMPT1_SPT2_lsb					8u
	/* Channel 3 sample time */
#define ADC0_SAMPT1_SPT3_msb					9u
#define ADC0_SAMPT1_SPT3_lsb					11u
	/* Channel 4 sample time */
#define ADC0_SAMPT1_SPT4_msb					12u
#define ADC0_SAMPT1_SPT4_lsb					14u
	/* Channel 5 sample time */
#define ADC0_SAMPT1_SPT5_msb					15u
#define ADC0_SAMPT1_SPT5_lsb					17u
	/* Channel 6 sample time */
#define ADC0_SAMPT1_SPT6_msb					18u
#define ADC0_SAMPT1_SPT6_lsb					20u
	/* Channel 7 sample time */
#define ADC0_SAMPT1_SPT7_msb					21u
#define ADC0_SAMPT1_SPT7_lsb					23u
	/* Channel 8 sample time */
#define ADC0_SAMPT1_SPT8_msb					24u
#define ADC0_SAMPT1_SPT8_lsb					26u
	/* Channel 9 sample time */
#define ADC0_SAMPT1_SPT9_msb					27u
#define ADC0_SAMPT1_SPT9_lsb					29u

	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: Inserted channel data offset register */
	uint32_t volatile IOFF0;
	/* Data offset for inserted channel */
#define ADC0_IOFF0_IOFF_msb					0u
#define ADC0_IOFF0_IOFF_lsb					11u

	/* 0x14 */
	uint8_t RESERVED5[0x18-0x14];

	/* 0x18: Inserted channel data offset register */
	uint32_t volatile IOFF1;
	/* Data offset for inserted channel */
#define ADC0_IOFF1_IOFF_msb					0u
#define ADC0_IOFF1_IOFF_lsb					11u

	/* 0x18 */
	uint8_t RESERVED6[0x1C-0x18];

	/* 0x1C: Inserted channel data offset register */
	uint32_t volatile IOFF2;
	/* Data offset for inserted channel */
#define ADC0_IOFF2_IOFF_msb					0u
#define ADC0_IOFF2_IOFF_lsb					11u

	/* 0x1C */
	uint8_t RESERVED7[0x20-0x1C];

	/* 0x20: Inserted channel data offset register */
	uint32_t volatile IOFF3;
	/* Data offset for inserted channel */
#define ADC0_IOFF3_IOFF_msb					0u
#define ADC0_IOFF3_IOFF_lsb					11u

	/* 0x20 */
	uint8_t RESERVED8[0x24-0x20];

	/* 0x24: watchdog higher threshold */
	uint32_t volatile WDHT;
	/* Analog watchdog higher */
#define ADC0_WDHT_WDHT_msb					0u
#define ADC0_WDHT_WDHT_lsb					11u

	/* 0x24 */
	uint8_t RESERVED9[0x28-0x24];

	/* 0x28: watchdog lower threshold */
	uint32_t volatile WDLT;
	/* Analog watchdog lower */
#define ADC0_WDLT_WDLT_msb					0u
#define ADC0_WDLT_WDLT_lsb					11u

	/* 0x28 */
	uint8_t RESERVED10[0x2C-0x28];

	/* 0x2C: regular sequence register 0 */
	uint32_t volatile RSQ0;
	/* Regular channel group */
#define ADC0_RSQ0_RL_msb					20u
#define ADC0_RSQ0_RL_lsb					23u
	/* 16th conversion in regular */
#define ADC0_RSQ0_RSQ15_msb					15u
#define ADC0_RSQ0_RSQ15_lsb					19u
	/* 15th conversion in regular */
#define ADC0_RSQ0_RSQ14_msb					10u
#define ADC0_RSQ0_RSQ14_lsb					14u
	/* 14th conversion in regular */
#define ADC0_RSQ0_RSQ13_msb					5u
#define ADC0_RSQ0_RSQ13_lsb					9u
	/* 13th conversion in regular */
#define ADC0_RSQ0_RSQ12_msb					0u
#define ADC0_RSQ0_RSQ12_lsb					4u

	/* 0x2C */
	uint8_t RESERVED11[0x30-0x2C];

	/* 0x30: regular sequence register 1 */
	uint32_t volatile RSQ1;
	/* 12th conversion in regular */
#define ADC0_RSQ1_RSQ11_msb					25u
#define ADC0_RSQ1_RSQ11_lsb					29u
	/* 11th conversion in regular */
#define ADC0_RSQ1_RSQ10_msb					20u
#define ADC0_RSQ1_RSQ10_lsb					24u
	/* 10th conversion in regular */
#define ADC0_RSQ1_RSQ9_msb					15u
#define ADC0_RSQ1_RSQ9_lsb					19u
	/* 9th conversion in regular */
#define ADC0_RSQ1_RSQ8_msb					10u
#define ADC0_RSQ1_RSQ8_lsb					14u
	/* 8th conversion in regular */
#define ADC0_RSQ1_RSQ7_msb					5u
#define ADC0_RSQ1_RSQ7_lsb					9u
	/* 7th conversion in regular */
#define ADC0_RSQ1_RSQ6_msb					0u
#define ADC0_RSQ1_RSQ6_lsb					4u

