josuah/mcu-gd32vf103/registers.h
	/* 0x30 */
	uint8_t RESERVED12[0x34-0x30];

	/* 0x34: regular sequence register 2 */
	uint32_t volatile RSQ2;
	/* 6th conversion in regular */
#define ADC0_RSQ2_RSQ5_msb					25u
#define ADC0_RSQ2_RSQ5_lsb					29u
	/* 5th conversion in regular */
#define ADC0_RSQ2_RSQ4_msb					20u
#define ADC0_RSQ2_RSQ4_lsb					24u
	/* 4th conversion in regular */
#define ADC0_RSQ2_RSQ3_msb					15u
#define ADC0_RSQ2_RSQ3_lsb					19u
	/* 3rd conversion in regular */
#define ADC0_RSQ2_RSQ2_msb					10u
#define ADC0_RSQ2_RSQ2_lsb					14u
	/* 2nd conversion in regular */
#define ADC0_RSQ2_RSQ1_msb					5u
#define ADC0_RSQ2_RSQ1_lsb					9u
	/* 1st conversion in regular */
#define ADC0_RSQ2_RSQ0_msb					0u
#define ADC0_RSQ2_RSQ0_lsb					4u

	/* 0x34 */
	uint8_t RESERVED13[0x38-0x34];

	/* 0x38: Inserted sequence register */
	uint32_t volatile ISQ;
	/* Inserted channel group length */
#define ADC0_ISQ_IL_msb						20u
#define ADC0_ISQ_IL_lsb						21u
	/* 4th conversion in inserted */
#define ADC0_ISQ_ISQ3_msb					15u
#define ADC0_ISQ_ISQ3_lsb					19u
	/* 3rd conversion in inserted */
#define ADC0_ISQ_ISQ2_msb					10u
#define ADC0_ISQ_ISQ2_lsb					14u
	/* 2nd conversion in inserted */
#define ADC0_ISQ_ISQ1_msb					5u
#define ADC0_ISQ_ISQ1_lsb					9u
	/* 1st conversion in inserted */
#define ADC0_ISQ_ISQ0_msb					0u
#define ADC0_ISQ_ISQ0_lsb					4u

	/* 0x38 */
	uint8_t RESERVED14[0x3C-0x38];

	/* 0x3C: Inserted data register 0 */
	uint32_t volatile IDATA0;
	/* Inserted number n conversion data */
#define ADC0_IDATA0_IDATAN_msb					0u
#define ADC0_IDATA0_IDATAN_lsb					15u

	/* 0x3C */
	uint8_t RESERVED15[0x40-0x3C];

	/* 0x40: Inserted data register 1 */
	uint32_t volatile IDATA1;
	/* Inserted number n conversion data */
#define ADC0_IDATA1_IDATAN_msb					0u
#define ADC0_IDATA1_IDATAN_lsb					15u

	/* 0x40 */
	uint8_t RESERVED16[0x44-0x40];

	/* 0x44: Inserted data register 2 */
	uint32_t volatile IDATA2;
	/* Inserted number n conversion data */
#define ADC0_IDATA2_IDATAN_msb					0u
#define ADC0_IDATA2_IDATAN_lsb					15u

	/* 0x44 */
	uint8_t RESERVED17[0x48-0x44];

	/* 0x48: Inserted data register 3 */
	uint32_t volatile IDATA3;
	/* Inserted number n conversion data */
#define ADC0_IDATA3_IDATAN_msb					0u
#define ADC0_IDATA3_IDATAN_lsb					15u

	/* 0x48 */
	uint8_t RESERVED18[0x4C-0x48];

	/* 0x4C: regular data register */
	uint32_t volatile RDATA;
	/* ADC regular channel data */
#define ADC0_RDATA_ADC1RDTR_msb					16u
#define ADC0_RDATA_ADC1RDTR_lsb					31u
	/* Regular channel data */
#define ADC0_RDATA_RDATA_msb					0u
#define ADC0_RDATA_RDATA_lsb					15u

	/* 0x4C */
	uint8_t RESERVED19[0x80-0x4C];

	/* 0x80: Oversample control register */
	uint32_t volatile OVSAMPCTL;
	/* ADC resolution */
#define ADC0_OVSAMPCTL_DRES_msb					12u
#define ADC0_OVSAMPCTL_DRES_lsb					13u
	/* Triggered Oversampling */
#define ADC0_OVSAMPCTL_TOVS					9u
	/* Oversampling shift */
#define ADC0_OVSAMPCTL_OVSS_msb					5u
#define ADC0_OVSAMPCTL_OVSS_lsb					8u
	/* Oversampling ratio */
#define ADC0_OVSAMPCTL_OVSR_msb					2u
#define ADC0_OVSAMPCTL_OVSR_lsb					4u
	/* Oversampler Enable */
#define ADC0_OVSAMPCTL_OVSEN					0u

};


#define ADC1 ((struct sdk_adc1 *)0x40012800)

struct sdk_adc1 {

	/* 0x00: status register */
	uint32_t volatile STAT;
	/* Start flag of regular channel group */
#define ADC1_STAT_STRC						4u
	/* Start flag of inserted channel group */
#define ADC1_STAT_STIC						3u
	/* End of inserted group conversion flag */
#define ADC1_STAT_EOIC						2u
	/* End of group conversion flag */
#define ADC1_STAT_EOC						1u
	/* Analog watchdog event flag */
#define ADC1_STAT_WDE						0u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: control register 0 */
	uint32_t volatile CTL0;
	/* Regular channel analog watchdog */
#define ADC1_CTL0_RWDEN						23u
	/* Inserted channel analog watchdog */
#define ADC1_CTL0_IWDEN						22u
	/* Number of conversions in */
#define ADC1_CTL0_DISNUM_msb					13u
#define ADC1_CTL0_DISNUM_lsb					15u
	/* Discontinuous mode on */
#define ADC1_CTL0_DISIC						12u
	/* Discontinuous mode on regular */
#define ADC1_CTL0_DISRC						11u
	/* Inserted channel group convert */
#define ADC1_CTL0_ICA						10u
	/* When in scan mode, analog watchdog */
#define ADC1_CTL0_WDSC						9u
	/* Scan mode */
#define ADC1_CTL0_SM						8u
	/* Interrupt enable for EOIC */
#define ADC1_CTL0_EOICIE					7u
	/* Interrupt enable for WDE */
#define ADC1_CTL0_WDEIE						6u
	/* Interrupt enable for EOC */
#define ADC1_CTL0_EOCIE						5u
	/* Analog watchdog channel select */
#define ADC1_CTL0_WDCHSEL_msb					0u
#define ADC1_CTL0_WDCHSEL_lsb					4u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: control register 1 */
	uint32_t volatile CTL1;
	/* Start on regular channel */
#define ADC1_CTL1_SWRCST					22u
	/* Start on inserted channel */
#define ADC1_CTL1_SWICST					21u
	/* External trigger enable for regular channel */
#define ADC1_CTL1_ETERC						20u
	/* External trigger select for regular channel */
#define ADC1_CTL1_ETSRC_msb					17u
#define ADC1_CTL1_ETSRC_lsb					19u
	/* External trigger enable for inserted channel */
#define ADC1_CTL1_ETEIC						15u
	/* External trigger select for inserted channel */
#define ADC1_CTL1_ETSIC_msb					12u
#define ADC1_CTL1_ETSIC_lsb					14u
	/* Data alignment */
#define ADC1_CTL1_DAL						11u
	/* DMA request enable */
#define ADC1_CTL1_DMA						8u
	/* Reset calibration */
#define ADC1_CTL1_RSTCLB					3u
	/* ADC calibration */
#define ADC1_CTL1_CLB						2u
	/* Continuous mode */
#define ADC1_CTL1_CTN						1u
	/* ADC on */
#define ADC1_CTL1_ADCON						0u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C: Sample time register 0 */
	uint32_t volatile SAMPT0;
	/* Channel 10 sample time */
#define ADC1_SAMPT0_SPT10_msb					0u
#define ADC1_SAMPT0_SPT10_lsb					2u
	/* Channel 11 sample time */
#define ADC1_SAMPT0_SPT11_msb					3u
#define ADC1_SAMPT0_SPT11_lsb					5u
	/* Channel 12 sample time */
#define ADC1_SAMPT0_SPT12_msb					6u
#define ADC1_SAMPT0_SPT12_lsb					8u
	/* Channel 13 sample time */
#define ADC1_SAMPT0_SPT13_msb					9u
#define ADC1_SAMPT0_SPT13_lsb					11u
	/* Channel 14 sample time */
#define ADC1_SAMPT0_SPT14_msb					12u
#define ADC1_SAMPT0_SPT14_lsb					14u
	/* Channel 15 sample time */
#define ADC1_SAMPT0_SPT15_msb					15u
#define ADC1_SAMPT0_SPT15_lsb					17u
	/* Channel 16 sample time */
#define ADC1_SAMPT0_SPT16_msb					18u
#define ADC1_SAMPT0_SPT16_lsb					20u
	/* Channel 17 sample time */
#define ADC1_SAMPT0_SPT17_msb					21u
#define ADC1_SAMPT0_SPT17_lsb					23u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

