josuah/mcu-gd32vf103/registers.h
	/* 0x10: Sample time register 1 */
	uint32_t volatile SAMPT1;
	/* Channel 0 sample time */
#define ADC1_SAMPT1_SPT0_msb					0u
#define ADC1_SAMPT1_SPT0_lsb					2u
	/* Channel 1 sample time */
#define ADC1_SAMPT1_SPT1_msb					3u
#define ADC1_SAMPT1_SPT1_lsb					5u
	/* Channel 2 sample time */
#define ADC1_SAMPT1_SPT2_msb					6u
#define ADC1_SAMPT1_SPT2_lsb					8u
	/* Channel 3 sample time */
#define ADC1_SAMPT1_SPT3_msb					9u
#define ADC1_SAMPT1_SPT3_lsb					11u
	/* Channel 4 sample time */
#define ADC1_SAMPT1_SPT4_msb					12u
#define ADC1_SAMPT1_SPT4_lsb					14u
	/* Channel 5 sample time */
#define ADC1_SAMPT1_SPT5_msb					15u
#define ADC1_SAMPT1_SPT5_lsb					17u
	/* Channel 6 sample time */
#define ADC1_SAMPT1_SPT6_msb					18u
#define ADC1_SAMPT1_SPT6_lsb					20u
	/* Channel 7 sample time */
#define ADC1_SAMPT1_SPT7_msb					21u
#define ADC1_SAMPT1_SPT7_lsb					23u
	/* Channel 8 sample time */
#define ADC1_SAMPT1_SPT8_msb					24u
#define ADC1_SAMPT1_SPT8_lsb					26u
	/* Channel 9 sample time */
#define ADC1_SAMPT1_SPT9_msb					27u
#define ADC1_SAMPT1_SPT9_lsb					29u

	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: Inserted channel data offset register */
	uint32_t volatile IOFF0;
	/* Data offset for inserted channel */
#define ADC1_IOFF0_IOFF_msb					0u
#define ADC1_IOFF0_IOFF_lsb					11u

	/* 0x14 */
	uint8_t RESERVED5[0x18-0x14];

	/* 0x18: Inserted channel data offset register */
	uint32_t volatile IOFF1;
	/* Data offset for inserted channel */
#define ADC1_IOFF1_IOFF_msb					0u
#define ADC1_IOFF1_IOFF_lsb					11u

	/* 0x18 */
	uint8_t RESERVED6[0x1C-0x18];

	/* 0x1C: Inserted channel data offset register */
	uint32_t volatile IOFF2;
	/* Data offset for inserted channel */
#define ADC1_IOFF2_IOFF_msb					0u
#define ADC1_IOFF2_IOFF_lsb					11u

	/* 0x1C */
	uint8_t RESERVED7[0x20-0x1C];

	/* 0x20: Inserted channel data offset register */
	uint32_t volatile IOFF3;
	/* Data offset for inserted channel */
#define ADC1_IOFF3_IOFF_msb					0u
#define ADC1_IOFF3_IOFF_lsb					11u

	/* 0x20 */
	uint8_t RESERVED8[0x24-0x20];

	/* 0x24: watchdog higher threshold */
	uint32_t volatile WDHT;
	/* Analog watchdog higher */
#define ADC1_WDHT_WDHT_msb					0u
#define ADC1_WDHT_WDHT_lsb					11u

	/* 0x24 */
	uint8_t RESERVED9[0x28-0x24];

	/* 0x28: watchdog lower threshold */
	uint32_t volatile WDLT;
	/* Analog watchdog lower */
#define ADC1_WDLT_WDLT_msb					0u
#define ADC1_WDLT_WDLT_lsb					11u

	/* 0x28 */
	uint8_t RESERVED10[0x2C-0x28];

	/* 0x2C: regular sequence register 0 */
	uint32_t volatile RSQ0;
	/* Regular channel group */
#define ADC1_RSQ0_RL_msb					20u
#define ADC1_RSQ0_RL_lsb					23u
	/* 16th conversion in regular */
#define ADC1_RSQ0_RSQ15_msb					15u
#define ADC1_RSQ0_RSQ15_lsb					19u
	/* 15th conversion in regular */
#define ADC1_RSQ0_RSQ14_msb					10u
#define ADC1_RSQ0_RSQ14_lsb					14u
	/* 14th conversion in regular */
#define ADC1_RSQ0_RSQ13_msb					5u
#define ADC1_RSQ0_RSQ13_lsb					9u
	/* 13th conversion in regular */
#define ADC1_RSQ0_RSQ12_msb					0u
#define ADC1_RSQ0_RSQ12_lsb					4u

	/* 0x2C */
	uint8_t RESERVED11[0x30-0x2C];

	/* 0x30: regular sequence register 1 */
	uint32_t volatile RSQ1;
	/* 12th conversion in regular */
#define ADC1_RSQ1_RSQ11_msb					25u
#define ADC1_RSQ1_RSQ11_lsb					29u
	/* 11th conversion in regular */
#define ADC1_RSQ1_RSQ10_msb					20u
#define ADC1_RSQ1_RSQ10_lsb					24u
	/* 10th conversion in regular */
#define ADC1_RSQ1_RSQ9_msb					15u
#define ADC1_RSQ1_RSQ9_lsb					19u
	/* 9th conversion in regular */
#define ADC1_RSQ1_RSQ8_msb					10u
#define ADC1_RSQ1_RSQ8_lsb					14u
	/* 8th conversion in regular */
#define ADC1_RSQ1_RSQ7_msb					5u
#define ADC1_RSQ1_RSQ7_lsb					9u
	/* 7th conversion in regular */
#define ADC1_RSQ1_RSQ6_msb					0u
#define ADC1_RSQ1_RSQ6_lsb					4u

	/* 0x30 */
	uint8_t RESERVED12[0x34-0x30];

	/* 0x34: regular sequence register 2 */
	uint32_t volatile RSQ2;
	/* 6th conversion in regular */
#define ADC1_RSQ2_RSQ5_msb					25u
#define ADC1_RSQ2_RSQ5_lsb					29u
	/* 5th conversion in regular */
#define ADC1_RSQ2_RSQ4_msb					20u
#define ADC1_RSQ2_RSQ4_lsb					24u
	/* 4th conversion in regular */
#define ADC1_RSQ2_RSQ3_msb					15u
#define ADC1_RSQ2_RSQ3_lsb					19u
	/* 3rd conversion in regular */
#define ADC1_RSQ2_RSQ2_msb					10u
#define ADC1_RSQ2_RSQ2_lsb					14u
	/* 2nd conversion in regular */
#define ADC1_RSQ2_RSQ1_msb					5u
#define ADC1_RSQ2_RSQ1_lsb					9u
	/* 1st conversion in regular */
#define ADC1_RSQ2_RSQ0_msb					0u
#define ADC1_RSQ2_RSQ0_lsb					4u

	/* 0x34 */
	uint8_t RESERVED13[0x38-0x34];

	/* 0x38: Inserted sequence register */
	uint32_t volatile ISQ;
	/* Inserted channel group length */
#define ADC1_ISQ_IL_msb						20u
#define ADC1_ISQ_IL_lsb						21u
	/* 4th conversion in inserted */
#define ADC1_ISQ_ISQ3_msb					15u
#define ADC1_ISQ_ISQ3_lsb					19u
	/* 3rd conversion in inserted */
#define ADC1_ISQ_ISQ2_msb					10u
#define ADC1_ISQ_ISQ2_lsb					14u
	/* 2nd conversion in inserted */
#define ADC1_ISQ_ISQ1_msb					5u
#define ADC1_ISQ_ISQ1_lsb					9u
	/* 1st conversion in inserted */
#define ADC1_ISQ_ISQ0_msb					0u
#define ADC1_ISQ_ISQ0_lsb					4u

	/* 0x38 */
	uint8_t RESERVED14[0x3C-0x38];

	/* 0x3C: Inserted data register 0 */
	uint32_t volatile IDATA0;
	/* Inserted number n conversion data */
#define ADC1_IDATA0_IDATAN_msb					0u
#define ADC1_IDATA0_IDATAN_lsb					15u

	/* 0x3C */
	uint8_t RESERVED15[0x40-0x3C];

	/* 0x40: Inserted data register 1 */
	uint32_t volatile IDATA1;
	/* Inserted number n conversion data */
#define ADC1_IDATA1_IDATAN_msb					0u
#define ADC1_IDATA1_IDATAN_lsb					15u

	/* 0x40 */
	uint8_t RESERVED16[0x44-0x40];

	/* 0x44: Inserted data register 2 */
	uint32_t volatile IDATA2;
	/* Inserted number n conversion data */
#define ADC1_IDATA2_IDATAN_msb					0u
#define ADC1_IDATA2_IDATAN_lsb					15u

	/* 0x44 */
	uint8_t RESERVED17[0x48-0x44];

	/* 0x48: Inserted data register 3 */
	uint32_t volatile IDATA3;
	/* Inserted number n conversion data */
#define ADC1_IDATA3_IDATAN_msb					0u
#define ADC1_IDATA3_IDATAN_lsb					15u

	/* 0x48 */
	uint8_t RESERVED18[0x4C-0x48];

	/* 0x4C: regular data register */
	uint32_t volatile RDATA;
	/* Regular channel data */
#define ADC1_RDATA_RDATA_msb					0u
#define ADC1_RDATA_RDATA_lsb					15u

