josuah/mcu-gd32vf103/registers.h
};


#define AFIO ((struct sdk_afio *)0x40010000)

struct sdk_afio {

	/* 0x00: Event control register */
	uint32_t volatile EC;
	/* Event output enable */
#define AFIO_EC_EOE						7u
	/* Event output port selection */
#define AFIO_EC_PORT_msb					4u
#define AFIO_EC_PORT_lsb					6u
	/* Event output pin selection */
#define AFIO_EC_PIN_msb						0u
#define AFIO_EC_PIN_lsb						3u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: AFIO port configuration register 0 */
	uint32_t volatile PCF0;
	/* TIMER1 internal trigger 1 remapping */
#define AFIO_PCF0_TIMER1ITI1_REMAP				29u
	/*  */
#define AFIO_PCF0_SPI2_REMAP					28u
	/* Serial wire JTAG configuration */
#define AFIO_PCF0_SWJ_CFG_msb					24u
#define AFIO_PCF0_SWJ_CFG_lsb					26u
	/* CAN1 I/O remapping */
#define AFIO_PCF0_CAN1_REMAP					22u
	/* TIMER4 channel3 internal remapping */
#define AFIO_PCF0_TIMER4CH3_IREMAP				16u
	/* Port D0/Port D1 mapping on OSC_IN/OSC_OUT */
#define AFIO_PCF0_PD01_REMAP					15u
	/* CAN0 alternate interface remapping */
#define AFIO_PCF0_CAN0_REMAP_msb				13u
#define AFIO_PCF0_CAN0_REMAP_lsb				14u
	/* TIMER3 remapping */
#define AFIO_PCF0_TIMER3_REMAP					12u
	/* TIMER2 remapping */
#define AFIO_PCF0_TIMER2_REMAP_msb				10u
#define AFIO_PCF0_TIMER2_REMAP_lsb				11u
	/* TIMER1 remapping */
#define AFIO_PCF0_TIMER1_REMAP_msb				8u
#define AFIO_PCF0_TIMER1_REMAP_lsb				9u
	/* TIMER0 remapping */
#define AFIO_PCF0_TIMER0_REMAP_msb				6u
#define AFIO_PCF0_TIMER0_REMAP_lsb				7u
	/* USART2 remapping */
#define AFIO_PCF0_USART2_REMAP_msb				4u
#define AFIO_PCF0_USART2_REMAP_lsb				5u
	/* USART1 remapping */
#define AFIO_PCF0_USART1_REMAP					3u
	/* USART0 remapping */
#define AFIO_PCF0_USART0_REMAP					2u
	/* I2C0 remapping */
#define AFIO_PCF0_I2C0_REMAP					1u
	/* SPI0 remapping */
#define AFIO_PCF0_SPI0_REMAP					0u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: EXTI sources selection register 0 */
	uint32_t volatile EXTISS0;
	/* EXTI 3 sources selection */
#define AFIO_EXTISS0_EXTI3_SS_msb				12u
#define AFIO_EXTISS0_EXTI3_SS_lsb				15u
	/* EXTI 2 sources selection */
#define AFIO_EXTISS0_EXTI2_SS_msb				8u
#define AFIO_EXTISS0_EXTI2_SS_lsb				11u
	/* EXTI 1 sources selection */
#define AFIO_EXTISS0_EXTI1_SS_msb				4u
#define AFIO_EXTISS0_EXTI1_SS_lsb				7u
	/* EXTI 0 sources selection */
#define AFIO_EXTISS0_EXTI0_SS_msb				0u
#define AFIO_EXTISS0_EXTI0_SS_lsb				3u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C: EXTI sources selection register 1 */
	uint32_t volatile EXTISS1;
	/* EXTI 7 sources selection */
#define AFIO_EXTISS1_EXTI7_SS_msb				12u
#define AFIO_EXTISS1_EXTI7_SS_lsb				15u
	/* EXTI 6 sources selection */
#define AFIO_EXTISS1_EXTI6_SS_msb				8u
#define AFIO_EXTISS1_EXTI6_SS_lsb				11u
	/* EXTI 5 sources selection */
#define AFIO_EXTISS1_EXTI5_SS_msb				4u
#define AFIO_EXTISS1_EXTI5_SS_lsb				7u
	/* EXTI 4 sources selection */
#define AFIO_EXTISS1_EXTI4_SS_msb				0u
#define AFIO_EXTISS1_EXTI4_SS_lsb				3u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

	/* 0x10: EXTI sources selection register 2 */
	uint32_t volatile EXTISS2;
	/* EXTI 11 sources selection */
#define AFIO_EXTISS2_EXTI11_SS_msb				12u
#define AFIO_EXTISS2_EXTI11_SS_lsb				15u
	/* EXTI 10 sources selection */
#define AFIO_EXTISS2_EXTI10_SS_msb				8u
#define AFIO_EXTISS2_EXTI10_SS_lsb				11u
	/* EXTI 9 sources selection */
#define AFIO_EXTISS2_EXTI9_SS_msb				4u
#define AFIO_EXTISS2_EXTI9_SS_lsb				7u
	/* EXTI 8 sources selection */
#define AFIO_EXTISS2_EXTI8_SS_msb				0u
#define AFIO_EXTISS2_EXTI8_SS_lsb				3u

	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: EXTI sources selection register 3 */
	uint32_t volatile EXTISS3;
	/* EXTI 15 sources selection */
#define AFIO_EXTISS3_EXTI15_SS_msb				12u
#define AFIO_EXTISS3_EXTI15_SS_lsb				15u
	/* EXTI 14 sources selection */
#define AFIO_EXTISS3_EXTI14_SS_msb				8u
#define AFIO_EXTISS3_EXTI14_SS_lsb				11u
	/* EXTI 13 sources selection */
#define AFIO_EXTISS3_EXTI13_SS_msb				4u
#define AFIO_EXTISS3_EXTI13_SS_lsb				7u
	/* EXTI 12 sources selection */
#define AFIO_EXTISS3_EXTI12_SS_msb				0u
#define AFIO_EXTISS3_EXTI12_SS_lsb				3u

	/* 0x14 */
	uint8_t RESERVED5[0x1C-0x14];

	/* 0x1C: AFIO port configuration register 1 */
	uint32_t volatile PCF1;
	/* EXMC_NADV connect/disconnect */
#define AFIO_PCF1_EXMC_NADV					10u

};


#define BKP ((struct sdk_bkp *)0x40006C00)

struct sdk_bkp {

	/* 0x04: Backup data register 0 */
	uint32_t volatile DATA0;
	/* Backup data */
#define BKP_DATA0_DATA_msb					0u
#define BKP_DATA0_DATA_lsb					15u

	/* 0x04 */
	uint8_t RESERVED0[0x08-0x04];

	/* 0x08: Backup data register 1 */
	uint32_t volatile DATA1;
	/* Backup data */
#define BKP_DATA1_DATA_msb					0u
#define BKP_DATA1_DATA_lsb					15u

	/* 0x08 */
	uint8_t RESERVED1[0x0C-0x08];

	/* 0x0C: Backup data register 2 */
	uint32_t volatile DATA2;
	/* Backup data */
#define BKP_DATA2_DATA_msb					0u
#define BKP_DATA2_DATA_lsb					15u

	/* 0x0C */
	uint8_t RESERVED2[0x10-0x0C];

	/* 0x10: Backup data register 3 */
	uint32_t volatile DATA3;
	/* Backup data */
#define BKP_DATA3_DATA_msb					0u
#define BKP_DATA3_DATA_lsb					15u

	/* 0x10 */
	uint8_t RESERVED3[0x14-0x10];

	/* 0x14: Backup data register 4 */
	uint32_t volatile DATA4;
	/* Backup data */
#define BKP_DATA4_DATA_msb					0u
#define BKP_DATA4_DATA_lsb					15u

	/* 0x14 */
	uint8_t RESERVED4[0x18-0x14];

	/* 0x18: Backup data register 5 */
	uint32_t volatile DATA5;
	/* Backup data */
#define BKP_DATA5_DATA_msb					0u
#define BKP_DATA5_DATA_lsb					15u

	/* 0x18 */
	uint8_t RESERVED5[0x1C-0x18];

	/* 0x1C: Backup data register 6 */
	uint32_t volatile DATA6;
	/* Backup data */
#define BKP_DATA6_DATA_msb					0u
#define BKP_DATA6_DATA_lsb					15u

	/* 0x1C */
	uint8_t RESERVED6[0x20-0x1C];

	/* 0x20: Backup data register 7 */
	uint32_t volatile DATA7;
	/* Backup data */
#define BKP_DATA7_DATA_msb					0u
#define BKP_DATA7_DATA_lsb					15u

	/* 0x20 */
	uint8_t RESERVED7[0x24-0x20];

	/* 0x24: Backup data register 8 */
	uint32_t volatile DATA8;
	/* Backup data */
#define BKP_DATA8_DATA_msb					0u
#define BKP_DATA8_DATA_lsb					15u

	/* 0x24 */
	uint8_t RESERVED8[0x28-0x24];

	/* 0x28: Backup data register 9 */
	uint32_t volatile DATA9;
	/* Backup data */
#define BKP_DATA9_DATA_msb					0u
#define BKP_DATA9_DATA_lsb					15u

	/* 0x28 */
	uint8_t RESERVED9[0x40-0x28];

	/* 0x40: Backup data register 10 */
	uint32_t volatile DATA10;
	/* Backup data */
#define BKP_DATA10_DATA_msb					0u
#define BKP_DATA10_DATA_lsb					15u

