josuah/mcu-gd32vf103/registers.h
	/* 0x40 */
	uint8_t RESERVED10[0x44-0x40];

	/* 0x44: Backup data register 11 */
	uint32_t volatile DATA11;
	/* Backup data */
#define BKP_DATA11_DATA_msb					0u
#define BKP_DATA11_DATA_lsb					15u

	/* 0x44 */
	uint8_t RESERVED11[0x48-0x44];

	/* 0x48: Backup data register 12 */
	uint32_t volatile DATA12;
	/* Backup data */
#define BKP_DATA12_DATA_msb					0u
#define BKP_DATA12_DATA_lsb					15u

	/* 0x48 */
	uint8_t RESERVED12[0x4C-0x48];

	/* 0x4C: Backup data register 13 */
	uint32_t volatile DATA13;
	/* Backup data */
#define BKP_DATA13_DATA_msb					0u
#define BKP_DATA13_DATA_lsb					15u

	/* 0x4C */
	uint8_t RESERVED13[0x50-0x4C];

	/* 0x50: Backup data register 14 */
	uint32_t volatile DATA14;
	/* Backup data */
#define BKP_DATA14_DATA_msb					0u
#define BKP_DATA14_DATA_lsb					15u

	/* 0x50 */
	uint8_t RESERVED14[0x54-0x50];

	/* 0x54: Backup data register 15 */
	uint32_t volatile DATA15;
	/* Backup data */
#define BKP_DATA15_DATA_msb					0u
#define BKP_DATA15_DATA_lsb					15u

	/* 0x54 */
	uint8_t RESERVED15[0x58-0x54];

	/* 0x58: Backup data register 16 */
	uint32_t volatile DATA16;
	/* Backup data */
#define BKP_DATA16_DATA_msb					0u
#define BKP_DATA16_DATA_lsb					15u

	/* 0x58 */
	uint8_t RESERVED16[0x5C-0x58];

	/* 0x5C: Backup data register 17 */
	uint32_t volatile DATA17;
	/* Backup data */
#define BKP_DATA17_DATA_msb					0u
#define BKP_DATA17_DATA_lsb					15u

	/* 0x5C */
	uint8_t RESERVED17[0x60-0x5C];

	/* 0x60: Backup data register 18 */
	uint32_t volatile DATA18;
	/* Backup data */
#define BKP_DATA18_DATA_msb					0u
#define BKP_DATA18_DATA_lsb					15u

	/* 0x60 */
	uint8_t RESERVED18[0x64-0x60];

	/* 0x64: Backup data register 19 */
	uint32_t volatile DATA19;
	/* Backup data */
#define BKP_DATA19_DATA_msb					0u
#define BKP_DATA19_DATA_lsb					15u

	/* 0x64 */
	uint8_t RESERVED19[0x68-0x64];

	/* 0x68: Backup data register 20 */
	uint32_t volatile DATA20;
	/* Backup data */
#define BKP_DATA20_DATA_msb					0u
#define BKP_DATA20_DATA_lsb					15u

	/* 0x68 */
	uint8_t RESERVED20[0x6C-0x68];

	/* 0x6C: Backup data register 21 */
	uint32_t volatile DATA21;
	/* Backup data */
#define BKP_DATA21_DATA_msb					0u
#define BKP_DATA21_DATA_lsb					15u

	/* 0x6C */
	uint8_t RESERVED21[0x70-0x6C];

	/* 0x70: Backup data register 22 */
	uint32_t volatile DATA22;
	/* Backup data */
#define BKP_DATA22_DATA_msb					0u
#define BKP_DATA22_DATA_lsb					15u

	/* 0x70 */
	uint8_t RESERVED22[0x74-0x70];

	/* 0x74: Backup data register 23 */
	uint32_t volatile DATA23;
	/* Backup data */
#define BKP_DATA23_DATA_msb					0u
#define BKP_DATA23_DATA_lsb					15u

	/* 0x74 */
	uint8_t RESERVED23[0x78-0x74];

	/* 0x78: Backup data register 24 */
	uint32_t volatile DATA24;
	/* Backup data */
#define BKP_DATA24_DATA_msb					0u
#define BKP_DATA24_DATA_lsb					15u

	/* 0x78 */
	uint8_t RESERVED24[0x7C-0x78];

	/* 0x7C: Backup data register 25 */
	uint32_t volatile DATA25;
	/* Backup data */
#define BKP_DATA25_DATA_msb					0u
#define BKP_DATA25_DATA_lsb					15u

	/* 0x7C */
	uint8_t RESERVED25[0x80-0x7C];

	/* 0x80: Backup data register 26 */
	uint32_t volatile DATA26;
	/* Backup data */
#define BKP_DATA26_DATA_msb					0u
#define BKP_DATA26_DATA_lsb					15u

	/* 0x80 */
	uint8_t RESERVED26[0x84-0x80];

	/* 0x84: Backup data register 27 */
	uint32_t volatile DATA27;
	/* Backup data */
#define BKP_DATA27_DATA_msb					0u
#define BKP_DATA27_DATA_lsb					15u

	/* 0x84 */
	uint8_t RESERVED27[0x88-0x84];

	/* 0x88: Backup data register 28 */
	uint32_t volatile DATA28;
	/* Backup data */
#define BKP_DATA28_DATA_msb					0u
#define BKP_DATA28_DATA_lsb					15u

	/* 0x88 */
	uint8_t RESERVED28[0x8C-0x88];

	/* 0x8C: Backup data register 29 */
	uint32_t volatile DATA29;
	/* Backup data */
#define BKP_DATA29_DATA_msb					0u
#define BKP_DATA29_DATA_lsb					15u

	/* 0x8C */
	uint8_t RESERVED29[0x90-0x8C];

	/* 0x90: Backup data register 30 */
	uint32_t volatile DATA30;
	/* Backup data */
#define BKP_DATA30_DATA_msb					0u
#define BKP_DATA30_DATA_lsb					15u

	/* 0x90 */
	uint8_t RESERVED30[0x94-0x90];

	/* 0x94: Backup data register 31 */
	uint32_t volatile DATA31;
	/* Backup data */
#define BKP_DATA31_DATA_msb					0u
#define BKP_DATA31_DATA_lsb					15u

	/* 0x94 */
	uint8_t RESERVED31[0x98-0x94];

	/* 0x98: Backup data register 32 */
	uint32_t volatile DATA32;
	/* Backup data */
#define BKP_DATA32_DATA_msb					0u
#define BKP_DATA32_DATA_lsb					15u

	/* 0x98 */
	uint8_t RESERVED32[0x9C-0x98];

	/* 0x9C: Backup data register 33 */
	uint32_t volatile DATA33;
	/* Backup data */
#define BKP_DATA33_DATA_msb					0u
#define BKP_DATA33_DATA_lsb					15u

	/* 0x9C */
	uint8_t RESERVED33[0xA0-0x9C];

	/* 0xA0: Backup data register 34 */
	uint32_t volatile DATA34;
	/* Backup data */
#define BKP_DATA34_DATA_msb					0u
#define BKP_DATA34_DATA_lsb					15u

	/* 0xA0 */
	uint8_t RESERVED34[0xA4-0xA0];

	/* 0xA4: Backup data register 35 */
	uint32_t volatile DATA35;
	/* Backup data */
#define BKP_DATA35_DATA_msb					0u
#define BKP_DATA35_DATA_lsb					15u

	/* 0xA4 */
	uint8_t RESERVED35[0xA8-0xA4];

	/* 0xA8: Backup data register 36 */
	uint32_t volatile DATA36;
	/* Backup data */
#define BKP_DATA36_DATA_msb					0u
#define BKP_DATA36_DATA_lsb					15u

	/* 0xA8 */
	uint8_t RESERVED36[0xAC-0xA8];

	/* 0xAC: Backup data register 37 */
	uint32_t volatile DATA37;
	/* Backup data */
#define BKP_DATA37_DATA_msb					0u
#define BKP_DATA37_DATA_lsb					15u

	/* 0xAC */
	uint8_t RESERVED37[0xB0-0xAC];

	/* 0xB0: Backup data register 38 */
	uint32_t volatile DATA38;
	/* Backup data */
#define BKP_DATA38_DATA_msb					0u
#define BKP_DATA38_DATA_lsb					15u

	/* 0xB0 */
	uint8_t RESERVED38[0xB4-0xB0];

	/* 0xB4: Backup data register 39 */
	uint32_t volatile DATA39;
	/* Backup data */
#define BKP_DATA39_DATA_msb					0u
#define BKP_DATA39_DATA_lsb					15u

	/* 0xB4 */
	uint8_t RESERVED39[0xB8-0xB4];

	/* 0xB8: Backup data register 40 */
	uint32_t volatile DATA40;
	/* Backup data */
#define BKP_DATA40_DATA_msb					0u
#define BKP_DATA40_DATA_lsb					15u

