josuah/mcu-gd32vf103/registers.h
	/* 0xB8 */
	uint8_t RESERVED40[0xBC-0xB8];

	/* 0xBC: Backup data register 41 */
	uint32_t volatile DATA41;
	/* Backup data */
#define BKP_DATA41_DATA_msb					0u
#define BKP_DATA41_DATA_lsb					15u

	/* 0x2C: RTC signal output control register */
	uint32_t volatile OCTL;
	/* RTC output selection */
#define BKP_OCTL_ROSEL						9u
	/* RTC alarm or second signal output enable */
#define BKP_OCTL_ASOEN						8u
	/* RTC clock calibration output enable */
#define BKP_OCTL_COEN						7u
	/* RTC clock calibration value */
#define BKP_OCTL_RCCV_msb					0u
#define BKP_OCTL_RCCV_lsb					6u

	/* 0x2C */
	uint8_t RESERVED41[0x30-0x2C];

	/* 0x30: Tamper pin control register */
	uint32_t volatile TPCTL;
	/* TAMPER pin active level */
#define BKP_TPCTL_TPAL						1u
	/* TAMPER detection enable */
#define BKP_TPCTL_TPEN						0u

	/* 0x30 */
	uint8_t RESERVED42[0x34-0x30];

	/* 0x34: Tamper control and status register */
	uint32_t volatile TPCS;
	/* Tamper interrupt flag */
#define BKP_TPCS_TIF						9u
	/* Tamper event flag */
#define BKP_TPCS_TEF						8u
	/* Tamper interrupt enable */
#define BKP_TPCS_TPIE						2u
	/* Tamper interrupt reset */
#define BKP_TPCS_TIR						1u
	/* Tamper event reset */
#define BKP_TPCS_TER						0u

};


#define CAN0 ((struct sdk_can *)0x40006400)
#define CAN1 ((struct sdk_can *)0x40006800)

struct sdk_can {

	/* 0x00: Control register */
	uint32_t volatile CTL;
	/* Debug freeze */
#define CAN0_CTL_DFZ						16u
	/* Software reset */
#define CAN0_CTL_SWRST						15u
	/* Time-triggered communication */
#define CAN0_CTL_TTC						7u
	/* Automatic bus-off recovery */
#define CAN0_CTL_ABOR						6u
	/* Automatic wakeup */
#define CAN0_CTL_AWU						5u
	/* Automatic retransmission disable */
#define CAN0_CTL_ARD						4u
	/* Receive FIFO overwrite disable */
#define CAN0_CTL_RFOD						3u
	/* Transmit FIFO order */
#define CAN0_CTL_TFO						2u
	/* Sleep working mode */
#define CAN0_CTL_SLPWMOD					1u
	/* Initial working mode */
#define CAN0_CTL_IWMOD						0u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: Status register */
	uint32_t volatile STAT;
	/* RX level */
#define CAN0_STAT_RXL						11u
	/* Last sample value of RX pin */
#define CAN0_STAT_LASTRX					10u
	/* Receiving state */
#define CAN0_STAT_RS						9u
	/* Transmitting state */
#define CAN0_STAT_TS						8u
	/* Status change interrupt flag of sleep */
#define CAN0_STAT_SLPIF						4u
	/* Status change interrupt flag of wakeup */
#define CAN0_STAT_WUIF						3u
	/* Error interrupt flag */
#define CAN0_STAT_ERRIF						2u
	/* Sleep working state */
#define CAN0_STAT_SLPWS						1u
	/* Initial working state */
#define CAN0_STAT_IWS						0u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: Transmit status register */
	uint32_t volatile TSTAT;
	/* Transmit mailbox 2 last sending */
#define CAN0_TSTAT_TMLS2					31u
	/* Transmit mailbox 1 last sending */
#define CAN0_TSTAT_TMLS1					30u
	/* Transmit mailbox 0 last sending */
#define CAN0_TSTAT_TMLS0					29u
	/* Transmit mailbox 2 empty */
#define CAN0_TSTAT_TME2						28u
	/* Transmit mailbox 1 empty */
#define CAN0_TSTAT_TME1						27u
	/* Transmit mailbox 0 empty */
#define CAN0_TSTAT_TME0						26u
	/* number of the transmit FIFO mailbox in */
#define CAN0_TSTAT_NUM_msb					24u
#define CAN0_TSTAT_NUM_lsb					25u
	/* Mailbox 2 stop transmitting */
#define CAN0_TSTAT_MST2						23u
	/* Mailbox 2 transmit error */
#define CAN0_TSTAT_MTE2						19u
	/* Mailbox 2 arbitration lost */
#define CAN0_TSTAT_MAL2						18u
	/* Mailbox 2 transmit finished and no error */
#define CAN0_TSTAT_MTFNERR2					17u
	/* Mailbox 2 transmit finished */
#define CAN0_TSTAT_MTF2						16u
	/* Mailbox 1 stop transmitting */
#define CAN0_TSTAT_MST1						15u
	/* Mailbox 1 transmit error */
#define CAN0_TSTAT_MTE1						11u
	/* Mailbox 1 arbitration lost */
#define CAN0_TSTAT_MAL1						10u
	/* Mailbox 1 transmit finished and no error */
#define CAN0_TSTAT_MTFNERR1					9u
	/* Mailbox 1 transmit finished */
#define CAN0_TSTAT_MTF1						8u
	/* Mailbox 0 stop transmitting */
#define CAN0_TSTAT_MST0						7u
	/* Mailbox 0 transmit error */
#define CAN0_TSTAT_MTE0						3u
	/* Mailbox 0 arbitration lost */
#define CAN0_TSTAT_MAL0						2u
	/* Mailbox 0 transmit finished and no error */
#define CAN0_TSTAT_MTFNERR0					1u
	/* Mailbox 0 transmit finished */
#define CAN0_TSTAT_MTF0						0u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C: Receive message FIFO0 register */
	uint32_t volatile RFIFO0;
	/* Receive FIFO0 dequeue */
#define CAN0_RFIFO0_RFD0					5u
	/* Receive FIFO0 overfull */
#define CAN0_RFIFO0_RFO0					4u
	/* Receive FIFO0 full */
#define CAN0_RFIFO0_RFF0					3u
	/* Receive FIFO0 length */
#define CAN0_RFIFO0_RFL0_msb					0u
#define CAN0_RFIFO0_RFL0_lsb					1u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

	/* 0x10: Receive message FIFO1 register */
	uint32_t volatile RFIFO1;
	/* Receive FIFO1 dequeue */
#define CAN0_RFIFO1_RFD1					5u
	/* Receive FIFO1 overfull */
#define CAN0_RFIFO1_RFO1					4u
	/* Receive FIFO1 full */
#define CAN0_RFIFO1_RFF1					3u
	/* Receive FIFO1 length */
#define CAN0_RFIFO1_RFL1_msb					0u
#define CAN0_RFIFO1_RFL1_lsb					1u

	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: Interrupt enable register */
	uint32_t volatile INTEN;
	/* Sleep working interrupt enable */
#define CAN0_INTEN_SLPWIE					17u
	/* Wakeup interrupt enable */
#define CAN0_INTEN_WIE						16u
	/* Error interrupt enable */
#define CAN0_INTEN_ERRIE					15u
	/* Error number interrupt enable */
#define CAN0_INTEN_ERRNIE					11u
	/* Bus-off interrupt enable */
#define CAN0_INTEN_BOIE						10u
	/* Passive error interrupt enable */
#define CAN0_INTEN_PERRIE					9u
	/* Warning error interrupt enable */
#define CAN0_INTEN_WERRIE					8u
	/* Receive FIFO1 overfull interrupt enable */
#define CAN0_INTEN_RFOIE1					6u
	/* Receive FIFO1 full interrupt enable */
#define CAN0_INTEN_RFFIE1					5u
	/* Receive FIFO1 not empty interrupt enable */
#define CAN0_INTEN_RFNEIE1					4u
	/* Receive FIFO0 overfull interrupt enable */
#define CAN0_INTEN_RFOIE0					3u
	/* Receive FIFO0 full interrupt enable */
#define CAN0_INTEN_RFFIE0					2u
	/* Receive FIFO0 not empty interrupt enable */
#define CAN0_INTEN_RFNEIE0					1u
	/* Transmit mailbox empty interrupt enable */
#define CAN0_INTEN_TMEIE					0u

	/* 0x14 */
	uint8_t RESERVED5[0x18-0x14];

	/* 0x18: Error register */
	uint32_t volatile ERR;
	/* Receive Error Count defined */
#define CAN0_ERR_RECNT_msb					24u
#define CAN0_ERR_RECNT_lsb					31u
	/* Transmit Error Count defined */
#define CAN0_ERR_TECNT_msb					16u
#define CAN0_ERR_TECNT_lsb					23u
	/* Error number */
#define CAN0_ERR_ERRN_msb					4u
#define CAN0_ERR_ERRN_lsb					6u
	/* Bus-off error */
#define CAN0_ERR_BOERR						2u
	/* Passive error */
#define CAN0_ERR_PERR						1u
	/* Warning error */
#define CAN0_ERR_WERR						0u

	/* 0x18 */
	uint8_t RESERVED6[0x1C-0x18];

