josuah/mcu-gd32vf103/registers.h
	/* 0x1C: Bit timing register */
	uint32_t volatile BT;
	/* Silent communication mode */
#define CAN0_BT_SCMOD						31u
	/* Loopback communication mode */
#define CAN0_BT_LCMOD						30u
	/* Resynchronization jump width */
#define CAN0_BT_SJW_msb						24u
#define CAN0_BT_SJW_lsb						25u
	/* Bit segment 2 */
#define CAN0_BT_BS2_msb						20u
#define CAN0_BT_BS2_lsb						22u
	/* Bit segment 1 */
#define CAN0_BT_BS1_msb						16u
#define CAN0_BT_BS1_lsb						19u
	/* Baud rate prescaler */
#define CAN0_BT_BAUDPSC_msb					0u
#define CAN0_BT_BAUDPSC_lsb					9u

	/* 0x1C */
	uint8_t RESERVED7[0x180-0x1C];

	/* 0x180: Transmit mailbox identifier register 0 */
	uint32_t volatile TMI0;
	/* The frame identifier */
#define CAN0_TMI0_SFID_EFID_msb					21u
#define CAN0_TMI0_SFID_EFID_lsb					31u
	/* The frame identifier */
#define CAN0_TMI0_EFID_msb					3u
#define CAN0_TMI0_EFID_lsb					20u
	/* Frame format */
#define CAN0_TMI0_FF						2u
	/* Frame type */
#define CAN0_TMI0_FT						1u
	/* Transmit enable */
#define CAN0_TMI0_TEN						0u

	/* 0x180 */
	uint8_t RESERVED8[0x184-0x180];

	/* 0x184: Transmit mailbox property register 0 */
	uint32_t volatile TMP0;
	/* Time stamp */
#define CAN0_TMP0_TS_msb					16u
#define CAN0_TMP0_TS_lsb					31u
	/* Time stamp enable */
#define CAN0_TMP0_TSEN						8u
	/* Data length code */
#define CAN0_TMP0_DLENC_msb					0u
#define CAN0_TMP0_DLENC_lsb					3u

	/* 0x184 */
	uint8_t RESERVED9[0x188-0x184];

	/* 0x188: Transmit mailbox data0 register */
	uint32_t volatile TMDATA00;
	/* Data byte 3 */
#define CAN0_TMDATA00_DB3_msb					24u
#define CAN0_TMDATA00_DB3_lsb					31u
	/* Data byte 2 */
#define CAN0_TMDATA00_DB2_msb					16u
#define CAN0_TMDATA00_DB2_lsb					23u
	/* Data byte 1 */
#define CAN0_TMDATA00_DB1_msb					8u
#define CAN0_TMDATA00_DB1_lsb					15u
	/* Data byte 0 */
#define CAN0_TMDATA00_DB0_msb					0u
#define CAN0_TMDATA00_DB0_lsb					7u

	/* 0x188 */
	uint8_t RESERVED10[0x18C-0x188];

	/* 0x18C: Transmit mailbox data1 register */
	uint32_t volatile TMDATA10;
	/* Data byte 7 */
#define CAN0_TMDATA10_DB7_msb					24u
#define CAN0_TMDATA10_DB7_lsb					31u
	/* Data byte 6 */
#define CAN0_TMDATA10_DB6_msb					16u
#define CAN0_TMDATA10_DB6_lsb					23u
	/* Data byte 5 */
#define CAN0_TMDATA10_DB5_msb					8u
#define CAN0_TMDATA10_DB5_lsb					15u
	/* Data byte 4 */
#define CAN0_TMDATA10_DB4_msb					0u
#define CAN0_TMDATA10_DB4_lsb					7u

	/* 0x18C */
	uint8_t RESERVED11[0x190-0x18C];

	/* 0x190: Transmit mailbox identifier register 1 */
	uint32_t volatile TMI1;
	/* The frame identifier */
#define CAN0_TMI1_SFID_EFID_msb					21u
#define CAN0_TMI1_SFID_EFID_lsb					31u
	/* The frame identifier */
#define CAN0_TMI1_EFID_msb					3u
#define CAN0_TMI1_EFID_lsb					20u
	/* Frame format */
#define CAN0_TMI1_FF						2u
	/* Frame type */
#define CAN0_TMI1_FT						1u
	/* Transmit enable */
#define CAN0_TMI1_TEN						0u

	/* 0x190 */
	uint8_t RESERVED12[0x194-0x190];

	/* 0x194: Transmit mailbox property register 1 */
	uint32_t volatile TMP1;
	/* Time stamp */
#define CAN0_TMP1_TS_msb					16u
#define CAN0_TMP1_TS_lsb					31u
	/* Time stamp enable */
#define CAN0_TMP1_TSEN						8u
	/* Data length code */
#define CAN0_TMP1_DLENC_msb					0u
#define CAN0_TMP1_DLENC_lsb					3u

	/* 0x194 */
	uint8_t RESERVED13[0x198-0x194];

	/* 0x198: Transmit mailbox data0 register */
	uint32_t volatile TMDATA01;
	/* Data byte 3 */
#define CAN0_TMDATA01_DB3_msb					24u
#define CAN0_TMDATA01_DB3_lsb					31u
	/* Data byte 2 */
#define CAN0_TMDATA01_DB2_msb					16u
#define CAN0_TMDATA01_DB2_lsb					23u
	/* Data byte 1 */
#define CAN0_TMDATA01_DB1_msb					8u
#define CAN0_TMDATA01_DB1_lsb					15u
	/* Data byte 0 */
#define CAN0_TMDATA01_DB0_msb					0u
#define CAN0_TMDATA01_DB0_lsb					7u

	/* 0x198 */
	uint8_t RESERVED14[0x19C-0x198];

	/* 0x19C: Transmit mailbox data1 register */
	uint32_t volatile TMDATA11;
	/* Data byte 7 */
#define CAN0_TMDATA11_DB7_msb					24u
#define CAN0_TMDATA11_DB7_lsb					31u
	/* Data byte 6 */
#define CAN0_TMDATA11_DB6_msb					16u
#define CAN0_TMDATA11_DB6_lsb					23u
	/* Data byte 5 */
#define CAN0_TMDATA11_DB5_msb					8u
#define CAN0_TMDATA11_DB5_lsb					15u
	/* Data byte 4 */
#define CAN0_TMDATA11_DB4_msb					0u
#define CAN0_TMDATA11_DB4_lsb					7u

	/* 0x19C */
	uint8_t RESERVED15[0x1A0-0x19C];

	/* 0x1A0: Transmit mailbox identifier register 2 */
	uint32_t volatile TMI2;
	/* The frame identifier */
#define CAN0_TMI2_SFID_EFID_msb					21u
#define CAN0_TMI2_SFID_EFID_lsb					31u
	/* The frame identifier */
#define CAN0_TMI2_EFID_msb					3u
#define CAN0_TMI2_EFID_lsb					20u
	/* Frame format */
#define CAN0_TMI2_FF						2u
	/* Frame type */
#define CAN0_TMI2_FT						1u
	/* Transmit enable */
#define CAN0_TMI2_TEN						0u

	/* 0x1A0 */
	uint8_t RESERVED16[0x1A4-0x1A0];

	/* 0x1A4: Transmit mailbox property register 2 */
	uint32_t volatile TMP2;
	/* Time stamp */
#define CAN0_TMP2_TS_msb					16u
#define CAN0_TMP2_TS_lsb					31u
	/* Time stamp enable */
#define CAN0_TMP2_TSEN						8u
	/* Data length code */
#define CAN0_TMP2_DLENC_msb					0u
#define CAN0_TMP2_DLENC_lsb					3u

	/* 0x1A4 */
	uint8_t RESERVED17[0x1A8-0x1A4];

	/* 0x1A8: Transmit mailbox data0 register */
	uint32_t volatile TMDATA02;
	/* Data byte 3 */
#define CAN0_TMDATA02_DB3_msb					24u
#define CAN0_TMDATA02_DB3_lsb					31u
	/* Data byte 2 */
#define CAN0_TMDATA02_DB2_msb					16u
#define CAN0_TMDATA02_DB2_lsb					23u
	/* Data byte 1 */
#define CAN0_TMDATA02_DB1_msb					8u
#define CAN0_TMDATA02_DB1_lsb					15u
	/* Data byte 0 */
#define CAN0_TMDATA02_DB0_msb					0u
#define CAN0_TMDATA02_DB0_lsb					7u

	/* 0x1A8 */
	uint8_t RESERVED18[0x1AC-0x1A8];

	/* 0x1AC: Transmit mailbox data1 register */
	uint32_t volatile TMDATA12;
	/* Data byte 7 */
#define CAN0_TMDATA12_DB7_msb					24u
#define CAN0_TMDATA12_DB7_lsb					31u
	/* Data byte 6 */
#define CAN0_TMDATA12_DB6_msb					16u
#define CAN0_TMDATA12_DB6_lsb					23u
	/* Data byte 5 */
#define CAN0_TMDATA12_DB5_msb					8u
#define CAN0_TMDATA12_DB5_lsb					15u
	/* Data byte 4 */
#define CAN0_TMDATA12_DB4_msb					0u
#define CAN0_TMDATA12_DB4_lsb					7u

	/* 0x1AC */
	uint8_t RESERVED19[0x1B0-0x1AC];

	/* 0x1B0: Receive FIFO mailbox identifier register */
	uint32_t volatile RFIFOMI0;
	/* The frame identifier */
#define CAN0_RFIFOMI0_SFID_EFID_msb				21u
#define CAN0_RFIFOMI0_SFID_EFID_lsb				31u
	/* The frame identifier */
#define CAN0_RFIFOMI0_EFID_msb					3u
#define CAN0_RFIFOMI0_EFID_lsb					20u
	/* Frame format */
#define CAN0_RFIFOMI0_FF					2u
	/* Frame type */
#define CAN0_RFIFOMI0_FT					1u

	/* 0x1B0 */
	uint8_t RESERVED20[0x1B4-0x1B0];

	/* 0x1B4: Receive FIFO0 mailbox property register */
	uint32_t volatile RFIFOMP0;
	/* Time stamp */
#define CAN0_RFIFOMP0_TS_msb					16u
#define CAN0_RFIFOMP0_TS_lsb					31u
	/* Filtering index */
#define CAN0_RFIFOMP0_FI_msb					8u
#define CAN0_RFIFOMP0_FI_lsb					15u
	/* Data length code */
#define CAN0_RFIFOMP0_DLENC_msb					0u
#define CAN0_RFIFOMP0_DLENC_lsb					3u

