josuah/mcu-gd32vf103/registers.h
	/* 0x1B4 */
	uint8_t RESERVED21[0x1B8-0x1B4];

	/* 0x1B8: Receive FIFO0 mailbox data0 register */
	uint32_t volatile RFIFOMDATA00;
	/* Data byte 3 */
#define CAN0_RFIFOMDATA00_DB3_msb				24u
#define CAN0_RFIFOMDATA00_DB3_lsb				31u
	/* Data byte 2 */
#define CAN0_RFIFOMDATA00_DB2_msb				16u
#define CAN0_RFIFOMDATA00_DB2_lsb				23u
	/* Data byte 1 */
#define CAN0_RFIFOMDATA00_DB1_msb				8u
#define CAN0_RFIFOMDATA00_DB1_lsb				15u
	/* Data byte 0 */
#define CAN0_RFIFOMDATA00_DB0_msb				0u
#define CAN0_RFIFOMDATA00_DB0_lsb				7u

	/* 0x1B8 */
	uint8_t RESERVED22[0x1BC-0x1B8];

	/* 0x1BC: Receive FIFO0 mailbox data1 register */
	uint32_t volatile RFIFOMDATA10;
	/* Data byte 7 */
#define CAN0_RFIFOMDATA10_DB7_msb				24u
#define CAN0_RFIFOMDATA10_DB7_lsb				31u
	/* Data byte 6 */
#define CAN0_RFIFOMDATA10_DB6_msb				16u
#define CAN0_RFIFOMDATA10_DB6_lsb				23u
	/* Data byte 5 */
#define CAN0_RFIFOMDATA10_DB5_msb				8u
#define CAN0_RFIFOMDATA10_DB5_lsb				15u
	/* Data byte 4 */
#define CAN0_RFIFOMDATA10_DB4_msb				0u
#define CAN0_RFIFOMDATA10_DB4_lsb				7u

	/* 0x1BC */
	uint8_t RESERVED23[0x1C0-0x1BC];

	/* 0x1C0: Receive FIFO1 mailbox identifier register */
	uint32_t volatile RFIFOMI1;
	/* The frame identifier */
#define CAN0_RFIFOMI1_SFID_EFID_msb				21u
#define CAN0_RFIFOMI1_SFID_EFID_lsb				31u
	/* The frame identifier */
#define CAN0_RFIFOMI1_EFID_msb					3u
#define CAN0_RFIFOMI1_EFID_lsb					20u
	/* Frame format */
#define CAN0_RFIFOMI1_FF					2u
	/* Frame type */
#define CAN0_RFIFOMI1_FT					1u

	/* 0x1C0 */
	uint8_t RESERVED24[0x1C4-0x1C0];

	/* 0x1C4: Receive FIFO1 mailbox property register */
	uint32_t volatile RFIFOMP1;
	/* Time stamp */
#define CAN0_RFIFOMP1_TS_msb					16u
#define CAN0_RFIFOMP1_TS_lsb					31u
	/* Filtering index */
#define CAN0_RFIFOMP1_FI_msb					8u
#define CAN0_RFIFOMP1_FI_lsb					15u
	/* Data length code */
#define CAN0_RFIFOMP1_DLENC_msb					0u
#define CAN0_RFIFOMP1_DLENC_lsb					3u

	/* 0x1C4 */
	uint8_t RESERVED25[0x1C8-0x1C4];

	/* 0x1C8: Receive FIFO1 mailbox data0 register */
	uint32_t volatile RFIFOMDATA01;
	/* Data byte 3 */
#define CAN0_RFIFOMDATA01_DB3_msb				24u
#define CAN0_RFIFOMDATA01_DB3_lsb				31u
	/* Data byte 2 */
#define CAN0_RFIFOMDATA01_DB2_msb				16u
#define CAN0_RFIFOMDATA01_DB2_lsb				23u
	/* Data byte 1 */
#define CAN0_RFIFOMDATA01_DB1_msb				8u
#define CAN0_RFIFOMDATA01_DB1_lsb				15u
	/* Data byte 0 */
#define CAN0_RFIFOMDATA01_DB0_msb				0u
#define CAN0_RFIFOMDATA01_DB0_lsb				7u

	/* 0x1C8 */
	uint8_t RESERVED26[0x1CC-0x1C8];

	/* 0x1CC: Receive FIFO1 mailbox data1 register */
	uint32_t volatile RFIFOMDATA11;
	/* Data byte 7 */
#define CAN0_RFIFOMDATA11_DB7_msb				24u
#define CAN0_RFIFOMDATA11_DB7_lsb				31u
	/* Data byte 6 */
#define CAN0_RFIFOMDATA11_DB6_msb				16u
#define CAN0_RFIFOMDATA11_DB6_lsb				23u
	/* Data byte 5 */
#define CAN0_RFIFOMDATA11_DB5_msb				8u
#define CAN0_RFIFOMDATA11_DB5_lsb				15u
	/* Data byte 4 */
#define CAN0_RFIFOMDATA11_DB4_msb				0u
#define CAN0_RFIFOMDATA11_DB4_lsb				7u

	/* 0x1CC */
	uint8_t RESERVED27[0x200-0x1CC];

	/* 0x200: Filter control register */
	uint32_t volatile FCTL;
	/* Header bank of CAN1 filter */
#define CAN0_FCTL_HBC1F_msb					8u
#define CAN0_FCTL_HBC1F_lsb					13u
	/* Filter lock disable */
#define CAN0_FCTL_FLD						0u

	/* 0x200 */
	uint8_t RESERVED28[0x204-0x200];

	/* 0x204: Filter mode configuration register */
	uint32_t volatile FMCFG;
	/* Filter mode */
#define CAN0_FMCFG_FMOD27					27u
	/* Filter mode */
#define CAN0_FMCFG_FMOD26					26u
	/* Filter mode */
#define CAN0_FMCFG_FMOD25					25u
	/* Filter mode */
#define CAN0_FMCFG_FMOD24					24u
	/* Filter mode */
#define CAN0_FMCFG_FMOD23					23u
	/* Filter mode */
#define CAN0_FMCFG_FMOD22					22u
	/* Filter mode */
#define CAN0_FMCFG_FMOD21					21u
	/* Filter mode */
#define CAN0_FMCFG_FMOD20					20u
	/* Filter mode */
#define CAN0_FMCFG_FMOD19					19u
	/* Filter mode */
#define CAN0_FMCFG_FMOD18					18u
	/* Filter mode */
#define CAN0_FMCFG_FMOD17					17u
	/* Filter mode */
#define CAN0_FMCFG_FMOD16					16u
	/* Filter mode */
#define CAN0_FMCFG_FMOD15					15u
	/* Filter mode */
#define CAN0_FMCFG_FMOD14					14u
	/* Filter mode */
#define CAN0_FMCFG_FMOD13					13u
	/* Filter mode */
#define CAN0_FMCFG_FMOD12					12u
	/* Filter mode */
#define CAN0_FMCFG_FMOD11					11u
	/* Filter mode */
#define CAN0_FMCFG_FMOD10					10u
	/* Filter mode */
#define CAN0_FMCFG_FMOD9					9u
	/* Filter mode */
#define CAN0_FMCFG_FMOD8					8u
	/* Filter mode */
#define CAN0_FMCFG_FMOD7					7u
	/* Filter mode */
#define CAN0_FMCFG_FMOD6					6u
	/* Filter mode */
#define CAN0_FMCFG_FMOD5					5u
	/* Filter mode */
#define CAN0_FMCFG_FMOD4					4u
	/* Filter mode */
#define CAN0_FMCFG_FMOD3					3u
	/* Filter mode */
#define CAN0_FMCFG_FMOD2					2u
	/* Filter mode */
#define CAN0_FMCFG_FMOD1					1u
	/* Filter mode */
#define CAN0_FMCFG_FMOD0					0u

	/* 0x204 */
	uint8_t RESERVED29[0x20C-0x204];

	/* 0x20C: Filter scale configuration register */
	uint32_t volatile FSCFG;
	/* Filter scale configuration */
#define CAN0_FSCFG_FS0						0u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS1						1u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS2						2u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS3						3u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS4						4u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS5						5u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS6						6u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS7						7u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS8						8u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS9						9u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS10						10u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS11						11u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS12						12u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS13						13u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS14						14u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS15						15u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS16						16u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS17						17u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS18						18u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS19						19u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS20						20u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS21						21u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS22						22u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS23						23u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS24						24u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS25						25u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS26						26u
	/* Filter scale configuration */
#define CAN0_FSCFG_FS27						27u

