josuah/mcu-gd32vf103/registers.h
	/* 0x20C */
	uint8_t RESERVED30[0x214-0x20C];

	/* 0x214: Filter associated FIFO register */
	uint32_t volatile FAFIFO;
	/* Filter 0 associated with FIFO */
#define CAN0_FAFIFO_FAF0					0u
	/* Filter 1 associated with FIFO */
#define CAN0_FAFIFO_FAF1					1u
	/* Filter 2 associated with FIFO */
#define CAN0_FAFIFO_FAF2					2u
	/* Filter 3 associated with FIFO */
#define CAN0_FAFIFO_FAF3					3u
	/* Filter 4 associated with FIFO */
#define CAN0_FAFIFO_FAF4					4u
	/* Filter 5 associated with FIFO */
#define CAN0_FAFIFO_FAF5					5u
	/* Filter 6 associated with FIFO */
#define CAN0_FAFIFO_FAF6					6u
	/* Filter 7 associated with FIFO */
#define CAN0_FAFIFO_FAF7					7u
	/* Filter 8 associated with FIFO */
#define CAN0_FAFIFO_FAF8					8u
	/* Filter 9 associated with FIFO */
#define CAN0_FAFIFO_FAF9					9u
	/* Filter 10 associated with FIFO */
#define CAN0_FAFIFO_FAF10					10u
	/* Filter 11 associated with FIFO */
#define CAN0_FAFIFO_FAF11					11u
	/* Filter 12 associated with FIFO */
#define CAN0_FAFIFO_FAF12					12u
	/* Filter 13 associated with FIFO */
#define CAN0_FAFIFO_FAF13					13u
	/* Filter 14 associated with FIFO */
#define CAN0_FAFIFO_FAF14					14u
	/* Filter 15 associated with FIFO */
#define CAN0_FAFIFO_FAF15					15u
	/* Filter 16 associated with FIFO */
#define CAN0_FAFIFO_FAF16					16u
	/* Filter 17 associated with FIFO */
#define CAN0_FAFIFO_FAF17					17u
	/* Filter 18 associated with FIFO */
#define CAN0_FAFIFO_FAF18					18u
	/* Filter 19 associated with FIFO */
#define CAN0_FAFIFO_FAF19					19u
	/* Filter 20 associated with FIFO */
#define CAN0_FAFIFO_FAF20					20u
	/* Filter 21 associated with FIFO */
#define CAN0_FAFIFO_FAF21					21u
	/* Filter 22 associated with FIFO */
#define CAN0_FAFIFO_FAF22					22u
	/* Filter 23 associated with FIFO */
#define CAN0_FAFIFO_FAF23					23u
	/* Filter 24 associated with FIFO */
#define CAN0_FAFIFO_FAF24					24u
	/* Filter 25 associated with FIFO */
#define CAN0_FAFIFO_FAF25					25u
	/* Filter 26 associated with FIFO */
#define CAN0_FAFIFO_FAF26					26u
	/* Filter 27 associated with FIFO */
#define CAN0_FAFIFO_FAF27					27u

	/* 0x214 */
	uint8_t RESERVED31[0x21C-0x214];

	/* 0x21C: Filter working register */
	uint32_t volatile FW;
	/* Filter working */
#define CAN0_FW_FW0						0u
	/* Filter working */
#define CAN0_FW_FW1						1u
	/* Filter working */
#define CAN0_FW_FW2						2u
	/* Filter working */
#define CAN0_FW_FW3						3u
	/* Filter working */
#define CAN0_FW_FW4						4u
	/* Filter working */
#define CAN0_FW_FW5						5u
	/* Filter working */
#define CAN0_FW_FW6						6u
	/* Filter working */
#define CAN0_FW_FW7						7u
	/* Filter working */
#define CAN0_FW_FW8						8u
	/* Filter working */
#define CAN0_FW_FW9						9u
	/* Filter working */
#define CAN0_FW_FW10						10u
	/* Filter working */
#define CAN0_FW_FW11						11u
	/* Filter working */
#define CAN0_FW_FW12						12u
	/* Filter working */
#define CAN0_FW_FW13						13u
	/* Filter working */
#define CAN0_FW_FW14						14u
	/* Filter working */
#define CAN0_FW_FW15						15u
	/* Filter working */
#define CAN0_FW_FW16						16u
	/* Filter working */
#define CAN0_FW_FW17						17u
	/* Filter working */
#define CAN0_FW_FW18						18u
	/* Filter working */
#define CAN0_FW_FW19						19u
	/* Filter working */
#define CAN0_FW_FW20						20u
	/* Filter working */
#define CAN0_FW_FW21						21u
	/* Filter working */
#define CAN0_FW_FW22						22u
	/* Filter working */
#define CAN0_FW_FW23						23u
	/* Filter working */
#define CAN0_FW_FW24						24u
	/* Filter working */
#define CAN0_FW_FW25						25u
	/* Filter working */
#define CAN0_FW_FW26						26u
	/* Filter working */
#define CAN0_FW_FW27						27u

	/* 0x21C */
	uint8_t RESERVED32[0x240-0x21C];

	/* 0x240: Filter 0 data 0 register */
	uint32_t volatile F0DATA0;
	/* Filter bits */
#define CAN0_F0DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F0DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F0DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F0DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F0DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F0DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F0DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F0DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F0DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F0DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F0DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F0DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F0DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F0DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F0DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F0DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F0DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F0DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F0DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F0DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F0DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F0DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F0DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F0DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F0DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F0DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F0DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F0DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F0DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F0DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F0DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F0DATA0_FD31					31u

	/* 0x240 */
	uint8_t RESERVED33[0x244-0x240];

	/* 0x244: Filter 0 data 1 register */
	uint32_t volatile F0DATA1;
	/* Filter bits */
#define CAN0_F0DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F0DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F0DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F0DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F0DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F0DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F0DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F0DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F0DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F0DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F0DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F0DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F0DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F0DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F0DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F0DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F0DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F0DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F0DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F0DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F0DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F0DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F0DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F0DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F0DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F0DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F0DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F0DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F0DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F0DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F0DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F0DATA1_FD31					31u

	/* 0x244 */
	uint8_t RESERVED34[0x248-0x244];

	/* 0x248: Filter 1 data 0 register */
	uint32_t volatile F1DATA0;
	/* Filter bits */
#define CAN0_F1DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F1DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F1DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F1DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F1DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F1DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F1DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F1DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F1DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F1DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F1DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F1DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F1DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F1DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F1DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F1DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F1DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F1DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F1DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F1DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F1DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F1DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F1DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F1DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F1DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F1DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F1DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F1DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F1DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F1DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F1DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F1DATA0_FD31					31u

	/* 0x248 */
	uint8_t RESERVED35[0x24C-0x248];

	/* 0x24C: Filter 1 data 1 register */
	uint32_t volatile F1DATA1;
	/* Filter bits */
#define CAN0_F1DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F1DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F1DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F1DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F1DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F1DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F1DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F1DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F1DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F1DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F1DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F1DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F1DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F1DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F1DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F1DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F1DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F1DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F1DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F1DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F1DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F1DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F1DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F1DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F1DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F1DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F1DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F1DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F1DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F1DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F1DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F1DATA1_FD31					31u

