josuah/mcu-gd32vf103/registers.h
	/* 0x24C */
	uint8_t RESERVED36[0x250-0x24C];

	/* 0x250: Filter 2 data 0 register */
	uint32_t volatile F2DATA0;
	/* Filter bits */
#define CAN0_F2DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F2DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F2DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F2DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F2DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F2DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F2DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F2DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F2DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F2DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F2DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F2DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F2DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F2DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F2DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F2DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F2DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F2DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F2DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F2DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F2DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F2DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F2DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F2DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F2DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F2DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F2DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F2DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F2DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F2DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F2DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F2DATA0_FD31					31u

	/* 0x250 */
	uint8_t RESERVED37[0x254-0x250];

	/* 0x254: Filter 2 data 1 register */
	uint32_t volatile F2DATA1;
	/* Filter bits */
#define CAN0_F2DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F2DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F2DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F2DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F2DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F2DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F2DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F2DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F2DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F2DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F2DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F2DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F2DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F2DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F2DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F2DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F2DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F2DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F2DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F2DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F2DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F2DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F2DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F2DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F2DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F2DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F2DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F2DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F2DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F2DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F2DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F2DATA1_FD31					31u

	/* 0x254 */
	uint8_t RESERVED38[0x258-0x254];

	/* 0x258: Filter 3 data 0 register */
	uint32_t volatile F3DATA0;
	/* Filter bits */
#define CAN0_F3DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F3DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F3DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F3DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F3DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F3DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F3DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F3DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F3DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F3DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F3DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F3DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F3DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F3DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F3DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F3DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F3DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F3DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F3DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F3DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F3DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F3DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F3DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F3DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F3DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F3DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F3DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F3DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F3DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F3DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F3DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F3DATA0_FD31					31u

	/* 0x258 */
	uint8_t RESERVED39[0x25C-0x258];

	/* 0x25C: Filter 3 data 1 register */
	uint32_t volatile F3DATA1;
	/* Filter bits */
#define CAN0_F3DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F3DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F3DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F3DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F3DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F3DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F3DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F3DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F3DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F3DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F3DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F3DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F3DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F3DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F3DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F3DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F3DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F3DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F3DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F3DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F3DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F3DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F3DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F3DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F3DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F3DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F3DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F3DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F3DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F3DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F3DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F3DATA1_FD31					31u

