josuah/mcu-gd32vf103/registers.h
	/* 0x27C */
	uint8_t RESERVED48[0x280-0x27C];

	/* 0x280: Filter 8 data 0 register */
	uint32_t volatile F8DATA0;
	/* Filter bits */
#define CAN0_F8DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F8DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F8DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F8DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F8DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F8DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F8DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F8DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F8DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F8DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F8DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F8DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F8DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F8DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F8DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F8DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F8DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F8DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F8DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F8DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F8DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F8DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F8DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F8DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F8DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F8DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F8DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F8DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F8DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F8DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F8DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F8DATA0_FD31					31u

	/* 0x280 */
	uint8_t RESERVED49[0x284-0x280];

	/* 0x284: Filter 8 data 1 register */
	uint32_t volatile F8DATA1;
	/* Filter bits */
#define CAN0_F8DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F8DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F8DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F8DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F8DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F8DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F8DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F8DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F8DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F8DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F8DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F8DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F8DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F8DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F8DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F8DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F8DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F8DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F8DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F8DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F8DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F8DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F8DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F8DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F8DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F8DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F8DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F8DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F8DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F8DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F8DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F8DATA1_FD31					31u

	/* 0x284 */
	uint8_t RESERVED50[0x288-0x284];

	/* 0x288: Filter 9 data 0 register */
	uint32_t volatile F9DATA0;
	/* Filter bits */
#define CAN0_F9DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F9DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F9DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F9DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F9DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F9DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F9DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F9DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F9DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F9DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F9DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F9DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F9DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F9DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F9DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F9DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F9DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F9DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F9DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F9DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F9DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F9DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F9DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F9DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F9DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F9DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F9DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F9DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F9DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F9DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F9DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F9DATA0_FD31					31u

	/* 0x288 */
	uint8_t RESERVED51[0x28C-0x288];

	/* 0x28C: Filter 9 data 1 register */
	uint32_t volatile F9DATA1;
	/* Filter bits */
#define CAN0_F9DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F9DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F9DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F9DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F9DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F9DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F9DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F9DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F9DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F9DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F9DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F9DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F9DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F9DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F9DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F9DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F9DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F9DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F9DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F9DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F9DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F9DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F9DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F9DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F9DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F9DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F9DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F9DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F9DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F9DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F9DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F9DATA1_FD31					31u

	/* 0x28C */
	uint8_t RESERVED52[0x290-0x28C];

	/* 0x290: Filter 10 data 0 register */
	uint32_t volatile F10DATA0;
	/* Filter bits */
#define CAN0_F10DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F10DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F10DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F10DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F10DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F10DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F10DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F10DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F10DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F10DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F10DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F10DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F10DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F10DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F10DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F10DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F10DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F10DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F10DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F10DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F10DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F10DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F10DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F10DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F10DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F10DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F10DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F10DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F10DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F10DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F10DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F10DATA0_FD31					31u

	/* 0x290 */
	uint8_t RESERVED53[0x294-0x290];

	/* 0x294: Filter 10 data 1 register */
	uint32_t volatile F10DATA1;
	/* Filter bits */
#define CAN0_F10DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F10DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F10DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F10DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F10DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F10DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F10DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F10DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F10DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F10DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F10DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F10DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F10DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F10DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F10DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F10DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F10DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F10DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F10DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F10DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F10DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F10DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F10DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F10DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F10DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F10DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F10DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F10DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F10DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F10DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F10DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F10DATA1_FD31					31u

