josuah/mcu-gd32vf103/registers.h
	/* 0x294 */
	uint8_t RESERVED54[0x298-0x294];

	/* 0x298: Filter 11 data 0 register */
	uint32_t volatile F11DATA0;
	/* Filter bits */
#define CAN0_F11DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F11DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F11DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F11DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F11DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F11DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F11DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F11DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F11DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F11DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F11DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F11DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F11DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F11DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F11DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F11DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F11DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F11DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F11DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F11DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F11DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F11DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F11DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F11DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F11DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F11DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F11DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F11DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F11DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F11DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F11DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F11DATA0_FD31					31u

	/* 0x298 */
	uint8_t RESERVED55[0x29C-0x298];

	/* 0x29C: Filter 11 data 1 register */
	uint32_t volatile F11DATA1;
	/* Filter bits */
#define CAN0_F11DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F11DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F11DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F11DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F11DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F11DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F11DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F11DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F11DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F11DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F11DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F11DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F11DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F11DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F11DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F11DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F11DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F11DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F11DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F11DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F11DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F11DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F11DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F11DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F11DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F11DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F11DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F11DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F11DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F11DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F11DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F11DATA1_FD31					31u

	/* 0x29C */
	uint8_t RESERVED56[0x2A0-0x29C];

	/* 0x2A0: Filter 12 data 0 register */
	uint32_t volatile F12DATA0;
	/* Filter bits */
#define CAN0_F12DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F12DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F12DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F12DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F12DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F12DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F12DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F12DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F12DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F12DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F12DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F12DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F12DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F12DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F12DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F12DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F12DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F12DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F12DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F12DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F12DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F12DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F12DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F12DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F12DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F12DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F12DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F12DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F12DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F12DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F12DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F12DATA0_FD31					31u

	/* 0x2A0 */
	uint8_t RESERVED57[0x2A4-0x2A0];

	/* 0x2A4: Filter 12 data 1 register */
	uint32_t volatile F12DATA1;
	/* Filter bits */
#define CAN0_F12DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F12DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F12DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F12DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F12DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F12DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F12DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F12DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F12DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F12DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F12DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F12DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F12DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F12DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F12DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F12DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F12DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F12DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F12DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F12DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F12DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F12DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F12DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F12DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F12DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F12DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F12DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F12DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F12DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F12DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F12DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F12DATA1_FD31					31u

	/* 0x2A4 */
	uint8_t RESERVED58[0x2A8-0x2A4];

	/* 0x2A8: Filter 13 data 0 register */
	uint32_t volatile F13DATA0;
	/* Filter bits */
#define CAN0_F13DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F13DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F13DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F13DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F13DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F13DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F13DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F13DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F13DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F13DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F13DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F13DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F13DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F13DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F13DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F13DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F13DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F13DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F13DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F13DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F13DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F13DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F13DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F13DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F13DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F13DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F13DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F13DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F13DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F13DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F13DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F13DATA0_FD31					31u

	/* 0x2A8 */
	uint8_t RESERVED59[0x2AC-0x2A8];

	/* 0x2AC: Filter 13 data 1 register */
	uint32_t volatile F13DATA1;
	/* Filter bits */
#define CAN0_F13DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F13DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F13DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F13DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F13DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F13DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F13DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F13DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F13DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F13DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F13DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F13DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F13DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F13DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F13DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F13DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F13DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F13DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F13DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F13DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F13DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F13DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F13DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F13DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F13DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F13DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F13DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F13DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F13DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F13DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F13DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F13DATA1_FD31					31u

	/* 0x2AC */
	uint8_t RESERVED60[0x2B0-0x2AC];

	/* 0x2B0: Filter 14 data 0 register */
	uint32_t volatile F14DATA0;
	/* Filter bits */
#define CAN0_F14DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F14DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F14DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F14DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F14DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F14DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F14DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F14DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F14DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F14DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F14DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F14DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F14DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F14DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F14DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F14DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F14DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F14DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F14DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F14DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F14DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F14DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F14DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F14DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F14DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F14DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F14DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F14DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F14DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F14DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F14DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F14DATA0_FD31					31u

	/* 0x2B0 */
	uint8_t RESERVED61[0x2B4-0x2B0];

	/* 0x2B4: Filter 14 data 1 register */
	uint32_t volatile F14DATA1;
	/* Filter bits */
#define CAN0_F14DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F14DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F14DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F14DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F14DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F14DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F14DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F14DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F14DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F14DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F14DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F14DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F14DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F14DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F14DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F14DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F14DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F14DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F14DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F14DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F14DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F14DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F14DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F14DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F14DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F14DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F14DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F14DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F14DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F14DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F14DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F14DATA1_FD31					31u

	/* 0x2B4 */
	uint8_t RESERVED62[0x2B8-0x2B4];

