josuah/mcu-gd32vf103/registers.h
	/* 0x2B8: Filter 15 data 0 register */
	uint32_t volatile F15DATA0;
	/* Filter bits */
#define CAN0_F15DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F15DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F15DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F15DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F15DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F15DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F15DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F15DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F15DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F15DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F15DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F15DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F15DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F15DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F15DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F15DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F15DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F15DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F15DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F15DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F15DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F15DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F15DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F15DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F15DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F15DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F15DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F15DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F15DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F15DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F15DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F15DATA0_FD31					31u

	/* 0x2B8 */
	uint8_t RESERVED63[0x2BC-0x2B8];

	/* 0x2BC: Filter 15 data 1 register */
	uint32_t volatile F15DATA1;
	/* Filter bits */
#define CAN0_F15DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F15DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F15DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F15DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F15DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F15DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F15DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F15DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F15DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F15DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F15DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F15DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F15DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F15DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F15DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F15DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F15DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F15DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F15DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F15DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F15DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F15DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F15DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F15DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F15DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F15DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F15DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F15DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F15DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F15DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F15DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F15DATA1_FD31					31u

	/* 0x2BC */
	uint8_t RESERVED64[0x2C0-0x2BC];

	/* 0x2C0: Filter 16 data 0 register */
	uint32_t volatile F16DATA0;
	/* Filter bits */
#define CAN0_F16DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F16DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F16DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F16DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F16DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F16DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F16DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F16DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F16DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F16DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F16DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F16DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F16DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F16DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F16DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F16DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F16DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F16DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F16DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F16DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F16DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F16DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F16DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F16DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F16DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F16DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F16DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F16DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F16DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F16DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F16DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F16DATA0_FD31					31u

	/* 0x2C0 */
	uint8_t RESERVED65[0x2C4-0x2C0];

	/* 0x2C4: Filter 16 data 1 register */
	uint32_t volatile F16DATA1;
	/* Filter bits */
#define CAN0_F16DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F16DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F16DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F16DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F16DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F16DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F16DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F16DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F16DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F16DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F16DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F16DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F16DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F16DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F16DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F16DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F16DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F16DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F16DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F16DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F16DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F16DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F16DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F16DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F16DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F16DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F16DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F16DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F16DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F16DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F16DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F16DATA1_FD31					31u

	/* 0x2C4 */
	uint8_t RESERVED66[0x2C8-0x2C4];

	/* 0x2C8: Filter 17 data 0 register */
	uint32_t volatile F17DATA0;
	/* Filter bits */
#define CAN0_F17DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F17DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F17DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F17DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F17DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F17DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F17DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F17DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F17DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F17DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F17DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F17DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F17DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F17DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F17DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F17DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F17DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F17DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F17DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F17DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F17DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F17DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F17DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F17DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F17DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F17DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F17DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F17DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F17DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F17DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F17DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F17DATA0_FD31					31u

	/* 0x2C8 */
	uint8_t RESERVED67[0x2CC-0x2C8];

	/* 0x2CC: Filter 17 data 1 register */
	uint32_t volatile F17DATA1;
	/* Filter bits */
#define CAN0_F17DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F17DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F17DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F17DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F17DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F17DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F17DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F17DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F17DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F17DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F17DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F17DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F17DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F17DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F17DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F17DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F17DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F17DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F17DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F17DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F17DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F17DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F17DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F17DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F17DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F17DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F17DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F17DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F17DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F17DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F17DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F17DATA1_FD31					31u

	/* 0x2CC */
	uint8_t RESERVED68[0x2D0-0x2CC];

	/* 0x2D0: Filter 18 data 0 register */
	uint32_t volatile F18DATA0;
	/* Filter bits */
#define CAN0_F18DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F18DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F18DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F18DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F18DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F18DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F18DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F18DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F18DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F18DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F18DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F18DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F18DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F18DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F18DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F18DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F18DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F18DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F18DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F18DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F18DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F18DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F18DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F18DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F18DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F18DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F18DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F18DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F18DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F18DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F18DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F18DATA0_FD31					31u

	/* 0x2D0 */
	uint8_t RESERVED69[0x2D4-0x2D0];

	/* 0x2D4: Filter 18 data 1 register */
	uint32_t volatile F18DATA1;
	/* Filter bits */
#define CAN0_F18DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F18DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F18DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F18DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F18DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F18DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F18DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F18DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F18DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F18DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F18DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F18DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F18DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F18DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F18DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F18DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F18DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F18DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F18DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F18DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F18DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F18DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F18DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F18DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F18DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F18DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F18DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F18DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F18DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F18DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F18DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F18DATA1_FD31					31u

	/* 0x2D4 */
	uint8_t RESERVED70[0x2D8-0x2D4];

