josuah/mcu-gd32vf103/registers.h
	/* 0x2D8: Filter 19 data 0 register */
	uint32_t volatile F19DATA0;
	/* Filter bits */
#define CAN0_F19DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F19DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F19DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F19DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F19DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F19DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F19DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F19DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F19DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F19DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F19DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F19DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F19DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F19DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F19DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F19DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F19DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F19DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F19DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F19DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F19DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F19DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F19DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F19DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F19DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F19DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F19DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F19DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F19DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F19DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F19DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F19DATA0_FD31					31u

	/* 0x2D8 */
	uint8_t RESERVED71[0x2DC-0x2D8];

	/* 0x2DC: Filter 19 data 1 register */
	uint32_t volatile F19DATA1;
	/* Filter bits */
#define CAN0_F19DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F19DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F19DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F19DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F19DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F19DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F19DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F19DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F19DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F19DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F19DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F19DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F19DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F19DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F19DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F19DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F19DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F19DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F19DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F19DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F19DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F19DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F19DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F19DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F19DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F19DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F19DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F19DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F19DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F19DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F19DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F19DATA1_FD31					31u

	/* 0x2DC */
	uint8_t RESERVED72[0x2E0-0x2DC];

	/* 0x2E0: Filter 20 data 0 register */
	uint32_t volatile F20DATA0;
	/* Filter bits */
#define CAN0_F20DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F20DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F20DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F20DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F20DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F20DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F20DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F20DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F20DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F20DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F20DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F20DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F20DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F20DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F20DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F20DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F20DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F20DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F20DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F20DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F20DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F20DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F20DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F20DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F20DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F20DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F20DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F20DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F20DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F20DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F20DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F20DATA0_FD31					31u

	/* 0x2E0 */
	uint8_t RESERVED73[0x2E4-0x2E0];

	/* 0x2E4: Filter 20 data 1 register */
	uint32_t volatile F20DATA1;
	/* Filter bits */
#define CAN0_F20DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F20DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F20DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F20DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F20DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F20DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F20DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F20DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F20DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F20DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F20DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F20DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F20DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F20DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F20DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F20DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F20DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F20DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F20DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F20DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F20DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F20DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F20DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F20DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F20DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F20DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F20DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F20DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F20DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F20DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F20DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F20DATA1_FD31					31u

	/* 0x2E4 */
	uint8_t RESERVED74[0x2E8-0x2E4];

	/* 0x2E8: Filter 21 data 0 register */
	uint32_t volatile F21DATA0;
	/* Filter bits */
#define CAN0_F21DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F21DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F21DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F21DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F21DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F21DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F21DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F21DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F21DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F21DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F21DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F21DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F21DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F21DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F21DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F21DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F21DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F21DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F21DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F21DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F21DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F21DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F21DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F21DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F21DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F21DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F21DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F21DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F21DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F21DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F21DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F21DATA0_FD31					31u

	/* 0x2E8 */
	uint8_t RESERVED75[0x2EC-0x2E8];

	/* 0x2EC: Filter 21 data 1 register */
	uint32_t volatile F21DATA1;
	/* Filter bits */
#define CAN0_F21DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F21DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F21DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F21DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F21DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F21DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F21DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F21DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F21DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F21DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F21DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F21DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F21DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F21DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F21DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F21DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F21DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F21DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F21DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F21DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F21DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F21DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F21DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F21DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F21DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F21DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F21DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F21DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F21DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F21DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F21DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F21DATA1_FD31					31u

	/* 0x2EC */
	uint8_t RESERVED76[0x2F0-0x2EC];

	/* 0x2F0: Filter 22 data 0 register */
	uint32_t volatile F22DATA0;
	/* Filter bits */
#define CAN0_F22DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F22DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F22DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F22DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F22DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F22DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F22DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F22DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F22DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F22DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F22DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F22DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F22DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F22DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F22DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F22DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F22DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F22DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F22DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F22DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F22DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F22DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F22DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F22DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F22DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F22DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F22DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F22DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F22DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F22DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F22DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F22DATA0_FD31					31u

	/* 0x2F0 */
	uint8_t RESERVED77[0x2F4-0x2F0];

	/* 0x2F4: Filter 22 data 1 register */
	uint32_t volatile F22DATA1;
	/* Filter bits */
#define CAN0_F22DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F22DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F22DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F22DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F22DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F22DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F22DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F22DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F22DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F22DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F22DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F22DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F22DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F22DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F22DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F22DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F22DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F22DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F22DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F22DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F22DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F22DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F22DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F22DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F22DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F22DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F22DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F22DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F22DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F22DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F22DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F22DATA1_FD31					31u

	/* 0x2F4 */
	uint8_t RESERVED78[0x2F8-0x2F4];

