josuah/mcu-gd32vf103/registers.h
	/* 0x314 */
	uint8_t RESERVED86[0x318-0x314];

	/* 0x318: Filter 27 data 0 register */
	uint32_t volatile F27DATA0;
	/* Filter bits */
#define CAN0_F27DATA0_FD0					0u
	/* Filter bits */
#define CAN0_F27DATA0_FD1					1u
	/* Filter bits */
#define CAN0_F27DATA0_FD2					2u
	/* Filter bits */
#define CAN0_F27DATA0_FD3					3u
	/* Filter bits */
#define CAN0_F27DATA0_FD4					4u
	/* Filter bits */
#define CAN0_F27DATA0_FD5					5u
	/* Filter bits */
#define CAN0_F27DATA0_FD6					6u
	/* Filter bits */
#define CAN0_F27DATA0_FD7					7u
	/* Filter bits */
#define CAN0_F27DATA0_FD8					8u
	/* Filter bits */
#define CAN0_F27DATA0_FD9					9u
	/* Filter bits */
#define CAN0_F27DATA0_FD10					10u
	/* Filter bits */
#define CAN0_F27DATA0_FD11					11u
	/* Filter bits */
#define CAN0_F27DATA0_FD12					12u
	/* Filter bits */
#define CAN0_F27DATA0_FD13					13u
	/* Filter bits */
#define CAN0_F27DATA0_FD14					14u
	/* Filter bits */
#define CAN0_F27DATA0_FD15					15u
	/* Filter bits */
#define CAN0_F27DATA0_FD16					16u
	/* Filter bits */
#define CAN0_F27DATA0_FD17					17u
	/* Filter bits */
#define CAN0_F27DATA0_FD18					18u
	/* Filter bits */
#define CAN0_F27DATA0_FD19					19u
	/* Filter bits */
#define CAN0_F27DATA0_FD20					20u
	/* Filter bits */
#define CAN0_F27DATA0_FD21					21u
	/* Filter bits */
#define CAN0_F27DATA0_FD22					22u
	/* Filter bits */
#define CAN0_F27DATA0_FD23					23u
	/* Filter bits */
#define CAN0_F27DATA0_FD24					24u
	/* Filter bits */
#define CAN0_F27DATA0_FD25					25u
	/* Filter bits */
#define CAN0_F27DATA0_FD26					26u
	/* Filter bits */
#define CAN0_F27DATA0_FD27					27u
	/* Filter bits */
#define CAN0_F27DATA0_FD28					28u
	/* Filter bits */
#define CAN0_F27DATA0_FD29					29u
	/* Filter bits */
#define CAN0_F27DATA0_FD30					30u
	/* Filter bits */
#define CAN0_F27DATA0_FD31					31u

	/* 0x318 */
	uint8_t RESERVED87[0x31C-0x318];

	/* 0x31C: Filter 27 data 1 register */
	uint32_t volatile F27DATA1;
	/* Filter bits */
#define CAN0_F27DATA1_FD0					0u
	/* Filter bits */
#define CAN0_F27DATA1_FD1					1u
	/* Filter bits */
#define CAN0_F27DATA1_FD2					2u
	/* Filter bits */
#define CAN0_F27DATA1_FD3					3u
	/* Filter bits */
#define CAN0_F27DATA1_FD4					4u
	/* Filter bits */
#define CAN0_F27DATA1_FD5					5u
	/* Filter bits */
#define CAN0_F27DATA1_FD6					6u
	/* Filter bits */
#define CAN0_F27DATA1_FD7					7u
	/* Filter bits */
#define CAN0_F27DATA1_FD8					8u
	/* Filter bits */
#define CAN0_F27DATA1_FD9					9u
	/* Filter bits */
#define CAN0_F27DATA1_FD10					10u
	/* Filter bits */
#define CAN0_F27DATA1_FD11					11u
	/* Filter bits */
#define CAN0_F27DATA1_FD12					12u
	/* Filter bits */
#define CAN0_F27DATA1_FD13					13u
	/* Filter bits */
#define CAN0_F27DATA1_FD14					14u
	/* Filter bits */
#define CAN0_F27DATA1_FD15					15u
	/* Filter bits */
#define CAN0_F27DATA1_FD16					16u
	/* Filter bits */
#define CAN0_F27DATA1_FD17					17u
	/* Filter bits */
#define CAN0_F27DATA1_FD18					18u
	/* Filter bits */
#define CAN0_F27DATA1_FD19					19u
	/* Filter bits */
#define CAN0_F27DATA1_FD20					20u
	/* Filter bits */
#define CAN0_F27DATA1_FD21					21u
	/* Filter bits */
#define CAN0_F27DATA1_FD22					22u
	/* Filter bits */
#define CAN0_F27DATA1_FD23					23u
	/* Filter bits */
#define CAN0_F27DATA1_FD24					24u
	/* Filter bits */
#define CAN0_F27DATA1_FD25					25u
	/* Filter bits */
#define CAN0_F27DATA1_FD26					26u
	/* Filter bits */
#define CAN0_F27DATA1_FD27					27u
	/* Filter bits */
#define CAN0_F27DATA1_FD28					28u
	/* Filter bits */
#define CAN0_F27DATA1_FD29					29u
	/* Filter bits */
#define CAN0_F27DATA1_FD30					30u
	/* Filter bits */
#define CAN0_F27DATA1_FD31					31u

};


#define CRC ((struct sdk_crc *)0x40023000)

struct sdk_crc {

	/* 0x00: Data register */
	uint32_t volatile DATA;
	/* CRC calculation result bits */
#define CRC_DATA_DATA_msb					0u
#define CRC_DATA_DATA_lsb					31u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: Free data register */
	uint32_t volatile FDATA;
	/* Free Data Register bits */
#define CRC_FDATA_FDATA_msb					0u
#define CRC_FDATA_FDATA_lsb					7u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: Control register */
	uint32_t volatile CTL;
	/* reset bit */
#define CRC_CTL_RST						0u

};


#define DAC ((struct sdk_dac *)0x40007400)

struct sdk_dac {

	/* 0x00: control register */
	uint32_t volatile CTL;
	/* DAC0 enable */
#define DAC_CTL_DEN0						0u
	/* DAC0 output buffer turn off */
#define DAC_CTL_DBOFF0						1u
	/* DAC0 trigger enable */
#define DAC_CTL_DTEN0						2u
	/* DAC0 trigger selection */
#define DAC_CTL_DTSEL0_msb					3u
#define DAC_CTL_DTSEL0_lsb					5u
	/* DAC0 noise wave mode */
#define DAC_CTL_DWM0_msb					6u
#define DAC_CTL_DWM0_lsb					7u
	/* DAC0 noise wave bit width */
#define DAC_CTL_DWBW0_msb					8u
#define DAC_CTL_DWBW0_lsb					11u
	/* DAC0 DMA enable */
#define DAC_CTL_DDMAEN0						12u
	/* DAC1 enable */
#define DAC_CTL_DEN1						16u
	/* DAC1 output buffer turn off */
#define DAC_CTL_DBOFF1						17u
	/* DAC1 trigger enable */
#define DAC_CTL_DTEN1						18u
	/* DAC1 trigger selection */
#define DAC_CTL_DTSEL1_msb					19u
#define DAC_CTL_DTSEL1_lsb					21u
	/* DAC1 noise wave mode */
#define DAC_CTL_DWM1_msb					22u
#define DAC_CTL_DWM1_lsb					23u
	/* DAC1 noise wave bit width */
#define DAC_CTL_DWBW1_msb					24u
#define DAC_CTL_DWBW1_lsb					27u
	/* DAC1 DMA enable */
#define DAC_CTL_DDMAEN1						28u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: software trigger register */
	uint32_t volatile SWT;
	/* DAC0 software trigger */
#define DAC_SWT_SWTR0						0u
	/* DAC1 software trigger */
#define DAC_SWT_SWTR1						1u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: DAC0 12-bit right-aligned data holding register */
	uint32_t volatile DAC0_R12DH;
	/* DAC0 12-bit right-aligned */
#define DAC_DAC0_R12DH_DAC0_DH_msb				0u
#define DAC_DAC0_R12DH_DAC0_DH_lsb				11u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C: DAC0 12-bit left-aligned data holding register */
	uint32_t volatile DAC0_L12DH;
	/* DAC0 12-bit left-aligned */
#define DAC_DAC0_L12DH_DAC0_DH_msb				4u
#define DAC_DAC0_L12DH_DAC0_DH_lsb				15u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

