josuah/mcu-gd32vf103/registers.h
	/* 0x10: DAC0 8-bit right aligned data holding */
	uint32_t volatile DAC0_R8DH;
	/* DAC0 8-bit right-aligned */
#define DAC_DAC0_R8DH_DAC0_DH_msb				0u
#define DAC_DAC0_R8DH_DAC0_DH_lsb				7u

	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: DAC1 12-bit right-aligned data holding */
	uint32_t volatile DAC1_R12DH;
	/* DAC1 12-bit right-aligned */
#define DAC_DAC1_R12DH_DAC1_DH_msb				0u
#define DAC_DAC1_R12DH_DAC1_DH_lsb				11u

	/* 0x14 */
	uint8_t RESERVED5[0x18-0x14];

	/* 0x18: DAC1 12-bit left aligned data holding */
	uint32_t volatile DAC1_L12DH;
	/* DAC1 12-bit left-aligned */
#define DAC_DAC1_L12DH_DAC1_DH_msb				4u
#define DAC_DAC1_L12DH_DAC1_DH_lsb				15u

	/* 0x18 */
	uint8_t RESERVED6[0x1C-0x18];

	/* 0x1C: DAC1 8-bit right aligned data holding */
	uint32_t volatile DAC1_R8DH;
	/* DAC1 8-bit right-aligned */
#define DAC_DAC1_R8DH_DAC1_DH_msb				0u
#define DAC_DAC1_R8DH_DAC1_DH_lsb				7u

	/* 0x1C */
	uint8_t RESERVED7[0x20-0x1C];

	/* 0x20: DAC concurrent mode 12-bit right-aligned data holding */
	uint32_t volatile DACC_R12DH;
	/* DAC0 12-bit right-aligned */
#define DAC_DACC_R12DH_DAC0_DH_msb				0u
#define DAC_DACC_R12DH_DAC0_DH_lsb				11u
	/* DAC1 12-bit right-aligned */
#define DAC_DACC_R12DH_DAC1_DH_msb				16u
#define DAC_DACC_R12DH_DAC1_DH_lsb				27u

	/* 0x20 */
	uint8_t RESERVED8[0x24-0x20];

	/* 0x24: DAC concurrent mode 12-bit left aligned data holding */
	uint32_t volatile DACC_L12DH;
	/* DAC0 12-bit left-aligned */
#define DAC_DACC_L12DH_DAC0_DH_msb				4u
#define DAC_DACC_L12DH_DAC0_DH_lsb				15u
	/* DAC1 12-bit left-aligned */
#define DAC_DACC_L12DH_DAC1_DH_msb				20u
#define DAC_DACC_L12DH_DAC1_DH_lsb				31u

	/* 0x24 */
	uint8_t RESERVED9[0x28-0x24];

	/* 0x28: DAC concurrent mode 8-bit right aligned data holding */
	uint32_t volatile DACC_R8DH;
	/* DAC0 8-bit right-aligned */
#define DAC_DACC_R8DH_DAC0_DH_msb				0u
#define DAC_DACC_R8DH_DAC0_DH_lsb				7u
	/* DAC1 8-bit right-aligned */
#define DAC_DACC_R8DH_DAC1_DH_msb				8u
#define DAC_DACC_R8DH_DAC1_DH_lsb				15u

	/* 0x28 */
	uint8_t RESERVED10[0x2C-0x28];

	/* 0x2C: DAC0 data output register */
	uint32_t volatile DAC0_DO;
	/* DAC0 data output */
#define DAC_DAC0_DO_DAC0_DO_msb					0u
#define DAC_DAC0_DO_DAC0_DO_lsb					11u

	/* 0x2C */
	uint8_t RESERVED11[0x30-0x2C];

	/* 0x30: DAC1 data output register */
	uint32_t volatile DAC1_DO;
	/* DAC1 data output */
#define DAC_DAC1_DO_DAC1_DO_msb					0u
#define DAC_DAC1_DO_DAC1_DO_lsb					11u

};


#define DBG ((struct sdk_dbg *)0xE0042000)

struct sdk_dbg {

	/* 0x00: ID code register */
	uint32_t volatile ID;
	/* DBG ID code register */
#define DBG_ID_ID_CODE_msb					0u
#define DBG_ID_ID_CODE_lsb					31u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: Control register 0 */
	uint32_t volatile CTL;
	/* Sleep mode hold register */
#define DBG_CTL_SLP_HOLD					0u
	/* Deep-sleep mode hold register */
#define DBG_CTL_DSLP_HOLD					1u
	/* Standby mode hold register */
#define DBG_CTL_STB_HOLD					2u
	/* FWDGT hold bit */
#define DBG_CTL_FWDGT_HOLD					8u
	/* WWDGT hold bit */
#define DBG_CTL_WWDGT_HOLD					9u
	/* TIMER 0 hold bit */
#define DBG_CTL_TIMER0_HOLD					10u
	/* TIMER 1 hold bit */
#define DBG_CTL_TIMER1_HOLD					11u
	/* TIMER 2 hold bit */
#define DBG_CTL_TIMER2_HOLD					12u
	/* TIMER 23 hold bit */
#define DBG_CTL_TIMER3_HOLD					13u
	/* CAN0 hold bit */
#define DBG_CTL_CAN0_HOLD					14u
	/* I2C0 hold bit */
#define DBG_CTL_I2C0_HOLD					15u
	/* I2C1 hold bit */
#define DBG_CTL_I2C1_HOLD					16u
	/* TIMER4_HOLD */
#define DBG_CTL_TIMER4_HOLD					18u
	/* TIMER 5 hold bit */
#define DBG_CTL_TIMER5_HOLD					19u
	/* TIMER 6 hold bit */
#define DBG_CTL_TIMER6_HOLD					20u
	/* CAN1 hold bit */
#define DBG_CTL_CAN1_HOLD					21u

};


#define DMA0 ((struct sdk_dma0 *)0x40020000)

struct sdk_dma0 {

	/* 0x00: Interrupt flag register */
	uint32_t volatile INTF;
	/* Global interrupt flag of channel 0 */
#define DMA0_INTF_GIF0						0u
	/* Full Transfer finish flag of channe 0 */
#define DMA0_INTF_FTFIF0					1u
	/* Half transfer finish flag of channel 0 */
#define DMA0_INTF_HTFIF0					2u
	/* Error flag of channel 0 */
#define DMA0_INTF_ERRIF0					3u
	/* Global interrupt flag of channel 1 */
#define DMA0_INTF_GIF1						4u
	/* Full Transfer finish flag of channe 1 */
#define DMA0_INTF_FTFIF1					5u
	/* Half transfer finish flag of channel 1 */
#define DMA0_INTF_HTFIF1					6u
	/* Error flag of channel 1 */
#define DMA0_INTF_ERRIF1					7u
	/* Global interrupt flag of channel 2 */
#define DMA0_INTF_GIF2						8u
	/* Full Transfer finish flag of channe 2 */
#define DMA0_INTF_FTFIF2					9u
	/* Half transfer finish flag of channel 2 */
#define DMA0_INTF_HTFIF2					10u
	/* Error flag of channel 2 */
#define DMA0_INTF_ERRIF2					11u
	/* Global interrupt flag of channel 3 */
#define DMA0_INTF_GIF3						12u
	/* Full Transfer finish flag of channe 3 */
#define DMA0_INTF_FTFIF3					13u
	/* Half transfer finish flag of channel 3 */
#define DMA0_INTF_HTFIF3					14u
	/* Error flag of channel 3 */
#define DMA0_INTF_ERRIF3					15u
	/* Global interrupt flag of channel 4 */
#define DMA0_INTF_GIF4						16u
	/* Full Transfer finish flag of channe 4 */
#define DMA0_INTF_FTFIF4					17u
	/* Half transfer finish flag of channel 4 */
#define DMA0_INTF_HTFIF4					18u
	/* Error flag of channel 4 */
#define DMA0_INTF_ERRIF4					19u
	/* Global interrupt flag of channel 5 */
#define DMA0_INTF_GIF5						20u
	/* Full Transfer finish flag of channe 5 */
#define DMA0_INTF_FTFIF5					21u
	/* Half transfer finish flag of channel 5 */
#define DMA0_INTF_HTFIF5					22u
	/* Error flag of channel 5 */
#define DMA0_INTF_ERRIF5					23u
	/* Global interrupt flag of channel 6 */
#define DMA0_INTF_GIF6						24u
	/* Full Transfer finish flag of channe 6 */
#define DMA0_INTF_FTFIF6					25u
	/* Half transfer finish flag of channel 6 */
#define DMA0_INTF_HTFIF6					26u
	/* Error flag of channel 6 */
#define DMA0_INTF_ERRIF6					27u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: Interrupt flag clear register */
	uint32_t volatile INTC;
	/* Clear global interrupt flag of channel 0 */
#define DMA0_INTC_GIFC0						0u
	/* Clear bit for full transfer finish flag of channel 0 */
#define DMA0_INTC_FTFIFC0					1u
	/* Clear bit for half transfer finish flag of channel 0 */
#define DMA0_INTC_HTFIFC0					2u
	/* Clear bit for error flag of channel 0 */
#define DMA0_INTC_ERRIFC0					3u
	/* Clear global interrupt flag of channel 1 */
#define DMA0_INTC_GIFC1						4u
	/* Clear bit for full transfer finish flag of channel 1 */
#define DMA0_INTC_FTFIFC1					5u
	/* Clear bit for half transfer finish flag of channel 1 */
#define DMA0_INTC_HTFIFC1					6u
	/* Clear bit for error flag of channel 1 */
#define DMA0_INTC_ERRIFC1					7u
	/* Clear global interrupt flag of channel 2 */
#define DMA0_INTC_GIFC2						8u
	/* Clear bit for full transfer finish flag of channel 2 */
#define DMA0_INTC_FTFIFC2					9u
	/* Clear bit for half transfer finish flag of channel 2 */
#define DMA0_INTC_HTFIFC2					10u
	/* Clear bit for error flag of channel 2 */
#define DMA0_INTC_ERRIFC2					11u
	/* Clear global interrupt flag of channel 3 */
#define DMA0_INTC_GIFC3						12u
	/* Clear bit for full transfer finish flag of channel 3 */
#define DMA0_INTC_FTFIFC3					13u
	/* Clear bit for half transfer finish flag of channel 3 */
#define DMA0_INTC_HTFIFC3					14u
	/* Clear bit for error flag of channel 3 */
#define DMA0_INTC_ERRIFC3					15u
	/* Clear global interrupt flag of channel 4 */
#define DMA0_INTC_GIFC4						16u
	/* Clear bit for full transfer finish flag of channel 4 */
#define DMA0_INTC_FTFIFC4					17u
	/* Clear bit for half transfer finish flag of channel 4 */
#define DMA0_INTC_HTFIFC4					18u
	/* Clear bit for error flag of channel 4 */
#define DMA0_INTC_ERRIFC4					19u
	/* Clear global interrupt flag of channel 5 */
#define DMA0_INTC_GIFC5						20u
	/* Clear bit for full transfer finish flag of channel 5 */
#define DMA0_INTC_FTFIFC5					21u
	/* Clear bit for half transfer finish flag of channel 5 */
#define DMA0_INTC_HTFIFC5					22u
	/* Clear bit for error flag of channel 5 */
#define DMA0_INTC_ERRIFC5					23u
	/* Clear global interrupt flag of channel 6 */
#define DMA0_INTC_GIFC6						24u
	/* Clear bit for full transfer finish flag of channel 6 */
#define DMA0_INTC_FTFIFC6					25u
	/* Clear bit for half transfer finish flag of channel 6 */
#define DMA0_INTC_HTFIFC6					26u
	/* Clear bit for error flag of channel 6 */
#define DMA0_INTC_ERRIFC6					27u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: Channel 0 control register */
	uint32_t volatile CH0CTL;
	/* Channel enable */
#define DMA0_CH0CTL_CHEN					0u
	/* Enable bit for channel full transfer finish interrupt */
#define DMA0_CH0CTL_FTFIE					1u
	/* Enable bit for channel half transfer finish interrupt */
#define DMA0_CH0CTL_HTFIE					2u
	/* Enable bit for channel error interrupt */
#define DMA0_CH0CTL_ERRIE					3u
	/* Transfer direction */
#define DMA0_CH0CTL_DIR						4u
	/* Circular mode enable */
#define DMA0_CH0CTL_CMEN					5u
	/* Next address generation algorithm of peripheral */
#define DMA0_CH0CTL_PNAGA					6u
	/* Next address generation algorithm of memory */
#define DMA0_CH0CTL_MNAGA					7u
	/* Transfer data size of peripheral */
#define DMA0_CH0CTL_PWIDTH_msb					8u
#define DMA0_CH0CTL_PWIDTH_lsb					9u
	/* Transfer data size of memory */
#define DMA0_CH0CTL_MWIDTH_msb					10u
#define DMA0_CH0CTL_MWIDTH_lsb					11u
	/* Priority level */
#define DMA0_CH0CTL_PRIO_msb					12u
#define DMA0_CH0CTL_PRIO_lsb					13u
	/* Memory to Memory Mode */
#define DMA0_CH0CTL_M2M						14u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C: Channel 0 counter register */
	uint32_t volatile CH0CNT;
	/* Transfer counter */
#define DMA0_CH0CNT_CNT_msb					0u
#define DMA0_CH0CNT_CNT_lsb					15u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

	/* 0x10: Channel 0 peripheral base address register */
	uint32_t volatile CH0PADDR;
	/* Peripheral base address */
#define DMA0_CH0PADDR_PADDR_msb					0u
#define DMA0_CH0PADDR_PADDR_lsb					31u

