josuah/mcu-gd32vf103/registers.h
	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: Channel 0 memory base address register */
	uint32_t volatile CH0MADDR;
	/* Memory base address */
#define DMA0_CH0MADDR_MADDR_msb					0u
#define DMA0_CH0MADDR_MADDR_lsb					31u

	/* 0x14 */
	uint8_t RESERVED5[0x1C-0x14];

	/* 0x1C: Channel 1 control register */
	uint32_t volatile CH1CTL;
	/* Channel enable */
#define DMA0_CH1CTL_CHEN					0u
	/* Enable bit for channel full transfer finish interrupt */
#define DMA0_CH1CTL_FTFIE					1u
	/* Enable bit for channel half transfer finish interrupt */
#define DMA0_CH1CTL_HTFIE					2u
	/* Enable bit for channel error interrupt */
#define DMA0_CH1CTL_ERRIE					3u
	/* Transfer direction */
#define DMA0_CH1CTL_DIR						4u
	/* Circular mode enable */
#define DMA0_CH1CTL_CMEN					5u
	/* Next address generation algorithm of peripheral */
#define DMA0_CH1CTL_PNAGA					6u
	/* Next address generation algorithm of memory */
#define DMA0_CH1CTL_MNAGA					7u
	/* Transfer data size of peripheral */
#define DMA0_CH1CTL_PWIDTH_msb					8u
#define DMA0_CH1CTL_PWIDTH_lsb					9u
	/* Transfer data size of memory */
#define DMA0_CH1CTL_MWIDTH_msb					10u
#define DMA0_CH1CTL_MWIDTH_lsb					11u
	/* Priority level */
#define DMA0_CH1CTL_PRIO_msb					12u
#define DMA0_CH1CTL_PRIO_lsb					13u
	/* Memory to Memory Mode */
#define DMA0_CH1CTL_M2M						14u

	/* 0x1C */
	uint8_t RESERVED6[0x20-0x1C];

	/* 0x20: Channel 1 counter register */
	uint32_t volatile CH1CNT;
	/* Transfer counter */
#define DMA0_CH1CNT_CNT_msb					0u
#define DMA0_CH1CNT_CNT_lsb					15u

	/* 0x20 */
	uint8_t RESERVED7[0x24-0x20];

	/* 0x24: Channel 1 peripheral base address register */
	uint32_t volatile CH1PADDR;
	/* Peripheral base address */
#define DMA0_CH1PADDR_PADDR_msb					0u
#define DMA0_CH1PADDR_PADDR_lsb					31u

	/* 0x24 */
	uint8_t RESERVED8[0x28-0x24];

	/* 0x28: Channel 1 memory base address register */
	uint32_t volatile CH1MADDR;
	/* Memory base address */
#define DMA0_CH1MADDR_MADDR_msb					0u
#define DMA0_CH1MADDR_MADDR_lsb					31u

	/* 0x28 */
	uint8_t RESERVED9[0x30-0x28];

	/* 0x30: Channel 2 control register */
	uint32_t volatile CH2CTL;
	/* Channel enable */
#define DMA0_CH2CTL_CHEN					0u
	/* Enable bit for channel full transfer finish interrupt */
#define DMA0_CH2CTL_FTFIE					1u
	/* Enable bit for channel half transfer finish interrupt */
#define DMA0_CH2CTL_HTFIE					2u
	/* Enable bit for channel error interrupt */
#define DMA0_CH2CTL_ERRIE					3u
	/* Transfer direction */
#define DMA0_CH2CTL_DIR						4u
	/* Circular mode enable */
#define DMA0_CH2CTL_CMEN					5u
	/* Next address generation algorithm of peripheral */
#define DMA0_CH2CTL_PNAGA					6u
	/* Next address generation algorithm of memory */
#define DMA0_CH2CTL_MNAGA					7u
	/* Transfer data size of peripheral */
#define DMA0_CH2CTL_PWIDTH_msb					8u
#define DMA0_CH2CTL_PWIDTH_lsb					9u
	/* Transfer data size of memory */
#define DMA0_CH2CTL_MWIDTH_msb					10u
#define DMA0_CH2CTL_MWIDTH_lsb					11u
	/* Priority level */
#define DMA0_CH2CTL_PRIO_msb					12u
#define DMA0_CH2CTL_PRIO_lsb					13u
	/* Memory to Memory Mode */
#define DMA0_CH2CTL_M2M						14u

	/* 0x30 */
	uint8_t RESERVED10[0x34-0x30];

	/* 0x34: Channel 2 counter register */
	uint32_t volatile CH2CNT;
	/* Transfer counter */
#define DMA0_CH2CNT_CNT_msb					0u
#define DMA0_CH2CNT_CNT_lsb					15u

	/* 0x34 */
	uint8_t RESERVED11[0x38-0x34];

	/* 0x38: Channel 2 peripheral base address register */
	uint32_t volatile CH2PADDR;
	/* Peripheral base address */
#define DMA0_CH2PADDR_PADDR_msb					0u
#define DMA0_CH2PADDR_PADDR_lsb					31u

	/* 0x38 */
	uint8_t RESERVED12[0x3C-0x38];

	/* 0x3C: Channel 2 memory base address register */
	uint32_t volatile CH2MADDR;
	/* Memory base address */
#define DMA0_CH2MADDR_MADDR_msb					0u
#define DMA0_CH2MADDR_MADDR_lsb					31u

	/* 0x3C */
	uint8_t RESERVED13[0x44-0x3C];

	/* 0x44: Channel 3 control register */
	uint32_t volatile CH3CTL;
	/* Channel enable */
#define DMA0_CH3CTL_CHEN					0u
	/* Enable bit for channel full transfer finish interrupt */
#define DMA0_CH3CTL_FTFIE					1u
	/* Enable bit for channel half transfer finish interrupt */
#define DMA0_CH3CTL_HTFIE					2u
	/* Enable bit for channel error interrupt */
#define DMA0_CH3CTL_ERRIE					3u
	/* Transfer direction */
#define DMA0_CH3CTL_DIR						4u
	/* Circular mode enable */
#define DMA0_CH3CTL_CMEN					5u
	/* Next address generation algorithm of peripheral */
#define DMA0_CH3CTL_PNAGA					6u
	/* Next address generation algorithm of memory */
#define DMA0_CH3CTL_MNAGA					7u
	/* Transfer data size of peripheral */
#define DMA0_CH3CTL_PWIDTH_msb					8u
#define DMA0_CH3CTL_PWIDTH_lsb					9u
	/* Transfer data size of memory */
#define DMA0_CH3CTL_MWIDTH_msb					10u
#define DMA0_CH3CTL_MWIDTH_lsb					11u
	/* Priority level */
#define DMA0_CH3CTL_PRIO_msb					12u
#define DMA0_CH3CTL_PRIO_lsb					13u
	/* Memory to Memory Mode */
#define DMA0_CH3CTL_M2M						14u

	/* 0x44 */
	uint8_t RESERVED14[0x48-0x44];

	/* 0x48: Channel 3 counter register */
	uint32_t volatile CH3CNT;
	/* Transfer counter */
#define DMA0_CH3CNT_CNT_msb					0u
#define DMA0_CH3CNT_CNT_lsb					15u

	/* 0x48 */
	uint8_t RESERVED15[0x4C-0x48];

	/* 0x4C: Channel 3 peripheral base address register */
	uint32_t volatile CH3PADDR;
	/* Peripheral base address */
#define DMA0_CH3PADDR_PADDR_msb					0u
#define DMA0_CH3PADDR_PADDR_lsb					31u

	/* 0x4C */
	uint8_t RESERVED16[0x50-0x4C];

	/* 0x50: Channel 3 memory base address register */
	uint32_t volatile CH3MADDR;
	/* Memory base address */
#define DMA0_CH3MADDR_MADDR_msb					0u
#define DMA0_CH3MADDR_MADDR_lsb					31u

	/* 0x50 */
	uint8_t RESERVED17[0x58-0x50];

	/* 0x58: Channel 4 control register */
	uint32_t volatile CH4CTL;
	/* Channel enable */
#define DMA0_CH4CTL_CHEN					0u
	/* Enable bit for channel full transfer finish interrupt */
#define DMA0_CH4CTL_FTFIE					1u
	/* Enable bit for channel half transfer finish interrupt */
#define DMA0_CH4CTL_HTFIE					2u
	/* Enable bit for channel error interrupt */
#define DMA0_CH4CTL_ERRIE					3u
	/* Transfer direction */
#define DMA0_CH4CTL_DIR						4u
	/* Circular mode enable */
#define DMA0_CH4CTL_CMEN					5u
	/* Next address generation algorithm of peripheral */
#define DMA0_CH4CTL_PNAGA					6u
	/* Next address generation algorithm of memory */
#define DMA0_CH4CTL_MNAGA					7u
	/* Transfer data size of peripheral */
#define DMA0_CH4CTL_PWIDTH_msb					8u
#define DMA0_CH4CTL_PWIDTH_lsb					9u
	/* Transfer data size of memory */
#define DMA0_CH4CTL_MWIDTH_msb					10u
#define DMA0_CH4CTL_MWIDTH_lsb					11u
	/* Priority level */
#define DMA0_CH4CTL_PRIO_msb					12u
#define DMA0_CH4CTL_PRIO_lsb					13u
	/* Memory to Memory Mode */
#define DMA0_CH4CTL_M2M						14u

	/* 0x58 */
	uint8_t RESERVED18[0x5C-0x58];

	/* 0x5C: Channel 4 counter register */
	uint32_t volatile CH4CNT;
	/* Transfer counter */
#define DMA0_CH4CNT_CNT_msb					0u
#define DMA0_CH4CNT_CNT_lsb					15u

	/* 0x5C */
	uint8_t RESERVED19[0x60-0x5C];

	/* 0x60: Channel 4 peripheral base address register */
	uint32_t volatile CH4PADDR;
	/* Peripheral base address */
#define DMA0_CH4PADDR_PADDR_msb					0u
#define DMA0_CH4PADDR_PADDR_lsb					31u

