josuah/mcu-gd32vf103/registers.h
	/* 0x60 */
	uint8_t RESERVED20[0x64-0x60];

	/* 0x64: Channel 4 memory base address register */
	uint32_t volatile CH4MADDR;
	/* Memory base address */
#define DMA0_CH4MADDR_MADDR_msb					0u
#define DMA0_CH4MADDR_MADDR_lsb					31u

	/* 0x64 */
	uint8_t RESERVED21[0x6C-0x64];

	/* 0x6C: Channel 5 control register */
	uint32_t volatile CH5CTL;
	/* Channel enable */
#define DMA0_CH5CTL_CHEN					0u
	/* Enable bit for channel full transfer finish interrupt */
#define DMA0_CH5CTL_FTFIE					1u
	/* Enable bit for channel half transfer finish interrupt */
#define DMA0_CH5CTL_HTFIE					2u
	/* Enable bit for channel error interrupt */
#define DMA0_CH5CTL_ERRIE					3u
	/* Transfer direction */
#define DMA0_CH5CTL_DIR						4u
	/* Circular mode enable */
#define DMA0_CH5CTL_CMEN					5u
	/* Next address generation algorithm of peripheral */
#define DMA0_CH5CTL_PNAGA					6u
	/* Next address generation algorithm of memory */
#define DMA0_CH5CTL_MNAGA					7u
	/* Transfer data size of peripheral */
#define DMA0_CH5CTL_PWIDTH_msb					8u
#define DMA0_CH5CTL_PWIDTH_lsb					9u
	/* Transfer data size of memory */
#define DMA0_CH5CTL_MWIDTH_msb					10u
#define DMA0_CH5CTL_MWIDTH_lsb					11u
	/* Priority level */
#define DMA0_CH5CTL_PRIO_msb					12u
#define DMA0_CH5CTL_PRIO_lsb					13u
	/* Memory to Memory Mode */
#define DMA0_CH5CTL_M2M						14u

	/* 0x6C */
	uint8_t RESERVED22[0x70-0x6C];

	/* 0x70: Channel 5 counter register */
	uint32_t volatile CH5CNT;
	/* Transfer counter */
#define DMA0_CH5CNT_CNT_msb					0u
#define DMA0_CH5CNT_CNT_lsb					15u

	/* 0x70 */
	uint8_t RESERVED23[0x74-0x70];

	/* 0x74: Channel 5 peripheral base address register */
	uint32_t volatile CH5PADDR;
	/* Peripheral base address */
#define DMA0_CH5PADDR_PADDR_msb					0u
#define DMA0_CH5PADDR_PADDR_lsb					31u

	/* 0x74 */
	uint8_t RESERVED24[0x78-0x74];

	/* 0x78: Channel 5 memory base address register */
	uint32_t volatile CH5MADDR;
	/* Memory base address */
#define DMA0_CH5MADDR_MADDR_msb					0u
#define DMA0_CH5MADDR_MADDR_lsb					31u

	/* 0x78 */
	uint8_t RESERVED25[0x80-0x78];

	/* 0x80: Channel 6 control register */
	uint32_t volatile CH6CTL;
	/* Channel enable */
#define DMA0_CH6CTL_CHEN					0u
	/* Enable bit for channel full transfer finish interrupt */
#define DMA0_CH6CTL_FTFIE					1u
	/* Enable bit for channel half transfer finish interrupt */
#define DMA0_CH6CTL_HTFIE					2u
	/* Enable bit for channel error interrupt */
#define DMA0_CH6CTL_ERRIE					3u
	/* Transfer direction */
#define DMA0_CH6CTL_DIR						4u
	/* Circular mode enable */
#define DMA0_CH6CTL_CMEN					5u
	/* Next address generation algorithm of peripheral */
#define DMA0_CH6CTL_PNAGA					6u
	/* Next address generation algorithm of memory */
#define DMA0_CH6CTL_MNAGA					7u
	/* Transfer data size of peripheral */
#define DMA0_CH6CTL_PWIDTH_msb					8u
#define DMA0_CH6CTL_PWIDTH_lsb					9u
	/* Transfer data size of memory */
#define DMA0_CH6CTL_MWIDTH_msb					10u
#define DMA0_CH6CTL_MWIDTH_lsb					11u
	/* Priority level */
#define DMA0_CH6CTL_PRIO_msb					12u
#define DMA0_CH6CTL_PRIO_lsb					13u
	/* Memory to Memory Mode */
#define DMA0_CH6CTL_M2M						14u

	/* 0x80 */
	uint8_t RESERVED26[0x84-0x80];

	/* 0x84: Channel 6 counter register */
	uint32_t volatile CH6CNT;
	/* Transfer counter */
#define DMA0_CH6CNT_CNT_msb					0u
#define DMA0_CH6CNT_CNT_lsb					15u

	/* 0x84 */
	uint8_t RESERVED27[0x88-0x84];

	/* 0x88: Channel 6 peripheral base address register */
	uint32_t volatile CH6PADDR;
	/* Peripheral base address */
#define DMA0_CH6PADDR_PADDR_msb					0u
#define DMA0_CH6PADDR_PADDR_lsb					31u

	/* 0x88 */
	uint8_t RESERVED28[0x8C-0x88];

	/* 0x8C: Channel 6 memory base address register */
	uint32_t volatile CH6MADDR;
	/* Memory base address */
#define DMA0_CH6MADDR_MADDR_msb					0u
#define DMA0_CH6MADDR_MADDR_lsb					31u

};


#define DMA1 ((struct sdk_dma1 *)0x40020400)

struct sdk_dma1 {

	/* 0x00: Interrupt flag register */
	uint32_t volatile INTF;
	/* Global interrupt flag of channel 0 */
#define DMA1_INTF_GIF0						0u
	/* Full Transfer finish flag of channe 0 */
#define DMA1_INTF_FTFIF0					1u
	/* Half transfer finish flag of channel 0 */
#define DMA1_INTF_HTFIF0					2u
	/* Error flag of channel 0 */
#define DMA1_INTF_ERRIF0					3u
	/* Global interrupt flag of channel 1 */
#define DMA1_INTF_GIF1						4u
	/* Full Transfer finish flag of channe 1 */
#define DMA1_INTF_FTFIF1					5u
	/* Half transfer finish flag of channel 1 */
#define DMA1_INTF_HTFIF1					6u
	/* Error flag of channel 1 */
#define DMA1_INTF_ERRIF1					7u
	/* Global interrupt flag of channel 2 */
#define DMA1_INTF_GIF2						8u
	/* Full Transfer finish flag of channe 2 */
#define DMA1_INTF_FTFIF2					9u
	/* Half transfer finish flag of channel 2 */
#define DMA1_INTF_HTFIF2					10u
	/* Error flag of channel 2 */
#define DMA1_INTF_ERRIF2					11u
	/* Global interrupt flag of channel 3 */
#define DMA1_INTF_GIF3						12u
	/* Full Transfer finish flag of channe 3 */
#define DMA1_INTF_FTFIF3					13u
	/* Half transfer finish flag of channel 3 */
#define DMA1_INTF_HTFIF3					14u
	/* Error flag of channel 3 */
#define DMA1_INTF_ERRIF3					15u
	/* Global interrupt flag of channel 4 */
#define DMA1_INTF_GIF4						16u
	/* Full Transfer finish flag of channe 4 */
#define DMA1_INTF_FTFIF4					17u
	/* Half transfer finish flag of channel 4 */
#define DMA1_INTF_HTFIF4					18u
	/* Error flag of channel 4 */
#define DMA1_INTF_ERRIF4					19u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: Interrupt flag clear register */
	uint32_t volatile INTC;
	/* Clear global interrupt flag of channel 0 */
#define DMA1_INTC_GIFC0						0u
	/* Clear bit for full transfer finish flag of channel 0 */
#define DMA1_INTC_FTFIFC0					1u
	/* Clear bit for half transfer finish flag of channel 0 */
#define DMA1_INTC_HTFIFC0					2u
	/* Clear bit for error flag of channel 0 */
#define DMA1_INTC_ERRIFC0					3u
	/* Clear global interrupt flag of channel 1 */
#define DMA1_INTC_GIFC1						4u
	/* Clear bit for full transfer finish flag of channel 1 */
#define DMA1_INTC_FTFIFC1					5u
	/* Clear bit for half transfer finish flag of channel 1 */
#define DMA1_INTC_HTFIFC1					6u
	/* Clear bit for error flag of channel 1 */
#define DMA1_INTC_ERRIFC1					7u
	/* Clear global interrupt flag of channel 2 */
#define DMA1_INTC_GIFC2						8u
	/* Clear bit for full transfer finish flag of channel 2 */
#define DMA1_INTC_FTFIFC2					9u
	/* Clear bit for half transfer finish flag of channel 2 */
#define DMA1_INTC_HTFIFC2					10u
	/* Clear bit for error flag of channel 2 */
#define DMA1_INTC_ERRIFC2					11u
	/* Clear global interrupt flag of channel 3 */
#define DMA1_INTC_GIFC3						12u
	/* Clear bit for full transfer finish flag of channel 3 */
#define DMA1_INTC_FTFIFC3					13u
	/* Clear bit for half transfer finish flag of channel 3 */
#define DMA1_INTC_HTFIFC3					14u
	/* Clear bit for error flag of channel 3 */
#define DMA1_INTC_ERRIFC3					15u
	/* Clear global interrupt flag of channel 4 */
#define DMA1_INTC_GIFC4						16u
	/* Clear bit for full transfer finish flag of channel 4 */
#define DMA1_INTC_FTFIFC4					17u
	/* Clear bit for half transfer finish flag of channel 4 */
#define DMA1_INTC_HTFIFC4					18u
	/* Clear bit for error flag of channel 4 */
#define DMA1_INTC_ERRIFC4					19u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: Channel 0 control register */
	uint32_t volatile CH0CTL;
	/* Channel enable */
#define DMA1_CH0CTL_CHEN					0u
	/* Enable bit for channel full transfer finish interrupt */
#define DMA1_CH0CTL_FTFIE					1u
	/* Enable bit for channel half transfer finish interrupt */
#define DMA1_CH0CTL_HTFIE					2u
	/* Enable bit for channel error interrupt */
#define DMA1_CH0CTL_ERRIE					3u
	/* Transfer direction */
#define DMA1_CH0CTL_DIR						4u
	/* Circular mode enable */
#define DMA1_CH0CTL_CMEN					5u
	/* Next address generation algorithm of peripheral */
#define DMA1_CH0CTL_PNAGA					6u
	/* Next address generation algorithm of memory */
#define DMA1_CH0CTL_MNAGA					7u
	/* Transfer data size of peripheral */
#define DMA1_CH0CTL_PWIDTH_msb					8u
#define DMA1_CH0CTL_PWIDTH_lsb					9u
	/* Transfer data size of memory */
#define DMA1_CH0CTL_MWIDTH_msb					10u
#define DMA1_CH0CTL_MWIDTH_lsb					11u
	/* Priority level */
#define DMA1_CH0CTL_PRIO_msb					12u
#define DMA1_CH0CTL_PRIO_lsb					13u
	/* Memory to Memory Mode */
#define DMA1_CH0CTL_M2M						14u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C: Channel 0 counter register */
	uint32_t volatile CH0CNT;
	/* Transfer counter */
#define DMA1_CH0CNT_CNT_msb					0u
#define DMA1_CH0CNT_CNT_lsb					15u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

	/* 0x10: Channel 0 peripheral base address register */
	uint32_t volatile CH0PADDR;
	/* Peripheral base address */
#define DMA1_CH0PADDR_PADDR_msb					0u
#define DMA1_CH0PADDR_PADDR_lsb					31u

