josuah/mcu-gd32vf103/registers.h
	/* 0x60 */
	uint8_t RESERVED20[0x64-0x60];

	/* 0x64: Channel 4 memory base address register */
	uint32_t volatile CH4MADDR;
	/* Memory base address */
#define DMA1_CH4MADDR_MADDR_msb					0u
#define DMA1_CH4MADDR_MADDR_lsb					31u

};


#define EXMC ((struct sdk_exmc *)0xA0000000)

struct sdk_exmc {

	/* 0x00: SRAM/NOR flash control register 0 */
	uint32_t volatile SNCTL0;
	/* Asynchronous wait */
#define EXMC_SNCTL0_ASYNCWAIT					15u
	/* NWAIT signal enable */
#define EXMC_SNCTL0_NRWTEN					13u
	/* Write enable */
#define EXMC_SNCTL0_WREN					12u
	/* NWAIT signal polarity */
#define EXMC_SNCTL0_NRWTPOL					9u
	/* NOR Flash access enable */
#define EXMC_SNCTL0_NREN					6u
	/* NOR bank memory data bus width */
#define EXMC_SNCTL0_NRW_msb					4u
#define EXMC_SNCTL0_NRW_lsb					5u
	/* NOR bank memory type */
#define EXMC_SNCTL0_NRTP_msb					2u
#define EXMC_SNCTL0_NRTP_lsb					3u
	/* NOR bank memory address/data multiplexing */
#define EXMC_SNCTL0_NRMUX					1u
	/* NOR bank enable */
#define EXMC_SNCTL0_NRBKEN					0u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: SRAM/NOR flash timing configuration register 0 */
	uint32_t volatile SNTCFG0;
	/* Bus latency */
#define EXMC_SNTCFG0_BUSLAT_msb					16u
#define EXMC_SNTCFG0_BUSLAT_lsb					19u
	/* Data setup time */
#define EXMC_SNTCFG0_DSET_msb					8u
#define EXMC_SNTCFG0_DSET_lsb					15u
	/* Address hold time */
#define EXMC_SNTCFG0_AHLD_msb					4u
#define EXMC_SNTCFG0_AHLD_lsb					7u
	/* Address setup time */
#define EXMC_SNTCFG0_ASET_msb					0u
#define EXMC_SNTCFG0_ASET_lsb					3u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: SRAM/NOR flash control register 1 */
	uint32_t volatile SNCTL1;
	/* Asynchronous wait */
#define EXMC_SNCTL1_ASYNCWAIT					15u
	/* NWAIT signal enable */
#define EXMC_SNCTL1_NRWTEN					13u
	/* Write enable */
#define EXMC_SNCTL1_WREN					12u
	/* NWAIT signal polarity */
#define EXMC_SNCTL1_NRWTPOL					9u
	/* NOR Flash access enable */
#define EXMC_SNCTL1_NREN					6u
	/* NOR bank memory data bus width */
#define EXMC_SNCTL1_NRW_msb					4u
#define EXMC_SNCTL1_NRW_lsb					5u
	/* NOR bank memory type */
#define EXMC_SNCTL1_NRTP_msb					2u
#define EXMC_SNCTL1_NRTP_lsb					3u
	/* NOR bank memory address/data multiplexing */
#define EXMC_SNCTL1_NRMUX					1u
	/* NOR bank enable */
#define EXMC_SNCTL1_NRBKEN					0u

};


#define EXTI ((struct sdk_exti *)0x40010400)

struct sdk_exti {

	/* 0x00: Interrupt enable register */
	uint32_t volatile INTEN;
	/* Enable Interrupt on line 0 */
#define EXTI_INTEN_INTEN0					0u
	/* Enable Interrupt on line 1 */
#define EXTI_INTEN_INTEN1					1u
	/* Enable Interrupt on line 2 */
#define EXTI_INTEN_INTEN2					2u
	/* Enable Interrupt on line 3 */
#define EXTI_INTEN_INTEN3					3u
	/* Enable Interrupt on line 4 */
#define EXTI_INTEN_INTEN4					4u
	/* Enable Interrupt on line 5 */
#define EXTI_INTEN_INTEN5					5u
	/* Enable Interrupt on line 6 */
#define EXTI_INTEN_INTEN6					6u
	/* Enable Interrupt on line 7 */
#define EXTI_INTEN_INTEN7					7u
	/* Enable Interrupt on line 8 */
#define EXTI_INTEN_INTEN8					8u
	/* Enable Interrupt on line 9 */
#define EXTI_INTEN_INTEN9					9u
	/* Enable Interrupt on line 10 */
#define EXTI_INTEN_INTEN10					10u
	/* Enable Interrupt on line 11 */
#define EXTI_INTEN_INTEN11					11u
	/* Enable Interrupt on line 12 */
#define EXTI_INTEN_INTEN12					12u
	/* Enable Interrupt on line 13 */
#define EXTI_INTEN_INTEN13					13u
	/* Enable Interrupt on line 14 */
#define EXTI_INTEN_INTEN14					14u
	/* Enable Interrupt on line 15 */
#define EXTI_INTEN_INTEN15					15u
	/* Enable Interrupt on line 16 */
#define EXTI_INTEN_INTEN16					16u
	/* Enable Interrupt on line 17 */
#define EXTI_INTEN_INTEN17					17u
	/* Enable Interrupt on line 18 */
#define EXTI_INTEN_INTEN18					18u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: Event enable register (EXTI_EVEN) */
	uint32_t volatile EVEN;
	/* Enable Event on line 0 */
#define EXTI_EVEN_EVEN0						0u
	/* Enable Event on line 1 */
#define EXTI_EVEN_EVEN1						1u
	/* Enable Event on line 2 */
#define EXTI_EVEN_EVEN2						2u
	/* Enable Event on line 3 */
#define EXTI_EVEN_EVEN3						3u
	/* Enable Event on line 4 */
#define EXTI_EVEN_EVEN4						4u
	/* Enable Event on line 5 */
#define EXTI_EVEN_EVEN5						5u
	/* Enable Event on line 6 */
#define EXTI_EVEN_EVEN6						6u
	/* Enable Event on line 7 */
#define EXTI_EVEN_EVEN7						7u
	/* Enable Event on line 8 */
#define EXTI_EVEN_EVEN8						8u
	/* Enable Event on line 9 */
#define EXTI_EVEN_EVEN9						9u
	/* Enable Event on line 10 */
#define EXTI_EVEN_EVEN10					10u
	/* Enable Event on line 11 */
#define EXTI_EVEN_EVEN11					11u
	/* Enable Event on line 12 */
#define EXTI_EVEN_EVEN12					12u
	/* Enable Event on line 13 */
#define EXTI_EVEN_EVEN13					13u
	/* Enable Event on line 14 */
#define EXTI_EVEN_EVEN14					14u
	/* Enable Event on line 15 */
#define EXTI_EVEN_EVEN15					15u
	/* Enable Event on line 16 */
#define EXTI_EVEN_EVEN16					16u
	/* Enable Event on line 17 */
#define EXTI_EVEN_EVEN17					17u
	/* Enable Event on line 18 */
#define EXTI_EVEN_EVEN18					18u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: Rising Edge Trigger Enable register */
	uint32_t volatile RTEN;
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN0						0u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN1						1u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN2						2u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN3						3u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN4						4u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN5						5u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN6						6u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN7						7u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN8						8u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN9						9u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN10					10u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN11					11u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN12					12u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN13					13u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN14					14u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN15					15u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN16					16u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN17					17u
	/* Rising edge trigger enable of */
#define EXTI_RTEN_RTEN18					18u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

