josuah/mcu-gd32vf103/registers.h
	/* 0x0C: Falling Egde Trigger Enable register */
	uint32_t volatile FTEN;
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN0						0u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN1						1u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN2						2u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN3						3u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN4						4u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN5						5u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN6						6u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN7						7u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN8						8u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN9						9u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN10					10u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN11					11u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN12					12u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN13					13u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN14					14u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN15					15u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN16					16u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN17					17u
	/* Falling edge trigger enable of */
#define EXTI_FTEN_FTEN18					18u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

	/* 0x10: Software interrupt event register */
	uint32_t volatile SWIEV;
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV0					0u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV1					1u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV2					2u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV3					3u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV4					4u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV5					5u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV6					6u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV7					7u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV8					8u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV9					9u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV10					10u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV11					11u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV12					12u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV13					13u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV14					14u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV15					15u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV16					16u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV17					17u
	/* Interrupt/Event software trigger on line */
#define EXTI_SWIEV_SWIEV18					18u

	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: Pending register (EXTI_PD) */
	uint32_t volatile PD;
	/* Interrupt pending status of line 0 */
#define EXTI_PD_PD0						0u
	/* Interrupt pending status of line 1 */
#define EXTI_PD_PD1						1u
	/* Interrupt pending status of line 2 */
#define EXTI_PD_PD2						2u
	/* Interrupt pending status of line 3 */
#define EXTI_PD_PD3						3u
	/* Interrupt pending status of line 4 */
#define EXTI_PD_PD4						4u
	/* Interrupt pending status of line 5 */
#define EXTI_PD_PD5						5u
	/* Interrupt pending status of line 6 */
#define EXTI_PD_PD6						6u
	/* Interrupt pending status of line 7 */
#define EXTI_PD_PD7						7u
	/* Interrupt pending status of line 8 */
#define EXTI_PD_PD8						8u
	/* Interrupt pending status of line 9 */
#define EXTI_PD_PD9						9u
	/* Interrupt pending status of line 10 */
#define EXTI_PD_PD10						10u
	/* Interrupt pending status of line 11 */
#define EXTI_PD_PD11						11u
	/* Interrupt pending status of line 12 */
#define EXTI_PD_PD12						12u
	/* Interrupt pending status of line 13 */
#define EXTI_PD_PD13						13u
	/* Interrupt pending status of line 14 */
#define EXTI_PD_PD14						14u
	/* Interrupt pending status of line 15 */
#define EXTI_PD_PD15						15u
	/* Interrupt pending status of line 16 */
#define EXTI_PD_PD16						16u
	/* Interrupt pending status of line 17 */
#define EXTI_PD_PD17						17u
	/* Interrupt pending status of line 18 */
#define EXTI_PD_PD18						18u

};


#define FMC ((struct sdk_fmc *)0x40022000)

struct sdk_fmc {

	/* 0x00: wait state counter register */
	uint32_t volatile WS;
	/* wait state counter register */
#define FMC_WS_WSCNT_msb					0u
#define FMC_WS_WSCNT_lsb					2u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: Unlock key register 0 */
	uint32_t volatile KEY0;
	/* FMC_CTL0 unlock key */
#define FMC_KEY0_KEY_msb					0u
#define FMC_KEY0_KEY_lsb					31u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: Option byte unlock key register */
	uint32_t volatile OBKEY;
	/* FMC_ CTL0 option byte operation unlock register */
#define FMC_OBKEY_OBKEY_msb					0u
#define FMC_OBKEY_OBKEY_lsb					31u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C: Status register 0 */
	uint32_t volatile STAT0;
	/* End of operation flag bit */
#define FMC_STAT0_ENDF						5u
	/* Erase/Program protection error flag bit */
#define FMC_STAT0_WPERR						4u
	/* Program error flag bit */
#define FMC_STAT0_PGERR						2u
	/* The flash is busy bit */
#define FMC_STAT0_BUSY						0u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

	/* 0x10: Control register 0 */
	uint32_t volatile CTL0;
	/* End of operation interrupt enable bit */
#define FMC_CTL0_ENDIE						12u
	/* Error interrupt enable bit */
#define FMC_CTL0_ERRIE						10u
	/* Option byte erase/program enable bit */
#define FMC_CTL0_OBWEN						9u
	/* FMC_CTL0 lock bit */
#define FMC_CTL0_LK						7u
	/* Send erase command to FMC bit */
#define FMC_CTL0_START						6u
	/* Option bytes erase command bit */
#define FMC_CTL0_OBER						5u
	/* Option bytes program command bit */
#define FMC_CTL0_OBPG						4u
	/* Main flash mass erase for bank0 command bit */
#define FMC_CTL0_MER						2u
	/* Main flash page erase for bank0 command bit */
#define FMC_CTL0_PER						1u
	/* Main flash program for bank0 command bit */
#define FMC_CTL0_PG						0u

