josuah/mcu-gd32vf103/registers.h
	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: Address register 0 */
	uint32_t volatile ADDR0;
	/* Flash erase/program command address bits */
#define FMC_ADDR0_ADDR_msb					0u
#define FMC_ADDR0_ADDR_lsb					31u

	/* 0x14 */
	uint8_t RESERVED5[0x1C-0x14];

	/* 0x1C: Option byte status register */
	uint32_t volatile OBSTAT;
	/* Option bytes read error bit */
#define FMC_OBSTAT_OBERR					0u
	/* Option bytes security protection code */
#define FMC_OBSTAT_SPC						1u
	/* Store USER of option bytes block after system reset */
#define FMC_OBSTAT_USER_msb					2u
#define FMC_OBSTAT_USER_lsb					9u
	/* Store DATA[15:0] of option bytes block after system reset */
#define FMC_OBSTAT_DATA_msb					10u
#define FMC_OBSTAT_DATA_lsb					25u

	/* 0x1C */
	uint8_t RESERVED6[0x20-0x1C];

	/* 0x20: Erase/Program Protection register */
	uint32_t volatile WP;
	/* Store WP[31:0] of option bytes block after system reset */
#define FMC_WP_WP_msb						0u
#define FMC_WP_WP_lsb						31u

	/* 0x20 */
	uint8_t RESERVED7[0x100-0x20];

	/* 0x100: Product ID register */
	uint32_t volatile PID;
	/* Product reserved ID code register */
#define FMC_PID_PID_msb						0u
#define FMC_PID_PID_lsb						31u

};


#define FWDGT ((struct sdk_fwdgt *)0x40003000)

struct sdk_fwdgt {

	/* 0x00: Control register */
	uint32_t volatile CTL;
	/* Key value */
#define FWDGT_CTL_CMD_msb					0u
#define FWDGT_CTL_CMD_lsb					15u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: Prescaler register */
	uint32_t volatile PSC;
	/* Free watchdog timer prescaler selection */
#define FWDGT_PSC_PSC_msb					0u
#define FWDGT_PSC_PSC_lsb					2u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: Reload register */
	uint32_t volatile RLD;
	/* Free watchdog timer counter reload value */
#define FWDGT_RLD_RLD_msb					0u
#define FWDGT_RLD_RLD_lsb					11u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C: Status register */
	uint32_t volatile STAT;
	/* Free watchdog timer prescaler value update */
#define FWDGT_STAT_PUD						0u
	/* Free watchdog timer counter reload value update */
#define FWDGT_STAT_RUD						1u

};


#define GPIOA ((struct sdk_gpio *)0x40010800)
#define GPIOB ((struct sdk_gpio *)0x40010C00)
#define GPIOC ((struct sdk_gpio *)0x40011000)
#define GPIOD ((struct sdk_gpio *)0x40011400)
#define GPIOE ((struct sdk_gpio *)0x40011800)

struct sdk_gpio {

	/* 0x00: port control register 0 */
	uint32_t volatile CTL0;
	/* Port x configuration bits (x = */
#define GPIOA_CTL0_CTL7_msb					30u
#define GPIOA_CTL0_CTL7_lsb					31u
	/* Port x mode bits (x = */
#define GPIOA_CTL0_MD7_msb					28u
#define GPIOA_CTL0_MD7_lsb					29u
	/* Port x configuration bits (x = */
#define GPIOA_CTL0_CTL6_msb					26u
#define GPIOA_CTL0_CTL6_lsb					27u
	/* Port x mode bits (x = */
#define GPIOA_CTL0_MD6_msb					24u
#define GPIOA_CTL0_MD6_lsb					25u
	/* Port x configuration bits (x = */
#define GPIOA_CTL0_CTL5_msb					22u
#define GPIOA_CTL0_CTL5_lsb					23u
	/* Port x mode bits (x = */
#define GPIOA_CTL0_MD5_msb					20u
#define GPIOA_CTL0_MD5_lsb					21u
	/* Port x configuration bits (x = */
#define GPIOA_CTL0_CTL4_msb					18u
#define GPIOA_CTL0_CTL4_lsb					19u
	/* Port x mode bits (x = */
#define GPIOA_CTL0_MD4_msb					16u
#define GPIOA_CTL0_MD4_lsb					17u
	/* Port x configuration bits (x = */
#define GPIOA_CTL0_CTL3_msb					14u
#define GPIOA_CTL0_CTL3_lsb					15u
	/* Port x mode bits (x = */
#define GPIOA_CTL0_MD3_msb					12u
#define GPIOA_CTL0_MD3_lsb					13u
	/* Port x configuration bits (x = */
#define GPIOA_CTL0_CTL2_msb					10u
#define GPIOA_CTL0_CTL2_lsb					11u
	/* Port x mode bits (x = */
#define GPIOA_CTL0_MD2_msb					8u
#define GPIOA_CTL0_MD2_lsb					9u
	/* Port x configuration bits (x = */
#define GPIOA_CTL0_CTL1_msb					6u
#define GPIOA_CTL0_CTL1_lsb					7u
	/* Port x mode bits (x = */
#define GPIOA_CTL0_MD1_msb					4u
#define GPIOA_CTL0_MD1_lsb					5u
	/* Port x configuration bits (x = */
#define GPIOA_CTL0_CTL0_msb					2u
#define GPIOA_CTL0_CTL0_lsb					3u
	/* Port x mode bits (x = */
#define GPIOA_CTL0_MD0_msb					0u
#define GPIOA_CTL0_MD0_lsb					1u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: port control register 1 */
	uint32_t volatile CTL1;
	/* Port x configuration bits (x = */
#define GPIOA_CTL1_CTL15_msb					30u
#define GPIOA_CTL1_CTL15_lsb					31u
	/* Port x mode bits (x = */
#define GPIOA_CTL1_MD15_msb					28u
#define GPIOA_CTL1_MD15_lsb					29u
	/* Port x configuration bits (x = */
#define GPIOA_CTL1_CTL14_msb					26u
#define GPIOA_CTL1_CTL14_lsb					27u
	/* Port x mode bits (x = */
#define GPIOA_CTL1_MD14_msb					24u
#define GPIOA_CTL1_MD14_lsb					25u
	/* Port x configuration bits (x = */
#define GPIOA_CTL1_CTL13_msb					22u
#define GPIOA_CTL1_CTL13_lsb					23u
	/* Port x mode bits (x = */
#define GPIOA_CTL1_MD13_msb					20u
#define GPIOA_CTL1_MD13_lsb					21u
	/* Port x configuration bits (x = */
#define GPIOA_CTL1_CTL12_msb					18u
#define GPIOA_CTL1_CTL12_lsb					19u
	/* Port x mode bits (x = */
#define GPIOA_CTL1_MD12_msb					16u
#define GPIOA_CTL1_MD12_lsb					17u
	/* Port x configuration bits (x = */
#define GPIOA_CTL1_CTL11_msb					14u
#define GPIOA_CTL1_CTL11_lsb					15u
	/* Port x mode bits (x = */
#define GPIOA_CTL1_MD11_msb					12u
#define GPIOA_CTL1_MD11_lsb					13u
	/* Port x configuration bits (x = */
#define GPIOA_CTL1_CTL10_msb					10u
#define GPIOA_CTL1_CTL10_lsb					11u
	/* Port x mode bits (x = */
#define GPIOA_CTL1_MD10_msb					8u
#define GPIOA_CTL1_MD10_lsb					9u
	/* Port x configuration bits (x = */
#define GPIOA_CTL1_CTL9_msb					6u
#define GPIOA_CTL1_CTL9_lsb					7u
	/* Port x mode bits (x = */
#define GPIOA_CTL1_MD9_msb					4u
#define GPIOA_CTL1_MD9_lsb					5u
	/* Port x configuration bits (x = */
#define GPIOA_CTL1_CTL8_msb					2u
#define GPIOA_CTL1_CTL8_lsb					3u
	/* Port x mode bits (x = */
#define GPIOA_CTL1_MD8_msb					0u
#define GPIOA_CTL1_MD8_lsb					1u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: Port input status register */
	uint32_t volatile ISTAT;
	/* Port input status */
#define GPIOA_ISTAT_ISTAT15					15u
	/* Port input status */
#define GPIOA_ISTAT_ISTAT14					14u
	/* Port input status */
#define GPIOA_ISTAT_ISTAT13					13u
	/* Port input status */
#define GPIOA_ISTAT_ISTAT12					12u
	/* Port input status */
#define GPIOA_ISTAT_ISTAT11					11u
	/* Port input status */
#define GPIOA_ISTAT_ISTAT10					10u
	/* Port input status */
#define GPIOA_ISTAT_ISTAT9					9u
	/* Port input status */
#define GPIOA_ISTAT_ISTAT8					8u
	/* Port input status */
#define GPIOA_ISTAT_ISTAT7					7u
	/* Port input status */
#define GPIOA_ISTAT_ISTAT6					6u
	/* Port input status */
#define GPIOA_ISTAT_ISTAT5					5u
	/* Port input status */
#define GPIOA_ISTAT_ISTAT4					4u
	/* Port input status */
#define GPIOA_ISTAT_ISTAT3					3u
	/* Port input status */
#define GPIOA_ISTAT_ISTAT2					2u
	/* Port input status */
#define GPIOA_ISTAT_ISTAT1					1u
	/* Port input status */
#define GPIOA_ISTAT_ISTAT0					0u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C: Port output control register */
	uint32_t volatile OCTL;
	/* Port output control */
#define GPIOA_OCTL_OCTL15					15u
	/* Port output control */
#define GPIOA_OCTL_OCTL14					14u
	/* Port output control */
#define GPIOA_OCTL_OCTL13					13u
	/* Port output control */
#define GPIOA_OCTL_OCTL12					12u
	/* Port output control */
#define GPIOA_OCTL_OCTL11					11u
	/* Port output control */
#define GPIOA_OCTL_OCTL10					10u
	/* Port output control */
#define GPIOA_OCTL_OCTL9					9u
	/* Port output control */
#define GPIOA_OCTL_OCTL8					8u
	/* Port output control */
#define GPIOA_OCTL_OCTL7					7u
	/* Port output control */
#define GPIOA_OCTL_OCTL6					6u
	/* Port output control */
#define GPIOA_OCTL_OCTL5					5u
	/* Port output control */
#define GPIOA_OCTL_OCTL4					4u
	/* Port output control */
#define GPIOA_OCTL_OCTL3					3u
	/* Port output control */
#define GPIOA_OCTL_OCTL2					2u
	/* Port output control */
#define GPIOA_OCTL_OCTL1					1u
	/* Port output control */
#define GPIOA_OCTL_OCTL0					0u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

	/* 0x10: Port bit operate register */
	uint32_t volatile BOP;
	/* Port 15 Clear bit */
#define GPIOA_BOP_CR15						31u
	/* Port 14 Clear bit */
#define GPIOA_BOP_CR14						30u
	/* Port 13 Clear bit */
#define GPIOA_BOP_CR13						29u
	/* Port 12 Clear bit */
#define GPIOA_BOP_CR12						28u
	/* Port 11 Clear bit */
#define GPIOA_BOP_CR11						27u
	/* Port 10 Clear bit */
#define GPIOA_BOP_CR10						26u
	/* Port 9 Clear bit */
#define GPIOA_BOP_CR9						25u
	/* Port 8 Clear bit */
#define GPIOA_BOP_CR8						24u
	/* Port 7 Clear bit */
#define GPIOA_BOP_CR7						23u
	/* Port 6 Clear bit */
#define GPIOA_BOP_CR6						22u
	/* Port 5 Clear bit */
#define GPIOA_BOP_CR5						21u
	/* Port 4 Clear bit */
#define GPIOA_BOP_CR4						20u
	/* Port 3 Clear bit */
#define GPIOA_BOP_CR3						19u
	/* Port 2 Clear bit */
#define GPIOA_BOP_CR2						18u
	/* Port 1 Clear bit */
#define GPIOA_BOP_CR1						17u
	/* Port 0 Clear bit */
#define GPIOA_BOP_CR0						16u
	/* Port 15 Set bit */
#define GPIOA_BOP_BOP15						15u
	/* Port 14 Set bit */
#define GPIOA_BOP_BOP14						14u
	/* Port 13 Set bit */
#define GPIOA_BOP_BOP13						13u
	/* Port 12 Set bit */
#define GPIOA_BOP_BOP12						12u
	/* Port 11 Set bit */
#define GPIOA_BOP_BOP11						11u
	/* Port 10 Set bit */
#define GPIOA_BOP_BOP10						10u
	/* Port 9 Set bit */
#define GPIOA_BOP_BOP9						9u
	/* Port 8 Set bit */
#define GPIOA_BOP_BOP8						8u
	/* Port 7 Set bit */
#define GPIOA_BOP_BOP7						7u
	/* Port 6 Set bit */
#define GPIOA_BOP_BOP6						6u
	/* Port 5 Set bit */
#define GPIOA_BOP_BOP5						5u
	/* Port 4 Set bit */
#define GPIOA_BOP_BOP4						4u
	/* Port 3 Set bit */
#define GPIOA_BOP_BOP3						3u
	/* Port 2 Set bit */
#define GPIOA_BOP_BOP2						2u
	/* Port 1 Set bit */
#define GPIOA_BOP_BOP1						1u
	/* Port 0 Set bit */
#define GPIOA_BOP_BOP0						0u

