josuah/mcu-gd32vf103/registers.h
	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: Port bit clear register */
	uint32_t volatile BC;
	/* Port 15 Clear bit */
#define GPIOA_BC_CR15						15u
	/* Port 14 Clear bit */
#define GPIOA_BC_CR14						14u
	/* Port 13 Clear bit */
#define GPIOA_BC_CR13						13u
	/* Port 12 Clear bit */
#define GPIOA_BC_CR12						12u
	/* Port 11 Clear bit */
#define GPIOA_BC_CR11						11u
	/* Port 10 Clear bit */
#define GPIOA_BC_CR10						10u
	/* Port 9 Clear bit */
#define GPIOA_BC_CR9						9u
	/* Port 8 Clear bit */
#define GPIOA_BC_CR8						8u
	/* Port 7 Clear bit */
#define GPIOA_BC_CR7						7u
	/* Port 6 Clear bit */
#define GPIOA_BC_CR6						6u
	/* Port 5 Clear bit */
#define GPIOA_BC_CR5						5u
	/* Port 4 Clear bit */
#define GPIOA_BC_CR4						4u
	/* Port 3 Clear bit */
#define GPIOA_BC_CR3						3u
	/* Port 2 Clear bit */
#define GPIOA_BC_CR2						2u
	/* Port 1 Clear bit */
#define GPIOA_BC_CR1						1u
	/* Port 0 Clear bit */
#define GPIOA_BC_CR0						0u

	/* 0x14 */
	uint8_t RESERVED5[0x18-0x14];

	/* 0x18: GPIO port configuration lock */
	uint32_t volatile LOCK;
	/* Lock sequence key */
#define GPIOA_LOCK_LKK						16u
	/* Port Lock bit 15 */
#define GPIOA_LOCK_LK15						15u
	/* Port Lock bit 14 */
#define GPIOA_LOCK_LK14						14u
	/* Port Lock bit 13 */
#define GPIOA_LOCK_LK13						13u
	/* Port Lock bit 12 */
#define GPIOA_LOCK_LK12						12u
	/* Port Lock bit 11 */
#define GPIOA_LOCK_LK11						11u
	/* Port Lock bit 10 */
#define GPIOA_LOCK_LK10						10u
	/* Port Lock bit 9 */
#define GPIOA_LOCK_LK9						9u
	/* Port Lock bit 8 */
#define GPIOA_LOCK_LK8						8u
	/* Port Lock bit 7 */
#define GPIOA_LOCK_LK7						7u
	/* Port Lock bit 6 */
#define GPIOA_LOCK_LK6						6u
	/* Port Lock bit 5 */
#define GPIOA_LOCK_LK5						5u
	/* Port Lock bit 4 */
#define GPIOA_LOCK_LK4						4u
	/* Port Lock bit 3 */
#define GPIOA_LOCK_LK3						3u
	/* Port Lock bit 2 */
#define GPIOA_LOCK_LK2						2u
	/* Port Lock bit 1 */
#define GPIOA_LOCK_LK1						1u
	/* Port Lock bit 0 */
#define GPIOA_LOCK_LK0						0u

};


#define I2C0 ((struct sdk_i2c0 *)0x40005400)
#define I2C1 ((struct sdk_i2c1 *)0x40005800)

struct sdk_i2c0 {

	/* 0x00: Control register 0 */
	uint32_t volatile CTL0;
	/* Software reset */
#define I2C0_CTL0_SRESET					15u
	/* SMBus alert */
#define I2C0_CTL0_SALT						13u
	/* PEC Transfer */
#define I2C0_CTL0_PECTRANS					12u
	/* Position of ACK and PEC when receiving */
#define I2C0_CTL0_POAP						11u
	/* Whether or not to send an ACK */
#define I2C0_CTL0_ACKEN						10u
	/* Generate a STOP condition on I2C bus */
#define I2C0_CTL0_STOP						9u
	/* Generate a START condition on I2C bus */
#define I2C0_CTL0_START						8u
	/* Whether to stretch SCL low when data is not ready in slave mode */
#define I2C0_CTL0_SS						7u
	/* Whether or not to response to a General Call (0x00) */
#define I2C0_CTL0_GCEN						6u
	/* PEC Calculation Switch */
#define I2C0_CTL0_PECEN						5u
	/* ARP protocol in SMBus switch */
#define I2C0_CTL0_ARPEN						4u
	/* SMBusType Selection */
#define I2C0_CTL0_SMBSEL					3u
	/* SMBus/I2C mode switch */
#define I2C0_CTL0_SMBEN						1u
	/* I2C peripheral enable */
#define I2C0_CTL0_I2CEN						0u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: Control register 1 */
	uint32_t volatile CTL1;
	/* Flag indicating DMA last transfer */
#define I2C0_CTL1_DMALST					12u
	/* DMA mode switch */
#define I2C0_CTL1_DMAON						11u
	/* Buffer interrupt enable */
#define I2C0_CTL1_BUFIE						10u
	/* Event interrupt enable */
#define I2C0_CTL1_EVIE						9u
	/* Error interrupt enable */
#define I2C0_CTL1_ERRIE						8u
	/* I2C Peripheral clock frequency */
#define I2C0_CTL1_I2CCLK_msb					0u
#define I2C0_CTL1_I2CCLK_lsb					5u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: Slave address register 0 */
	uint32_t volatile SADDR0;
	/* Address mode for the I2C slave */
#define I2C0_SADDR0_ADDFORMAT					15u
	/* Highest two bits of a 10-bit address */
#define I2C0_SADDR0_ADDRESS9_8_msb				8u
#define I2C0_SADDR0_ADDRESS9_8_lsb				9u
	/* 7-bit address or bits 7:1 of a 10-bit address */
#define I2C0_SADDR0_ADDRESS7_1_msb				1u
#define I2C0_SADDR0_ADDRESS7_1_lsb				7u
	/* Bit 0 of a 10-bit address */
#define I2C0_SADDR0_ADDRESS0					0u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C: Slave address register 1 */
	uint32_t volatile SADDR1;
	/* Second I2C address for the slave in Dual-Address mode */
#define I2C0_SADDR1_ADDRESS2_msb				1u
#define I2C0_SADDR1_ADDRESS2_lsb				7u
	/* Dual-Address mode switch */
#define I2C0_SADDR1_DUADEN					0u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

	/* 0x10: Transfer buffer register */
	uint32_t volatile DATA;
	/* Transmission or reception data buffer register */
#define I2C0_DATA_TRB_msb					0u
#define I2C0_DATA_TRB_lsb					7u

	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: Transfer status register 0 */
	uint32_t volatile STAT0;
	/* SMBus Alert status */
#define I2C0_STAT0_SMBALT					15u
	/* Timeout signal in SMBus mode */
#define I2C0_STAT0_SMBTO					14u
	/* PEC error when receiving data */
#define I2C0_STAT0_PECERR					12u
	/* Over-run or under-run situation occurs in slave mode */
#define I2C0_STAT0_OUERR					11u
	/* Acknowledge error */
#define I2C0_STAT0_AERR						10u
	/* Arbitration Lost in master mode */
#define I2C0_STAT0_LOSTARB					9u
	/* A bus error occurs indication a unexpected START or STOP condition on I2C bus */
#define I2C0_STAT0_BERR						8u
	/* I2C_DATA is Empty during transmitting */
#define I2C0_STAT0_TBE						7u
	/* I2C_DATA is not Empty during receiving */
#define I2C0_STAT0_RBNE						6u
	/* STOP condition detected in slave mode */
#define I2C0_STAT0_STPDET					4u
	/* Header of 10-bit address is sent in master mode */
#define I2C0_STAT0_ADD10SEND					3u
	/* Byte transmission completed */
#define I2C0_STAT0_BTC						2u
	/* Address is sent in master mode or received and matches in slave mode */
#define I2C0_STAT0_ADDSEND					1u
	/* START condition sent out in master mode */
#define I2C0_STAT0_SBSEND					0u

	/* 0x14 */
	uint8_t RESERVED5[0x18-0x14];

