josuah/mcu-gd32vf103/registers.h
	/* 0x18: Transfer status register 1 */
	uint32_t volatile STAT1;
	/* Packet Error Checking Value that calculated by hardware when PEC is enabled */
#define I2C0_STAT1_PECV_msb					8u
#define I2C0_STAT1_PECV_lsb					15u
	/* Dual Flag in slave mode */
#define I2C0_STAT1_DUMODF					7u
	/* SMBus Host Header detected in slave mode */
#define I2C0_STAT1_HSTSMB					6u
	/* Default address of SMBusDevice */
#define I2C0_STAT1_DEFSMB					5u
	/* General call address (00h) received */
#define I2C0_STAT1_RXGC						4u
	/* Whether the I2C is a transmitter or a receiver */
#define I2C0_STAT1_TR						2u
	/* Busy flag */
#define I2C0_STAT1_I2CBSY					1u
	/* A flag indicating whether I2C block is in master or slave mode */
#define I2C0_STAT1_MASTER					0u

	/* 0x18 */
	uint8_t RESERVED6[0x1C-0x18];

	/* 0x1C: Clock configure register */
	uint32_t volatile CKCFG;
	/* I2C speed selection in master mode */
#define I2C0_CKCFG_FAST						15u
	/* Duty cycle in fast mode */
#define I2C0_CKCFG_DTCY						14u
	/* I2C Clock control in master mode */
#define I2C0_CKCFG_CLKC_msb					0u
#define I2C0_CKCFG_CLKC_lsb					11u

	/* 0x1C */
	uint8_t RESERVED7[0x20-0x1C];

	/* 0x20: Rise time register */
	uint32_t volatile RT;
	/* Maximum rise time in master mode */
#define I2C0_RT_RISETIME_msb					0u
#define I2C0_RT_RISETIME_lsb					5u

};


#define ECLIC ((struct sdk_eclic *)0xD2000000)

struct sdk_eclic {

	/* 0x00: cliccfg Register */
	uint32_t volatile CLICCFG;
	/* NLBITS */
#define ECLIC_CLICCFG_NLBITS_msb				1u
#define ECLIC_CLICCFG_NLBITS_lsb				4u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: clicinfo Register */
	uint32_t volatile CLICINFO;
	/* NUM_INTERRUPT */
#define ECLIC_CLICINFO_NUM_INTERRUPT_msb			0u
#define ECLIC_CLICINFO_NUM_INTERRUPT_lsb			12u
	/* VERSION */
#define ECLIC_CLICINFO_VERSION_msb				13u
#define ECLIC_CLICINFO_VERSION_lsb				20u
	/* CLICINTCTLBITS */
#define ECLIC_CLICINFO_CLICINTCTLBITS_msb			21u
#define ECLIC_CLICINFO_CLICINTCTLBITS_lsb			24u

	/* 0x04 */
	uint8_t RESERVED1[0x0B-0x04];

	/* 0x0B: MTH Register */
	uint32_t volatile MTH;
	/* MTH */
#define ECLIC_MTH_MTH_msb					0u
#define ECLIC_MTH_MTH_lsb					7u

	/* 0x0B */
	uint8_t RESERVED2[0x1000u-0x0B];

	/* 0x1000: clicintip  Register */
	uint32_t volatile CLICINTIP_0;
	/* IP */
#define ECLIC_CLICINTIP_0_IP					0u

	/* 0x1000 */
	uint8_t RESERVED3[0x1004u-0x1000u];

	/* 0x1004: clicintip  Register */
	uint32_t volatile CLICINTIP_1;
	/* IP */
#define ECLIC_CLICINTIP_1_IP					0u

	/* 0x1004 */
	uint8_t RESERVED4[0x1008u-0x1004u];

	/* 0x1008: clicintip  Register */
	uint32_t volatile CLICINTIP_2;
	/* IP */
#define ECLIC_CLICINTIP_2_IP					0u

	/* 0x1008 */
	uint8_t RESERVED5[0x100Cu-0x1008u];

	/* 0x100C: clicintip  Register */
	uint32_t volatile CLICINTIP_3;
	/* IP */
#define ECLIC_CLICINTIP_3_IP					0u

	/* 0x100C */
	uint8_t RESERVED6[0x1010u-0x100Cu];

	/* 0x1010: clicintip  Register */
	uint32_t volatile CLICINTIP_4;
	/* IP */
#define ECLIC_CLICINTIP_4_IP					0u

	/* 0x1010 */
	uint8_t RESERVED7[0x1014u-0x1010u];

	/* 0x1014: clicintip  Register */
	uint32_t volatile CLICINTIP_5;
	/* IP */
#define ECLIC_CLICINTIP_5_IP					0u

	/* 0x1014 */
	uint8_t RESERVED8[0x1018u-0x1014u];

	/* 0x1018: clicintip  Register */
	uint32_t volatile CLICINTIP_6;
	/* IP */
#define ECLIC_CLICINTIP_6_IP					0u

	/* 0x1018 */
	uint8_t RESERVED9[0x101Cu-0x1018u];

	/* 0x101C: clicintip  Register */
	uint32_t volatile CLICINTIP_7;
	/* IP */
#define ECLIC_CLICINTIP_7_IP					0u

	/* 0x101C */
	uint8_t RESERVED10[0x1020u-0x101Cu];

	/* 0x1020: clicintip  Register */
	uint32_t volatile CLICINTIP_8;
	/* IP */
#define ECLIC_CLICINTIP_8_IP					0u

	/* 0x1020 */
	uint8_t RESERVED11[0x1024u-0x1020u];

	/* 0x1024: clicintip  Register */
	uint32_t volatile CLICINTIP_9;
	/* IP */
#define ECLIC_CLICINTIP_9_IP					0u

	/* 0x1024 */
	uint8_t RESERVED12[0x1028u-0x1024u];

	/* 0x1028: clicintip  Register */
	uint32_t volatile CLICINTIP_10;
	/* IP */
#define ECLIC_CLICINTIP_10_IP					0u

	/* 0x1028 */
	uint8_t RESERVED13[0x102Cu-0x1028u];

	/* 0x102C: clicintip  Register */
	uint32_t volatile CLICINTIP_11;
	/* IP */
#define ECLIC_CLICINTIP_11_IP					0u

	/* 0x102C */
	uint8_t RESERVED14[0x1030u-0x102Cu];

	/* 0x1030: clicintip  Register */
	uint32_t volatile CLICINTIP_12;
	/* IP */
#define ECLIC_CLICINTIP_12_IP					0u

	/* 0x1030 */
	uint8_t RESERVED15[0x1034u-0x1030u];

	/* 0x1034: clicintip  Register */
	uint32_t volatile CLICINTIP_13;
	/* IP */
#define ECLIC_CLICINTIP_13_IP					0u

	/* 0x1034 */
	uint8_t RESERVED16[0x1038u-0x1034u];

	/* 0x1038: clicintip  Register */
	uint32_t volatile CLICINTIP_14;
	/* IP */
#define ECLIC_CLICINTIP_14_IP					0u

	/* 0x1038 */
	uint8_t RESERVED17[0x103Cu-0x1038u];

	/* 0x103C: clicintip  Register */
	uint32_t volatile CLICINTIP_15;
	/* IP */
#define ECLIC_CLICINTIP_15_IP					0u

	/* 0x103C */
	uint8_t RESERVED18[0x1040u-0x103Cu];

	/* 0x1040: clicintip  Register */
	uint32_t volatile CLICINTIP_16;
	/* IP */
#define ECLIC_CLICINTIP_16_IP					0u

	/* 0x1040 */
	uint8_t RESERVED19[0x1044u-0x1040u];

	/* 0x1044: clicintip  Register */
	uint32_t volatile CLICINTIP_17;
	/* IP */
#define ECLIC_CLICINTIP_17_IP					0u

	/* 0x1044 */
	uint8_t RESERVED20[0x1048u-0x1044u];

	/* 0x1048: clicintip  Register */
	uint32_t volatile CLICINTIP_18;
	/* IP */
#define ECLIC_CLICINTIP_18_IP					0u

	/* 0x1048 */
	uint8_t RESERVED21[0x104Cu-0x1048u];

	/* 0x104C: clicintip  Register */
	uint32_t volatile CLICINTIP_19;
	/* IP */
#define ECLIC_CLICINTIP_19_IP					0u

	/* 0x104C */
	uint8_t RESERVED22[0x1050u-0x104Cu];

	/* 0x1050: clicintip  Register */
	uint32_t volatile CLICINTIP_20;
	/* IP */
#define ECLIC_CLICINTIP_20_IP					0u

	/* 0x1050 */
	uint8_t RESERVED23[0x1054u-0x1050u];

	/* 0x1054: clicintip  Register */
	uint32_t volatile CLICINTIP_21;
	/* IP */
#define ECLIC_CLICINTIP_21_IP					0u

	/* 0x1054 */
	uint8_t RESERVED24[0x1058u-0x1054u];

	/* 0x1058: clicintip  Register */
	uint32_t volatile CLICINTIP_22;
	/* IP */
#define ECLIC_CLICINTIP_22_IP					0u

