josuah/mcu-gd32vf103/registers.h
	/* 0x1058 */
	uint8_t RESERVED25[0x105Cu-0x1058u];

	/* 0x105C: clicintip  Register */
	uint32_t volatile CLICINTIP_23;
	/* IP */
#define ECLIC_CLICINTIP_23_IP					0u

	/* 0x105C */
	uint8_t RESERVED26[0x1060u-0x105Cu];

	/* 0x1060: clicintip  Register */
	uint32_t volatile CLICINTIP_24;
	/* IP */
#define ECLIC_CLICINTIP_24_IP					0u

	/* 0x1060 */
	uint8_t RESERVED27[0x1064u-0x1060u];

	/* 0x1064: clicintip  Register */
	uint32_t volatile CLICINTIP_25;
	/* IP */
#define ECLIC_CLICINTIP_25_IP					0u

	/* 0x1064 */
	uint8_t RESERVED28[0x1068u-0x1064u];

	/* 0x1068: clicintip  Register */
	uint32_t volatile CLICINTIP_26;
	/* IP */
#define ECLIC_CLICINTIP_26_IP					0u

	/* 0x1068 */
	uint8_t RESERVED29[0x106Cu-0x1068u];

	/* 0x106C: clicintip  Register */
	uint32_t volatile CLICINTIP_27;
	/* IP */
#define ECLIC_CLICINTIP_27_IP					0u

	/* 0x106C */
	uint8_t RESERVED30[0x1070u-0x106Cu];

	/* 0x1070: clicintip  Register */
	uint32_t volatile CLICINTIP_28;
	/* IP */
#define ECLIC_CLICINTIP_28_IP					0u

	/* 0x1070 */
	uint8_t RESERVED31[0x1074u-0x1070u];

	/* 0x1074: clicintip  Register */
	uint32_t volatile CLICINTIP_29;
	/* IP */
#define ECLIC_CLICINTIP_29_IP					0u

	/* 0x1074 */
	uint8_t RESERVED32[0x1078u-0x1074u];

	/* 0x1078: clicintip  Register */
	uint32_t volatile CLICINTIP_30;
	/* IP */
#define ECLIC_CLICINTIP_30_IP					0u

	/* 0x1078 */
	uint8_t RESERVED33[0x107Cu-0x1078u];

	/* 0x107C: clicintip  Register */
	uint32_t volatile CLICINTIP_31;
	/* IP */
#define ECLIC_CLICINTIP_31_IP					0u

	/* 0x107C */
	uint8_t RESERVED34[0x1080u-0x107Cu];

	/* 0x1080: clicintip  Register */
	uint32_t volatile CLICINTIP_32;
	/* IP */
#define ECLIC_CLICINTIP_32_IP					0u

	/* 0x1080 */
	uint8_t RESERVED35[0x1084u-0x1080u];

	/* 0x1084: clicintip  Register */
	uint32_t volatile CLICINTIP_33;
	/* IP */
#define ECLIC_CLICINTIP_33_IP					0u

	/* 0x1084 */
	uint8_t RESERVED36[0x1088u-0x1084u];

	/* 0x1088: clicintip  Register */
	uint32_t volatile CLICINTIP_34;
	/* IP */
#define ECLIC_CLICINTIP_34_IP					0u

	/* 0x1088 */
	uint8_t RESERVED37[0x108Cu-0x1088u];

	/* 0x108C: clicintip  Register */
	uint32_t volatile CLICINTIP_35;
	/* IP */
#define ECLIC_CLICINTIP_35_IP					0u

	/* 0x108C */
	uint8_t RESERVED38[0x1090u-0x108Cu];

	/* 0x1090: clicintip  Register */
	uint32_t volatile CLICINTIP_36;
	/* IP */
#define ECLIC_CLICINTIP_36_IP					0u

	/* 0x1090 */
	uint8_t RESERVED39[0x1094u-0x1090u];

	/* 0x1094: clicintip  Register */
	uint32_t volatile CLICINTIP_37;
	/* IP */
#define ECLIC_CLICINTIP_37_IP					0u

	/* 0x1094 */
	uint8_t RESERVED40[0x1098u-0x1094u];

	/* 0x1098: clicintip  Register */
	uint32_t volatile CLICINTIP_38;
	/* IP */
#define ECLIC_CLICINTIP_38_IP					0u

	/* 0x1098 */
	uint8_t RESERVED41[0x109Cu-0x1098u];

	/* 0x109C: clicintip  Register */
	uint32_t volatile CLICINTIP_39;
	/* IP */
#define ECLIC_CLICINTIP_39_IP					0u

	/* 0x109C */
	uint8_t RESERVED42[0x10A0u-0x109Cu];

	/* 0x10A0: clicintip  Register */
	uint32_t volatile CLICINTIP_40;
	/* IP */
#define ECLIC_CLICINTIP_40_IP					0u

	/* 0x10A0 */
	uint8_t RESERVED43[0x10A4u-0x10A0u];

	/* 0x10A4: clicintip  Register */
	uint32_t volatile CLICINTIP_41;
	/* IP */
#define ECLIC_CLICINTIP_41_IP					0u

	/* 0x10A4 */
	uint8_t RESERVED44[0x10A8u-0x10A4u];

	/* 0x10A8: clicintip  Register */
	uint32_t volatile CLICINTIP_42;
	/* IP */
#define ECLIC_CLICINTIP_42_IP					0u

	/* 0x10A8 */
	uint8_t RESERVED45[0x10ACu-0x10A8u];

	/* 0x10AC: clicintip  Register */
	uint32_t volatile CLICINTIP_43;
	/* IP */
#define ECLIC_CLICINTIP_43_IP					0u

	/* 0x10AC */
	uint8_t RESERVED46[0x10B0u-0x10ACu];

	/* 0x10B0: clicintip  Register */
	uint32_t volatile CLICINTIP_44;
	/* IP */
#define ECLIC_CLICINTIP_44_IP					0u

	/* 0x10B0 */
	uint8_t RESERVED47[0x10B4u-0x10B0u];

	/* 0x10B4: clicintip  Register */
	uint32_t volatile CLICINTIP_45;
	/* IP */
#define ECLIC_CLICINTIP_45_IP					0u

	/* 0x10B4 */
	uint8_t RESERVED48[0x10B8u-0x10B4u];

	/* 0x10B8: clicintip  Register */
	uint32_t volatile CLICINTIP_46;
	/* IP */
#define ECLIC_CLICINTIP_46_IP					0u

	/* 0x10B8 */
	uint8_t RESERVED49[0x10BCu-0x10B8u];

	/* 0x10BC: clicintip  Register */
	uint32_t volatile CLICINTIP_47;
	/* IP */
#define ECLIC_CLICINTIP_47_IP					0u

	/* 0x10BC */
	uint8_t RESERVED50[0x10C0u-0x10BCu];

	/* 0x10C0: clicintip  Register */
	uint32_t volatile CLICINTIP_48;
	/* IP */
#define ECLIC_CLICINTIP_48_IP					0u

	/* 0x10C0 */
	uint8_t RESERVED51[0x10C4u-0x10C0u];

	/* 0x10C4: clicintip  Register */
	uint32_t volatile CLICINTIP_49;
	/* IP */
#define ECLIC_CLICINTIP_49_IP					0u

	/* 0x10C4 */
	uint8_t RESERVED52[0x10C8u-0x10C4u];

	/* 0x10C8: clicintip  Register */
	uint32_t volatile CLICINTIP_50;
	/* IP */
#define ECLIC_CLICINTIP_50_IP					0u

	/* 0x10C8 */
	uint8_t RESERVED53[0x10CCu-0x10C8u];

	/* 0x10CC: clicintip  Register */
	uint32_t volatile CLICINTIP_51;
	/* IP */
#define ECLIC_CLICINTIP_51_IP					0u

	/* 0x10CC */
	uint8_t RESERVED54[0x10D0u-0x10CCu];

	/* 0x10D0: clicintip  Register */
	uint32_t volatile CLICINTIP_52;
	/* IP */
#define ECLIC_CLICINTIP_52_IP					0u

	/* 0x10D0 */
	uint8_t RESERVED55[0x10D4u-0x10D0u];

	/* 0x10D4: clicintip  Register */
	uint32_t volatile CLICINTIP_53;
	/* IP */
#define ECLIC_CLICINTIP_53_IP					0u

	/* 0x10D4 */
	uint8_t RESERVED56[0x10D8u-0x10D4u];

	/* 0x10D8: clicintip  Register */
	uint32_t volatile CLICINTIP_54;
	/* IP */
#define ECLIC_CLICINTIP_54_IP					0u

	/* 0x10D8 */
	uint8_t RESERVED57[0x10DCu-0x10D8u];

	/* 0x10DC: clicintip  Register */
	uint32_t volatile CLICINTIP_55;
	/* IP */
#define ECLIC_CLICINTIP_55_IP					0u

	/* 0x10DC */
	uint8_t RESERVED58[0x10E0u-0x10DCu];

	/* 0x10E0: clicintip  Register */
	uint32_t volatile CLICINTIP_56;
	/* IP */
#define ECLIC_CLICINTIP_56_IP					0u

	/* 0x10E0 */
	uint8_t RESERVED59[0x10E4u-0x10E0u];

	/* 0x10E4: clicintip  Register */
	uint32_t volatile CLICINTIP_57;
	/* IP */
#define ECLIC_CLICINTIP_57_IP					0u

	/* 0x10E4 */
	uint8_t RESERVED60[0x10E8u-0x10E4u];

	/* 0x10E8: clicintip  Register */
	uint32_t volatile CLICINTIP_58;
	/* IP */
#define ECLIC_CLICINTIP_58_IP					0u

	/* 0x10E8 */
	uint8_t RESERVED61[0x10ECu-0x10E8u];

	/* 0x10EC: clicintip  Register */
	uint32_t volatile CLICINTIP_59;
	/* IP */
#define ECLIC_CLICINTIP_59_IP					0u

	/* 0x10EC */
	uint8_t RESERVED62[0x10F0u-0x10ECu];

	/* 0x10F0: clicintip  Register */
	uint32_t volatile CLICINTIP_60;
	/* IP */
#define ECLIC_CLICINTIP_60_IP					0u

