josuah/mcu-gd32vf103/registers.h
	/* 0x10F0 */
	uint8_t RESERVED63[0x10F4u-0x10F0u];

	/* 0x10F4: clicintip  Register */
	uint32_t volatile CLICINTIP_61;
	/* IP */
#define ECLIC_CLICINTIP_61_IP					0u

	/* 0x10F4 */
	uint8_t RESERVED64[0x10F8u-0x10F4u];

	/* 0x10F8: clicintip  Register */
	uint32_t volatile CLICINTIP_62;
	/* IP */
#define ECLIC_CLICINTIP_62_IP					0u

	/* 0x10F8 */
	uint8_t RESERVED65[0x10FCu-0x10F8u];

	/* 0x10FC: clicintip  Register */
	uint32_t volatile CLICINTIP_63;
	/* IP */
#define ECLIC_CLICINTIP_63_IP					0u

	/* 0x10FC */
	uint8_t RESERVED66[0x1100u-0x10FCu];

	/* 0x1100: clicintip  Register */
	uint32_t volatile CLICINTIP_64;
	/* IP */
#define ECLIC_CLICINTIP_64_IP					0u

	/* 0x1100 */
	uint8_t RESERVED67[0x1104u-0x1100u];

	/* 0x1104: clicintip  Register */
	uint32_t volatile CLICINTIP_65;
	/* IP */
#define ECLIC_CLICINTIP_65_IP					0u

	/* 0x1104 */
	uint8_t RESERVED68[0x1108u-0x1104u];

	/* 0x1108: clicintip  Register */
	uint32_t volatile CLICINTIP_66;
	/* IP */
#define ECLIC_CLICINTIP_66_IP					0u

	/* 0x1108 */
	uint8_t RESERVED69[0x110Cu-0x1108u];

	/* 0x110C: clicintip  Register */
	uint32_t volatile CLICINTIP_67;
	/* IP */
#define ECLIC_CLICINTIP_67_IP					0u

	/* 0x110C */
	uint8_t RESERVED70[0x1110u-0x110Cu];

	/* 0x1110: clicintip  Register */
	uint32_t volatile CLICINTIP_68;
	/* IP */
#define ECLIC_CLICINTIP_68_IP					0u

	/* 0x1110 */
	uint8_t RESERVED71[0x1114u-0x1110u];

	/* 0x1114: clicintip  Register */
	uint32_t volatile CLICINTIP_69;
	/* IP */
#define ECLIC_CLICINTIP_69_IP					0u

	/* 0x1114 */
	uint8_t RESERVED72[0x1118u-0x1114u];

	/* 0x1118: clicintip  Register */
	uint32_t volatile CLICINTIP_70;
	/* IP */
#define ECLIC_CLICINTIP_70_IP					0u

	/* 0x1118 */
	uint8_t RESERVED73[0x111Cu-0x1118u];

	/* 0x111C: clicintip  Register */
	uint32_t volatile CLICINTIP_71;
	/* IP */
#define ECLIC_CLICINTIP_71_IP					0u

	/* 0x111C */
	uint8_t RESERVED74[0x1120u-0x111Cu];

	/* 0x1120: clicintip  Register */
	uint32_t volatile CLICINTIP_72;
	/* IP */
#define ECLIC_CLICINTIP_72_IP					0u

	/* 0x1120 */
	uint8_t RESERVED75[0x1124u-0x1120u];

	/* 0x1124: clicintip  Register */
	uint32_t volatile CLICINTIP_73;
	/* IP */
#define ECLIC_CLICINTIP_73_IP					0u

	/* 0x1124 */
	uint8_t RESERVED76[0x1128u-0x1124u];

	/* 0x1128: clicintip  Register */
	uint32_t volatile CLICINTIP_74;
	/* IP */
#define ECLIC_CLICINTIP_74_IP					0u

	/* 0x1128 */
	uint8_t RESERVED77[0x112Cu-0x1128u];

	/* 0x112C: clicintip  Register */
	uint32_t volatile CLICINTIP_75;
	/* IP */
#define ECLIC_CLICINTIP_75_IP					0u

	/* 0x112C */
	uint8_t RESERVED78[0x1130u-0x112Cu];

	/* 0x1130: clicintip  Register */
	uint32_t volatile CLICINTIP_76;
	/* IP */
#define ECLIC_CLICINTIP_76_IP					0u

	/* 0x1130 */
	uint8_t RESERVED79[0x1134u-0x1130u];

	/* 0x1134: clicintip  Register */
	uint32_t volatile CLICINTIP_77;
	/* IP */
#define ECLIC_CLICINTIP_77_IP					0u

	/* 0x1134 */
	uint8_t RESERVED80[0x1138u-0x1134u];

	/* 0x1138: clicintip  Register */
	uint32_t volatile CLICINTIP_78;
	/* IP */
#define ECLIC_CLICINTIP_78_IP					0u

	/* 0x1138 */
	uint8_t RESERVED81[0x113Cu-0x1138u];

	/* 0x113C: clicintip  Register */
	uint32_t volatile CLICINTIP_79;
	/* IP */
#define ECLIC_CLICINTIP_79_IP					0u

	/* 0x113C */
	uint8_t RESERVED82[0x1140u-0x113Cu];

	/* 0x1140: clicintip  Register */
	uint32_t volatile CLICINTIP_80;
	/* IP */
#define ECLIC_CLICINTIP_80_IP					0u

	/* 0x1140 */
	uint8_t RESERVED83[0x1144u-0x1140u];

	/* 0x1144: clicintip  Register */
	uint32_t volatile CLICINTIP_81;
	/* IP */
#define ECLIC_CLICINTIP_81_IP					0u

	/* 0x1144 */
	uint8_t RESERVED84[0x1148u-0x1144u];

	/* 0x1148: clicintip  Register */
	uint32_t volatile CLICINTIP_82;
	/* IP */
#define ECLIC_CLICINTIP_82_IP					0u

	/* 0x1148 */
	uint8_t RESERVED85[0x114Cu-0x1148u];

	/* 0x114C: clicintip  Register */
	uint32_t volatile CLICINTIP_83;
	/* IP */
#define ECLIC_CLICINTIP_83_IP					0u

	/* 0x114C */
	uint8_t RESERVED86[0x1150u-0x114Cu];

	/* 0x1150: clicintip  Register */
	uint32_t volatile CLICINTIP_84;
	/* IP */
#define ECLIC_CLICINTIP_84_IP					0u

	/* 0x1150 */
	uint8_t RESERVED87[0x1158u-0x1150u];

	/* 0x1158: clicintip  Register */
	uint32_t volatile CLICINTIP_85;
	/* IP */
#define ECLIC_CLICINTIP_85_IP					0u

	/* 0x1158 */
	uint8_t RESERVED88[0x115Cu-0x1158u];

	/* 0x115C: clicintip  Register */
	uint32_t volatile CLICINTIP_86;
	/* IP */
#define ECLIC_CLICINTIP_86_IP					0u

	/* 0x1001: clicintie Register */
	uint32_t volatile CLICINTIE_0;
	/* IE */
#define ECLIC_CLICINTIE_0_IE					0u

	/* 0x1001 */
	uint8_t RESERVED89[0x1005u-0x1001u];

	/* 0x1005: clicintie Register */
	uint32_t volatile CLICINTIE_1;
	/* IE */
#define ECLIC_CLICINTIE_1_IE					0u

	/* 0x1005 */
	uint8_t RESERVED90[0x1009u-0x1005u];

	/* 0x1009: clicintie Register */
	uint32_t volatile CLICINTIE_2;
	/* IE */
#define ECLIC_CLICINTIE_2_IE					0u

	/* 0x1009 */
	uint8_t RESERVED91[0x100Du-0x1009u];

	/* 0x100D: clicintie Register */
	uint32_t volatile CLICINTIE_3;
	/* IE */
#define ECLIC_CLICINTIE_3_IE					0u

	/* 0x100D */
	uint8_t RESERVED92[0x1011u-0x100Du];

	/* 0x1011: clicintie Register */
	uint32_t volatile CLICINTIE_4;
	/* IE */
#define ECLIC_CLICINTIE_4_IE					0u

	/* 0x1011 */
	uint8_t RESERVED93[0x1015u-0x1011u];

	/* 0x1015: clicintie Register */
	uint32_t volatile CLICINTIE_5;
	/* IE */
#define ECLIC_CLICINTIE_5_IE					0u

	/* 0x1015 */
	uint8_t RESERVED94[0x1019u-0x1015u];

	/* 0x1019: clicintie Register */
	uint32_t volatile CLICINTIE_6;
	/* IE */
#define ECLIC_CLICINTIE_6_IE					0u

	/* 0x1019 */
	uint8_t RESERVED95[0x101Du-0x1019u];

	/* 0x101D: clicintie Register */
	uint32_t volatile CLICINTIE_7;
	/* IE */
#define ECLIC_CLICINTIE_7_IE					0u

	/* 0x101D */
	uint8_t RESERVED96[0x1021u-0x101Du];

	/* 0x1021: clicintie Register */
	uint32_t volatile CLICINTIE_8;
	/* IE */
#define ECLIC_CLICINTIE_8_IE					0u

	/* 0x1021 */
	uint8_t RESERVED97[0x1025u-0x1021u];

	/* 0x1025: clicintie Register */
	uint32_t volatile CLICINTIE_9;
	/* IE */
#define ECLIC_CLICINTIE_9_IE					0u

	/* 0x1025 */
	uint8_t RESERVED98[0x1029u-0x1025u];

