josuah/mcu-gd32vf103/registers.h
	/* 0x1029: clicintie Register */
	uint32_t volatile CLICINTIE_10;
	/* IE */
#define ECLIC_CLICINTIE_10_IE					0u

	/* 0x1029 */
	uint8_t RESERVED99[0x102Du-0x1029u];

	/* 0x102D: clicintie Register */
	uint32_t volatile CLICINTIE_11;
	/* IE */
#define ECLIC_CLICINTIE_11_IE					0u

	/* 0x102D */
	uint8_t RESERVED100[0x1031u-0x102Du];

	/* 0x1031: clicintie Register */
	uint32_t volatile CLICINTIE_12;
	/* IE */
#define ECLIC_CLICINTIE_12_IE					0u

	/* 0x1031 */
	uint8_t RESERVED101[0x1035u-0x1031u];

	/* 0x1035: clicintie Register */
	uint32_t volatile CLICINTIE_13;
	/* IE */
#define ECLIC_CLICINTIE_13_IE					0u

	/* 0x1035 */
	uint8_t RESERVED102[0x1039u-0x1035u];

	/* 0x1039: clicintie Register */
	uint32_t volatile CLICINTIE_14;
	/* IE */
#define ECLIC_CLICINTIE_14_IE					0u

	/* 0x1039 */
	uint8_t RESERVED103[0x103Du-0x1039u];

	/* 0x103D: clicintie Register */
	uint32_t volatile CLICINTIE_15;
	/* IE */
#define ECLIC_CLICINTIE_15_IE					0u

	/* 0x103D */
	uint8_t RESERVED104[0x1041u-0x103Du];

	/* 0x1041: clicintie Register */
	uint32_t volatile CLICINTIE_16;
	/* IE */
#define ECLIC_CLICINTIE_16_IE					0u

	/* 0x1041 */
	uint8_t RESERVED105[0x1045u-0x1041u];

	/* 0x1045: clicintie Register */
	uint32_t volatile CLICINTIE_17;
	/* IE */
#define ECLIC_CLICINTIE_17_IE					0u

	/* 0x1045 */
	uint8_t RESERVED106[0x1049u-0x1045u];

	/* 0x1049: clicintie Register */
	uint32_t volatile CLICINTIE_18;
	/* IE */
#define ECLIC_CLICINTIE_18_IE					0u

	/* 0x1049 */
	uint8_t RESERVED107[0x104Du-0x1049u];

	/* 0x104D: clicintie Register */
	uint32_t volatile CLICINTIE_19;
	/* IE */
#define ECLIC_CLICINTIE_19_IE					0u

	/* 0x104D */
	uint8_t RESERVED108[0x1051u-0x104Du];

	/* 0x1051: clicintie Register */
	uint32_t volatile CLICINTIE_20;
	/* IE */
#define ECLIC_CLICINTIE_20_IE					0u

	/* 0x1051 */
	uint8_t RESERVED109[0x1055u-0x1051u];

	/* 0x1055: clicintie Register */
	uint32_t volatile CLICINTIE_21;
	/* IE */
#define ECLIC_CLICINTIE_21_IE					0u

	/* 0x1055 */
	uint8_t RESERVED110[0x1059u-0x1055u];

	/* 0x1059: clicintie Register */
	uint32_t volatile CLICINTIE_22;
	/* IE */
#define ECLIC_CLICINTIE_22_IE					0u

	/* 0x1059 */
	uint8_t RESERVED111[0x105Du-0x1059u];

	/* 0x105D: clicintie Register */
	uint32_t volatile CLICINTIE_23;
	/* IE */
#define ECLIC_CLICINTIE_23_IE					0u

	/* 0x105D */
	uint8_t RESERVED112[0x1061u-0x105Du];

	/* 0x1061: clicintie Register */
	uint32_t volatile CLICINTIE_24;
	/* IE */
#define ECLIC_CLICINTIE_24_IE					0u

	/* 0x1061 */
	uint8_t RESERVED113[0x1065u-0x1061u];

	/* 0x1065: clicintie Register */
	uint32_t volatile CLICINTIE_25;
	/* IE */
#define ECLIC_CLICINTIE_25_IE					0u

	/* 0x1065 */
	uint8_t RESERVED114[0x1069u-0x1065u];

	/* 0x1069: clicintie Register */
	uint32_t volatile CLICINTIE_26;
	/* IE */
#define ECLIC_CLICINTIE_26_IE					0u

	/* 0x1069 */
	uint8_t RESERVED115[0x106Du-0x1069u];

	/* 0x106D: clicintie Register */
	uint32_t volatile CLICINTIE_27;
	/* IE */
#define ECLIC_CLICINTIE_27_IE					0u

	/* 0x106D */
	uint8_t RESERVED116[0x1071u-0x106Du];

	/* 0x1071: clicintie Register */
	uint32_t volatile CLICINTIE_28;
	/* IE */
#define ECLIC_CLICINTIE_28_IE					0u

	/* 0x1071 */
	uint8_t RESERVED117[0x1075u-0x1071u];

	/* 0x1075: clicintie Register */
	uint32_t volatile CLICINTIE_29;
	/* IE */
#define ECLIC_CLICINTIE_29_IE					0u

	/* 0x1075 */
	uint8_t RESERVED118[0x1079u-0x1075u];

	/* 0x1079: clicintie Register */
	uint32_t volatile CLICINTIE_30;
	/* IE */
#define ECLIC_CLICINTIE_30_IE					0u

	/* 0x1079 */
	uint8_t RESERVED119[0x107Du-0x1079u];

	/* 0x107D: clicintie Register */
	uint32_t volatile CLICINTIE_31;
	/* IE */
#define ECLIC_CLICINTIE_31_IE					0u

	/* 0x107D */
	uint8_t RESERVED120[0x1081u-0x107Du];

	/* 0x1081: clicintie Register */
	uint32_t volatile CLICINTIE_32;
	/* IE */
#define ECLIC_CLICINTIE_32_IE					0u

	/* 0x1081 */
	uint8_t RESERVED121[0x1085u-0x1081u];

	/* 0x1085: clicintie Register */
	uint32_t volatile CLICINTIE_33;
	/* IE */
#define ECLIC_CLICINTIE_33_IE					0u

	/* 0x1085 */
	uint8_t RESERVED122[0x1089u-0x1085u];

	/* 0x1089: clicintie Register */
	uint32_t volatile CLICINTIE_34;
	/* IE */
#define ECLIC_CLICINTIE_34_IE					0u

	/* 0x1089 */
	uint8_t RESERVED123[0x108Du-0x1089u];

	/* 0x108D: clicintie Register */
	uint32_t volatile CLICINTIE_35;
	/* IE */
#define ECLIC_CLICINTIE_35_IE					0u

	/* 0x108D */
	uint8_t RESERVED124[0x1091u-0x108Du];

	/* 0x1091: clicintie Register */
	uint32_t volatile CLICINTIE_36;
	/* IE */
#define ECLIC_CLICINTIE_36_IE					0u

	/* 0x1091 */
	uint8_t RESERVED125[0x1095u-0x1091u];

	/* 0x1095: clicintie Register */
	uint32_t volatile CLICINTIE_37;
	/* IE */
#define ECLIC_CLICINTIE_37_IE					0u

	/* 0x1095 */
	uint8_t RESERVED126[0x1099u-0x1095u];

	/* 0x1099: clicintie Register */
	uint32_t volatile CLICINTIE_38;
	/* IE */
#define ECLIC_CLICINTIE_38_IE					0u

	/* 0x1099 */
	uint8_t RESERVED127[0x109Du-0x1099u];

	/* 0x109D: clicintie Register */
	uint32_t volatile CLICINTIE_39;
	/* IE */
#define ECLIC_CLICINTIE_39_IE					0u

	/* 0x109D */
	uint8_t RESERVED128[0x10A1u-0x109Du];

	/* 0x10A1: clicintie Register */
	uint32_t volatile CLICINTIE_40;
	/* IE */
#define ECLIC_CLICINTIE_40_IE					0u

	/* 0x10A1 */
	uint8_t RESERVED129[0x10A5u-0x10A1u];

	/* 0x10A5: clicintie Register */
	uint32_t volatile CLICINTIE_41;
	/* IE */
#define ECLIC_CLICINTIE_41_IE					0u

	/* 0x10A5 */
	uint8_t RESERVED130[0x10A9u-0x10A5u];

	/* 0x10A9: clicintie Register */
	uint32_t volatile CLICINTIE_42;
	/* IE */
#define ECLIC_CLICINTIE_42_IE					0u

	/* 0x10A9 */
	uint8_t RESERVED131[0x10ADu-0x10A9u];

	/* 0x10AD: clicintie Register */
	uint32_t volatile CLICINTIE_43;
	/* IE */
#define ECLIC_CLICINTIE_43_IE					0u

	/* 0x10AD */
	uint8_t RESERVED132[0x10B1u-0x10ADu];

	/* 0x10B1: clicintie Register */
	uint32_t volatile CLICINTIE_44;
	/* IE */
#define ECLIC_CLICINTIE_44_IE					0u

	/* 0x10B1 */
	uint8_t RESERVED133[0x10B5u-0x10B1u];

	/* 0x10B5: clicintie Register */
	uint32_t volatile CLICINTIE_45;
	/* IE */
#define ECLIC_CLICINTIE_45_IE					0u

	/* 0x10B5 */
	uint8_t RESERVED134[0x10B9u-0x10B5u];

	/* 0x10B9: clicintie Register */
	uint32_t volatile CLICINTIE_46;
	/* IE */
#define ECLIC_CLICINTIE_46_IE					0u

	/* 0x10B9 */
	uint8_t RESERVED135[0x10BDu-0x10B9u];

	/* 0x10BD: clicintie Register */
	uint32_t volatile CLICINTIE_47;
	/* IE */
#define ECLIC_CLICINTIE_47_IE					0u

	/* 0x10BD */
	uint8_t RESERVED136[0x10C1u-0x10BDu];

	/* 0x10C1: clicintie Register */
	uint32_t volatile CLICINTIE_48;
	/* IE */
#define ECLIC_CLICINTIE_48_IE					0u

	/* 0x10C1 */
	uint8_t RESERVED137[0x10C5u-0x10C1u];

