josuah/mcu-gd32vf103/registers.h
	/* 0x10C5: clicintie Register */
	uint32_t volatile CLICINTIE_49;
	/* IE */
#define ECLIC_CLICINTIE_49_IE					0u

	/* 0x10C5 */
	uint8_t RESERVED138[0x10C9u-0x10C5u];

	/* 0x10C9: clicintie Register */
	uint32_t volatile CLICINTIE_50;
	/* IE */
#define ECLIC_CLICINTIE_50_IE					0u

	/* 0x10C9 */
	uint8_t RESERVED139[0x10CDu-0x10C9u];

	/* 0x10CD: clicintie Register */
	uint32_t volatile CLICINTIE_51;
	/* IE */
#define ECLIC_CLICINTIE_51_IE					0u

	/* 0x10CD */
	uint8_t RESERVED140[0x10D1u-0x10CDu];

	/* 0x10D1: clicintie Register */
	uint32_t volatile CLICINTIE_52;
	/* IE */
#define ECLIC_CLICINTIE_52_IE					0u

	/* 0x10D1 */
	uint8_t RESERVED141[0x10D5u-0x10D1u];

	/* 0x10D5: clicintie Register */
	uint32_t volatile CLICINTIE_53;
	/* IE */
#define ECLIC_CLICINTIE_53_IE					0u

	/* 0x10D5 */
	uint8_t RESERVED142[0x10D9u-0x10D5u];

	/* 0x10D9: clicintie Register */
	uint32_t volatile CLICINTIE_54;
	/* IE */
#define ECLIC_CLICINTIE_54_IE					0u

	/* 0x10D9 */
	uint8_t RESERVED143[0x10DDu-0x10D9u];

	/* 0x10DD: clicintie Register */
	uint32_t volatile CLICINTIE_55;
	/* IE */
#define ECLIC_CLICINTIE_55_IE					0u

	/* 0x10DD */
	uint8_t RESERVED144[0x10E1u-0x10DDu];

	/* 0x10E1: clicintie Register */
	uint32_t volatile CLICINTIE_56;
	/* IE */
#define ECLIC_CLICINTIE_56_IE					0u

	/* 0x10E1 */
	uint8_t RESERVED145[0x10E5u-0x10E1u];

	/* 0x10E5: clicintie Register */
	uint32_t volatile CLICINTIE_57;
	/* IE */
#define ECLIC_CLICINTIE_57_IE					0u

	/* 0x10E5 */
	uint8_t RESERVED146[0x10E9u-0x10E5u];

	/* 0x10E9: clicintie Register */
	uint32_t volatile CLICINTIE_58;
	/* IE */
#define ECLIC_CLICINTIE_58_IE					0u

	/* 0x10E9 */
	uint8_t RESERVED147[0x10EDu-0x10E9u];

	/* 0x10ED: clicintie Register */
	uint32_t volatile CLICINTIE_59;
	/* IE */
#define ECLIC_CLICINTIE_59_IE					0u

	/* 0x10ED */
	uint8_t RESERVED148[0x10F1u-0x10EDu];

	/* 0x10F1: clicintie Register */
	uint32_t volatile CLICINTIE_60;
	/* IE */
#define ECLIC_CLICINTIE_60_IE					0u

	/* 0x10F1 */
	uint8_t RESERVED149[0x10F5u-0x10F1u];

	/* 0x10F5: clicintie Register */
	uint32_t volatile CLICINTIE_61;
	/* IE */
#define ECLIC_CLICINTIE_61_IE					0u

	/* 0x10F5 */
	uint8_t RESERVED150[0x10F9u-0x10F5u];

	/* 0x10F9: clicintie Register */
	uint32_t volatile CLICINTIE_62;
	/* IE */
#define ECLIC_CLICINTIE_62_IE					0u

	/* 0x10F9 */
	uint8_t RESERVED151[0x10FDu-0x10F9u];

	/* 0x10FD: clicintie Register */
	uint32_t volatile CLICINTIE_63;
	/* IE */
#define ECLIC_CLICINTIE_63_IE					0u

	/* 0x10FD */
	uint8_t RESERVED152[0x1101u-0x10FDu];

	/* 0x1101: clicintie Register */
	uint32_t volatile CLICINTIE_64;
	/* IE */
#define ECLIC_CLICINTIE_64_IE					0u

	/* 0x1101 */
	uint8_t RESERVED153[0x1105u-0x1101u];

	/* 0x1105: clicintie Register */
	uint32_t volatile CLICINTIE_65;
	/* IE */
#define ECLIC_CLICINTIE_65_IE					0u

	/* 0x1105 */
	uint8_t RESERVED154[0x1109u-0x1105u];

	/* 0x1109: clicintie Register */
	uint32_t volatile CLICINTIE_66;
	/* IE */
#define ECLIC_CLICINTIE_66_IE					0u

	/* 0x1109 */
	uint8_t RESERVED155[0x110Du-0x1109u];

	/* 0x110D: clicintie Register */
	uint32_t volatile CLICINTIE_67;
	/* IE */
#define ECLIC_CLICINTIE_67_IE					0u

	/* 0x110D */
	uint8_t RESERVED156[0x1111u-0x110Du];

	/* 0x1111: clicintie Register */
	uint32_t volatile CLICINTIE_68;
	/* IE */
#define ECLIC_CLICINTIE_68_IE					0u

	/* 0x1111 */
	uint8_t RESERVED157[0x1115u-0x1111u];

	/* 0x1115: clicintie Register */
	uint32_t volatile CLICINTIE_69;
	/* IE */
#define ECLIC_CLICINTIE_69_IE					0u

	/* 0x1115 */
	uint8_t RESERVED158[0x1119u-0x1115u];

	/* 0x1119: clicintie Register */
	uint32_t volatile CLICINTIE_70;
	/* IE */
#define ECLIC_CLICINTIE_70_IE					0u

	/* 0x1119 */
	uint8_t RESERVED159[0x111Du-0x1119u];

	/* 0x111D: clicintie Register */
	uint32_t volatile CLICINTIE_71;
	/* IE */
#define ECLIC_CLICINTIE_71_IE					0u

	/* 0x111D */
	uint8_t RESERVED160[0x1121u-0x111Du];

	/* 0x1121: clicintie Register */
	uint32_t volatile CLICINTIE_72;
	/* IE */
#define ECLIC_CLICINTIE_72_IE					0u

	/* 0x1121 */
	uint8_t RESERVED161[0x1125u-0x1121u];

	/* 0x1125: clicintie Register */
	uint32_t volatile CLICINTIE_73;
	/* IE */
#define ECLIC_CLICINTIE_73_IE					0u

	/* 0x1125 */
	uint8_t RESERVED162[0x1129u-0x1125u];

	/* 0x1129: clicintie Register */
	uint32_t volatile CLICINTIE_74;
	/* IE */
#define ECLIC_CLICINTIE_74_IE					0u

	/* 0x1129 */
	uint8_t RESERVED163[0x112Du-0x1129u];

	/* 0x112D: clicintie Register */
	uint32_t volatile CLICINTIE_75;
	/* IE */
#define ECLIC_CLICINTIE_75_IE					0u

	/* 0x112D */
	uint8_t RESERVED164[0x1131u-0x112Du];

	/* 0x1131: clicintie Register */
	uint32_t volatile CLICINTIE_76;
	/* IE */
#define ECLIC_CLICINTIE_76_IE					0u

	/* 0x1131 */
	uint8_t RESERVED165[0x1135u-0x1131u];

	/* 0x1135: clicintie Register */
	uint32_t volatile CLICINTIE_77;
	/* IE */
#define ECLIC_CLICINTIE_77_IE					0u

	/* 0x1135 */
	uint8_t RESERVED166[0x1139u-0x1135u];

	/* 0x1139: clicintie Register */
	uint32_t volatile CLICINTIE_78;
	/* IE */
#define ECLIC_CLICINTIE_78_IE					0u

	/* 0x1139 */
	uint8_t RESERVED167[0x113Du-0x1139u];

	/* 0x113D: clicintie Register */
	uint32_t volatile CLICINTIE_79;
	/* IE */
#define ECLIC_CLICINTIE_79_IE					0u

	/* 0x113D */
	uint8_t RESERVED168[0x1141u-0x113Du];

	/* 0x1141: clicintie Register */
	uint32_t volatile CLICINTIE_80;
	/* IE */
#define ECLIC_CLICINTIE_80_IE					0u

	/* 0x1141 */
	uint8_t RESERVED169[0x1145u-0x1141u];

	/* 0x1145: clicintie Register */
	uint32_t volatile CLICINTIE_81;
	/* IE */
#define ECLIC_CLICINTIE_81_IE					0u

	/* 0x1145 */
	uint8_t RESERVED170[0x1149u-0x1145u];

	/* 0x1149: clicintie Register */
	uint32_t volatile CLICINTIE_82;
	/* IE */
#define ECLIC_CLICINTIE_82_IE					0u

	/* 0x1149 */
	uint8_t RESERVED171[0x114Du-0x1149u];

	/* 0x114D: clicintie Register */
	uint32_t volatile CLICINTIE_83;
	/* IE */
#define ECLIC_CLICINTIE_83_IE					0u

	/* 0x114D */
	uint8_t RESERVED172[0x1151u-0x114Du];

	/* 0x1151: clicintie Register */
	uint32_t volatile CLICINTIE_84;
	/* IE */
#define ECLIC_CLICINTIE_84_IE					0u

	/* 0x1151 */
	uint8_t RESERVED173[0x1155u-0x1151u];

	/* 0x1155: clicintie Register */
	uint32_t volatile CLICINTIE_85;
	/* IE */
#define ECLIC_CLICINTIE_85_IE					0u

