josuah/mcu-gd32vf103/registers.h
	/* 0x1155 */
	uint8_t RESERVED174[0x1159u-0x1155u];

	/* 0x1159: clicintie Register */
	uint32_t volatile CLICINTIE_86;
	/* IE */
#define ECLIC_CLICINTIE_86_IE					0u

	/* 0x1002: clicintattr Register */
	uint32_t volatile CLICINTATTR_0;
	/* SHV */
#define ECLIC_CLICINTATTR_0_SHV					0u
	/* TRIG */
#define ECLIC_CLICINTATTR_0_TRIG_msb				1u
#define ECLIC_CLICINTATTR_0_TRIG_lsb				2u

	/* 0x1002 */
	uint8_t RESERVED175[0x1006u-0x1002u];

	/* 0x1006: clicintattr Register */
	uint32_t volatile CLICINTATTR_1;
	/* SHV */
#define ECLIC_CLICINTATTR_1_SHV					0u
	/* TRIG */
#define ECLIC_CLICINTATTR_1_TRIG_msb				1u
#define ECLIC_CLICINTATTR_1_TRIG_lsb				2u

	/* 0x1006 */
	uint8_t RESERVED176[0x100Au-0x1006u];

	/* 0x100A: clicintattr Register */
	uint32_t volatile CLICINTATTR_2;
	/* SHV */
#define ECLIC_CLICINTATTR_2_SHV					0u
	/* TRIG */
#define ECLIC_CLICINTATTR_2_TRIG_msb				1u
#define ECLIC_CLICINTATTR_2_TRIG_lsb				2u

	/* 0x100A */
	uint8_t RESERVED177[0x100Eu-0x100Au];

	/* 0x100E: clicintattr Register */
	uint32_t volatile CLICINTATTR_3;
	/* SHV */
#define ECLIC_CLICINTATTR_3_SHV					0u
	/* TRIG */
#define ECLIC_CLICINTATTR_3_TRIG_msb				1u
#define ECLIC_CLICINTATTR_3_TRIG_lsb				2u

	/* 0x100E */
	uint8_t RESERVED178[0x1012u-0x100Eu];

	/* 0x1012: clicintattr Register */
	uint32_t volatile CLICINTATTR_4;
	/* SHV */
#define ECLIC_CLICINTATTR_4_SHV					0u
	/* TRIG */
#define ECLIC_CLICINTATTR_4_TRIG_msb				1u
#define ECLIC_CLICINTATTR_4_TRIG_lsb				2u

	/* 0x1012 */
	uint8_t RESERVED179[0x1016u-0x1012u];

	/* 0x1016: clicintattr Register */
	uint32_t volatile CLICINTATTR_5;
	/* SHV */
#define ECLIC_CLICINTATTR_5_SHV					0u
	/* TRIG */
#define ECLIC_CLICINTATTR_5_TRIG_msb				1u
#define ECLIC_CLICINTATTR_5_TRIG_lsb				2u

	/* 0x1016 */
	uint8_t RESERVED180[0x101Au-0x1016u];

	/* 0x101A: clicintattr Register */
	uint32_t volatile CLICINTATTR_6;
	/* SHV */
#define ECLIC_CLICINTATTR_6_SHV					0u
	/* TRIG */
#define ECLIC_CLICINTATTR_6_TRIG_msb				1u
#define ECLIC_CLICINTATTR_6_TRIG_lsb				2u

	/* 0x101A */
	uint8_t RESERVED181[0x101Eu-0x101Au];

	/* 0x101E: clicintattr Register */
	uint32_t volatile CLICINTATTR_7;
	/* SHV */
#define ECLIC_CLICINTATTR_7_SHV					0u
	/* TRIG */
#define ECLIC_CLICINTATTR_7_TRIG_msb				1u
#define ECLIC_CLICINTATTR_7_TRIG_lsb				2u

	/* 0x101E */
	uint8_t RESERVED182[0x1022u-0x101Eu];

	/* 0x1022: clicintattr Register */
	uint32_t volatile CLICINTATTR_8;
	/* SHV */
#define ECLIC_CLICINTATTR_8_SHV					0u
	/* TRIG */
#define ECLIC_CLICINTATTR_8_TRIG_msb				1u
#define ECLIC_CLICINTATTR_8_TRIG_lsb				2u

	/* 0x1022 */
	uint8_t RESERVED183[0x1026u-0x1022u];

	/* 0x1026: clicintattr Register */
	uint32_t volatile CLICINTATTR_9;
	/* SHV */
#define ECLIC_CLICINTATTR_9_SHV					0u
	/* TRIG */
#define ECLIC_CLICINTATTR_9_TRIG_msb				1u
#define ECLIC_CLICINTATTR_9_TRIG_lsb				2u

	/* 0x1026 */
	uint8_t RESERVED184[0x102Au-0x1026u];

	/* 0x102A: clicintattr Register */
	uint32_t volatile CLICINTATTR_10;
	/* SHV */
#define ECLIC_CLICINTATTR_10_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_10_TRIG_msb				1u
#define ECLIC_CLICINTATTR_10_TRIG_lsb				2u

	/* 0x102A */
	uint8_t RESERVED185[0x102Eu-0x102Au];

	/* 0x102E: clicintattr Register */
	uint32_t volatile CLICINTATTR_11;
	/* SHV */
#define ECLIC_CLICINTATTR_11_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_11_TRIG_msb				1u
#define ECLIC_CLICINTATTR_11_TRIG_lsb				2u

	/* 0x102E */
	uint8_t RESERVED186[0x1032u-0x102Eu];

	/* 0x1032: clicintattr Register */
	uint32_t volatile CLICINTATTR_12;
	/* SHV */
#define ECLIC_CLICINTATTR_12_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_12_TRIG_msb				1u
#define ECLIC_CLICINTATTR_12_TRIG_lsb				2u

	/* 0x1032 */
	uint8_t RESERVED187[0x1036u-0x1032u];

	/* 0x1036: clicintattr Register */
	uint32_t volatile CLICINTATTR_13;
	/* SHV */
#define ECLIC_CLICINTATTR_13_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_13_TRIG_msb				1u
#define ECLIC_CLICINTATTR_13_TRIG_lsb				2u

	/* 0x1036 */
	uint8_t RESERVED188[0x103Au-0x1036u];

	/* 0x103A: clicintattr Register */
	uint32_t volatile CLICINTATTR_14;
	/* SHV */
#define ECLIC_CLICINTATTR_14_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_14_TRIG_msb				1u
#define ECLIC_CLICINTATTR_14_TRIG_lsb				2u

	/* 0x103A */
	uint8_t RESERVED189[0x103Eu-0x103Au];

	/* 0x103E: clicintattr Register */
	uint32_t volatile CLICINTATTR_15;
	/* SHV */
#define ECLIC_CLICINTATTR_15_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_15_TRIG_msb				1u
#define ECLIC_CLICINTATTR_15_TRIG_lsb				2u

	/* 0x103E */
	uint8_t RESERVED190[0x1042u-0x103Eu];

	/* 0x1042: clicintattr Register */
	uint32_t volatile CLICINTATTR_16;
	/* SHV */
#define ECLIC_CLICINTATTR_16_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_16_TRIG_msb				1u
#define ECLIC_CLICINTATTR_16_TRIG_lsb				2u

	/* 0x1042 */
	uint8_t RESERVED191[0x1046u-0x1042u];

	/* 0x1046: clicintattr Register */
	uint32_t volatile CLICINTATTR_17;
	/* SHV */
#define ECLIC_CLICINTATTR_17_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_17_TRIG_msb				1u
#define ECLIC_CLICINTATTR_17_TRIG_lsb				2u

	/* 0x1046 */
	uint8_t RESERVED192[0x104Au-0x1046u];

	/* 0x104A: clicintattr Register */
	uint32_t volatile CLICINTATTR_18;
	/* SHV */
#define ECLIC_CLICINTATTR_18_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_18_TRIG_msb				1u
#define ECLIC_CLICINTATTR_18_TRIG_lsb				2u

	/* 0x104A */
	uint8_t RESERVED193[0x104Eu-0x104Au];

	/* 0x104E: clicintattr Register */
	uint32_t volatile CLICINTATTR_19;
	/* SHV */
#define ECLIC_CLICINTATTR_19_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_19_TRIG_msb				1u
#define ECLIC_CLICINTATTR_19_TRIG_lsb				2u

	/* 0x104E */
	uint8_t RESERVED194[0x1052u-0x104Eu];

	/* 0x1052: clicintattr Register */
	uint32_t volatile CLICINTATTR_20;
	/* SHV */
#define ECLIC_CLICINTATTR_20_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_20_TRIG_msb				1u
#define ECLIC_CLICINTATTR_20_TRIG_lsb				2u

	/* 0x1052 */
	uint8_t RESERVED195[0x1056u-0x1052u];

	/* 0x1056: clicintattr Register */
	uint32_t volatile CLICINTATTR_21;
	/* SHV */
#define ECLIC_CLICINTATTR_21_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_21_TRIG_msb				1u
#define ECLIC_CLICINTATTR_21_TRIG_lsb				2u

	/* 0x1056 */
	uint8_t RESERVED196[0x105Au-0x1056u];

	/* 0x105A: clicintattr Register */
	uint32_t volatile CLICINTATTR_22;
	/* SHV */
#define ECLIC_CLICINTATTR_22_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_22_TRIG_msb				1u
#define ECLIC_CLICINTATTR_22_TRIG_lsb				2u

	/* 0x105A */
	uint8_t RESERVED197[0x105Eu-0x105Au];

