josuah/mcu-gd32vf103/registers.h
	/* 0x105E: clicintattr Register */
	uint32_t volatile CLICINTATTR_23;
	/* SHV */
#define ECLIC_CLICINTATTR_23_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_23_TRIG_msb				1u
#define ECLIC_CLICINTATTR_23_TRIG_lsb				2u

	/* 0x105E */
	uint8_t RESERVED198[0x1062u-0x105Eu];

	/* 0x1062: clicintattr Register */
	uint32_t volatile CLICINTATTR_24;
	/* SHV */
#define ECLIC_CLICINTATTR_24_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_24_TRIG_msb				1u
#define ECLIC_CLICINTATTR_24_TRIG_lsb				2u

	/* 0x1062 */
	uint8_t RESERVED199[0x1066u-0x1062u];

	/* 0x1066: clicintattr Register */
	uint32_t volatile CLICINTATTR_25;
	/* SHV */
#define ECLIC_CLICINTATTR_25_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_25_TRIG_msb				1u
#define ECLIC_CLICINTATTR_25_TRIG_lsb				2u

	/* 0x1066 */
	uint8_t RESERVED200[0x106Au-0x1066u];

	/* 0x106A: clicintattr Register */
	uint32_t volatile CLICINTATTR_26;
	/* SHV */
#define ECLIC_CLICINTATTR_26_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_26_TRIG_msb				1u
#define ECLIC_CLICINTATTR_26_TRIG_lsb				2u

	/* 0x106A */
	uint8_t RESERVED201[0x106Eu-0x106Au];

	/* 0x106E: clicintattr Register */
	uint32_t volatile CLICINTATTR_27;
	/* SHV */
#define ECLIC_CLICINTATTR_27_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_27_TRIG_msb				1u
#define ECLIC_CLICINTATTR_27_TRIG_lsb				2u

	/* 0x106E */
	uint8_t RESERVED202[0x1072u-0x106Eu];

	/* 0x1072: clicintattr Register */
	uint32_t volatile CLICINTATTR_28;
	/* SHV */
#define ECLIC_CLICINTATTR_28_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_28_TRIG_msb				1u
#define ECLIC_CLICINTATTR_28_TRIG_lsb				2u

	/* 0x1072 */
	uint8_t RESERVED203[0x1076u-0x1072u];

	/* 0x1076: clicintattr Register */
	uint32_t volatile CLICINTATTR_29;
	/* SHV */
#define ECLIC_CLICINTATTR_29_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_29_TRIG_msb				1u
#define ECLIC_CLICINTATTR_29_TRIG_lsb				2u

	/* 0x1076 */
	uint8_t RESERVED204[0x107Au-0x1076u];

	/* 0x107A: clicintattr Register */
	uint32_t volatile CLICINTATTR_30;
	/* SHV */
#define ECLIC_CLICINTATTR_30_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_30_TRIG_msb				1u
#define ECLIC_CLICINTATTR_30_TRIG_lsb				2u

	/* 0x107A */
	uint8_t RESERVED205[0x107Eu-0x107Au];

	/* 0x107E: clicintattr Register */
	uint32_t volatile CLICINTATTR_31;
	/* SHV */
#define ECLIC_CLICINTATTR_31_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_31_TRIG_msb				1u
#define ECLIC_CLICINTATTR_31_TRIG_lsb				2u

	/* 0x107E */
	uint8_t RESERVED206[0x1082u-0x107Eu];

	/* 0x1082: clicintattr Register */
	uint32_t volatile CLICINTATTR_32;
	/* SHV */
#define ECLIC_CLICINTATTR_32_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_32_TRIG_msb				1u
#define ECLIC_CLICINTATTR_32_TRIG_lsb				2u

	/* 0x1082 */
	uint8_t RESERVED207[0x1086u-0x1082u];

	/* 0x1086: clicintattr Register */
	uint32_t volatile CLICINTATTR_33;
	/* SHV */
#define ECLIC_CLICINTATTR_33_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_33_TRIG_msb				1u
#define ECLIC_CLICINTATTR_33_TRIG_lsb				2u

	/* 0x1086 */
	uint8_t RESERVED208[0x108Au-0x1086u];

	/* 0x108A: clicintattr Register */
	uint32_t volatile CLICINTATTR_34;
	/* SHV */
#define ECLIC_CLICINTATTR_34_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_34_TRIG_msb				1u
#define ECLIC_CLICINTATTR_34_TRIG_lsb				2u

	/* 0x108A */
	uint8_t RESERVED209[0x108Eu-0x108Au];

	/* 0x108E: clicintattr Register */
	uint32_t volatile CLICINTATTR_35;
	/* SHV */
#define ECLIC_CLICINTATTR_35_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_35_TRIG_msb				1u
#define ECLIC_CLICINTATTR_35_TRIG_lsb				2u

	/* 0x108E */
	uint8_t RESERVED210[0x1092u-0x108Eu];

	/* 0x1092: clicintattr Register */
	uint32_t volatile CLICINTATTR_36;
	/* SHV */
#define ECLIC_CLICINTATTR_36_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_36_TRIG_msb				1u
#define ECLIC_CLICINTATTR_36_TRIG_lsb				2u

	/* 0x1092 */
	uint8_t RESERVED211[0x1096u-0x1092u];

	/* 0x1096: clicintattr Register */
	uint32_t volatile CLICINTATTR_37;
	/* SHV */
#define ECLIC_CLICINTATTR_37_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_37_TRIG_msb				1u
#define ECLIC_CLICINTATTR_37_TRIG_lsb				2u

	/* 0x1096 */
	uint8_t RESERVED212[0x109Au-0x1096u];

	/* 0x109A: clicintattr Register */
	uint32_t volatile CLICINTATTR_38;
	/* SHV */
#define ECLIC_CLICINTATTR_38_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_38_TRIG_msb				1u
#define ECLIC_CLICINTATTR_38_TRIG_lsb				2u

	/* 0x109A */
	uint8_t RESERVED213[0x109Eu-0x109Au];

	/* 0x109E: clicintattr Register */
	uint32_t volatile CLICINTATTR_39;
	/* SHV */
#define ECLIC_CLICINTATTR_39_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_39_TRIG_msb				1u
#define ECLIC_CLICINTATTR_39_TRIG_lsb				2u

	/* 0x109E */
	uint8_t RESERVED214[0x10A2u-0x109Eu];

	/* 0x10A2: clicintattr Register */
	uint32_t volatile CLICINTATTR_40;
	/* SHV */
#define ECLIC_CLICINTATTR_40_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_40_TRIG_msb				1u
#define ECLIC_CLICINTATTR_40_TRIG_lsb				2u

	/* 0x10A2 */
	uint8_t RESERVED215[0x10A6u-0x10A2u];

	/* 0x10A6: clicintattr Register */
	uint32_t volatile CLICINTATTR_41;
	/* SHV */
#define ECLIC_CLICINTATTR_41_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_41_TRIG_msb				1u
#define ECLIC_CLICINTATTR_41_TRIG_lsb				2u

	/* 0x10A6 */
	uint8_t RESERVED216[0x10AAu-0x10A6u];

	/* 0x10AA: clicintattr Register */
	uint32_t volatile CLICINTATTR_42;
	/* SHV */
#define ECLIC_CLICINTATTR_42_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_42_TRIG_msb				1u
#define ECLIC_CLICINTATTR_42_TRIG_lsb				2u

	/* 0x10AA */
	uint8_t RESERVED217[0x10AEu-0x10AAu];

	/* 0x10AE: clicintattr Register */
	uint32_t volatile CLICINTATTR_43;
	/* SHV */
#define ECLIC_CLICINTATTR_43_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_43_TRIG_msb				1u
#define ECLIC_CLICINTATTR_43_TRIG_lsb				2u

	/* 0x10AE */
	uint8_t RESERVED218[0x10B2u-0x10AEu];

	/* 0x10B2: clicintattr Register */
	uint32_t volatile CLICINTATTR_44;
	/* SHV */
#define ECLIC_CLICINTATTR_44_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_44_TRIG_msb				1u
#define ECLIC_CLICINTATTR_44_TRIG_lsb				2u

	/* 0x10B2 */
	uint8_t RESERVED219[0x10B6u-0x10B2u];

	/* 0x10B6: clicintattr Register */
	uint32_t volatile CLICINTATTR_45;
	/* SHV */
#define ECLIC_CLICINTATTR_45_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_45_TRIG_msb				1u
#define ECLIC_CLICINTATTR_45_TRIG_lsb				2u

