josuah/mcu-gd32vf103/registers.h
	/* 0x10B6 */
	uint8_t RESERVED220[0x10BAu-0x10B6u];

	/* 0x10BA: clicintattr Register */
	uint32_t volatile CLICINTATTR_46;
	/* SHV */
#define ECLIC_CLICINTATTR_46_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_46_TRIG_msb				1u
#define ECLIC_CLICINTATTR_46_TRIG_lsb				2u

	/* 0x10BA */
	uint8_t RESERVED221[0x10BEu-0x10BAu];

	/* 0x10BE: clicintattr Register */
	uint32_t volatile CLICINTATTR_47;
	/* SHV */
#define ECLIC_CLICINTATTR_47_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_47_TRIG_msb				1u
#define ECLIC_CLICINTATTR_47_TRIG_lsb				2u

	/* 0x10BE */
	uint8_t RESERVED222[0x10C2u-0x10BEu];

	/* 0x10C2: clicintattr Register */
	uint32_t volatile CLICINTATTR_48;
	/* SHV */
#define ECLIC_CLICINTATTR_48_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_48_TRIG_msb				1u
#define ECLIC_CLICINTATTR_48_TRIG_lsb				2u

	/* 0x10C2 */
	uint8_t RESERVED223[0x10C6u-0x10C2u];

	/* 0x10C6: clicintattr Register */
	uint32_t volatile CLICINTATTR_49;
	/* SHV */
#define ECLIC_CLICINTATTR_49_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_49_TRIG_msb				1u
#define ECLIC_CLICINTATTR_49_TRIG_lsb				2u

	/* 0x10C6 */
	uint8_t RESERVED224[0x10CAu-0x10C6u];

	/* 0x10CA: clicintattr Register */
	uint32_t volatile CLICINTATTR_50;
	/* SHV */
#define ECLIC_CLICINTATTR_50_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_50_TRIG_msb				1u
#define ECLIC_CLICINTATTR_50_TRIG_lsb				2u

	/* 0x10CA */
	uint8_t RESERVED225[0x10CEu-0x10CAu];

	/* 0x10CE: clicintattr Register */
	uint32_t volatile CLICINTATTR_51;
	/* SHV */
#define ECLIC_CLICINTATTR_51_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_51_TRIG_msb				1u
#define ECLIC_CLICINTATTR_51_TRIG_lsb				2u

	/* 0x10CE */
	uint8_t RESERVED226[0x10D2u-0x10CEu];

	/* 0x10D2: clicintattr Register */
	uint32_t volatile CLICINTATTR_52;
	/* SHV */
#define ECLIC_CLICINTATTR_52_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_52_TRIG_msb				1u
#define ECLIC_CLICINTATTR_52_TRIG_lsb				2u

	/* 0x10D2 */
	uint8_t RESERVED227[0x10D6u-0x10D2u];

	/* 0x10D6: clicintattr Register */
	uint32_t volatile CLICINTATTR_53;
	/* SHV */
#define ECLIC_CLICINTATTR_53_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_53_TRIG_msb				1u
#define ECLIC_CLICINTATTR_53_TRIG_lsb				2u

	/* 0x10D6 */
	uint8_t RESERVED228[0x10DAu-0x10D6u];

	/* 0x10DA: clicintattr Register */
	uint32_t volatile CLICINTATTR_54;
	/* SHV */
#define ECLIC_CLICINTATTR_54_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_54_TRIG_msb				1u
#define ECLIC_CLICINTATTR_54_TRIG_lsb				2u

	/* 0x10DA */
	uint8_t RESERVED229[0x10DEu-0x10DAu];

	/* 0x10DE: clicintattr Register */
	uint32_t volatile CLICINTATTR_55;
	/* SHV */
#define ECLIC_CLICINTATTR_55_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_55_TRIG_msb				1u
#define ECLIC_CLICINTATTR_55_TRIG_lsb				2u

	/* 0x10DE */
	uint8_t RESERVED230[0x10E2u-0x10DEu];

	/* 0x10E2: clicintattr Register */
	uint32_t volatile CLICINTATTR_56;
	/* SHV */
#define ECLIC_CLICINTATTR_56_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_56_TRIG_msb				1u
#define ECLIC_CLICINTATTR_56_TRIG_lsb				2u

	/* 0x10E2 */
	uint8_t RESERVED231[0x10E6u-0x10E2u];

	/* 0x10E6: clicintattr Register */
	uint32_t volatile CLICINTATTR_57;
	/* SHV */
#define ECLIC_CLICINTATTR_57_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_57_TRIG_msb				1u
#define ECLIC_CLICINTATTR_57_TRIG_lsb				2u

	/* 0x10E6 */
	uint8_t RESERVED232[0x10EAu-0x10E6u];

	/* 0x10EA: clicintattr Register */
	uint32_t volatile CLICINTATTR_58;
	/* SHV */
#define ECLIC_CLICINTATTR_58_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_58_TRIG_msb				1u
#define ECLIC_CLICINTATTR_58_TRIG_lsb				2u

	/* 0x10EA */
	uint8_t RESERVED233[0x10EEu-0x10EAu];

	/* 0x10EE: clicintattr Register */
	uint32_t volatile CLICINTATTR_59;
	/* SHV */
#define ECLIC_CLICINTATTR_59_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_59_TRIG_msb				1u
#define ECLIC_CLICINTATTR_59_TRIG_lsb				2u

	/* 0x10EE */
	uint8_t RESERVED234[0x10F2u-0x10EEu];

	/* 0x10F2: clicintattr Register */
	uint32_t volatile CLICINTATTR_60;
	/* SHV */
#define ECLIC_CLICINTATTR_60_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_60_TRIG_msb				1u
#define ECLIC_CLICINTATTR_60_TRIG_lsb				2u

	/* 0x10F2 */
	uint8_t RESERVED235[0x10F6u-0x10F2u];

	/* 0x10F6: clicintattr Register */
	uint32_t volatile CLICINTATTR_61;
	/* SHV */
#define ECLIC_CLICINTATTR_61_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_61_TRIG_msb				1u
#define ECLIC_CLICINTATTR_61_TRIG_lsb				2u

	/* 0x10F6 */
	uint8_t RESERVED236[0x10FAu-0x10F6u];

	/* 0x10FA: clicintattr Register */
	uint32_t volatile CLICINTATTR_62;
	/* SHV */
#define ECLIC_CLICINTATTR_62_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_62_TRIG_msb				1u
#define ECLIC_CLICINTATTR_62_TRIG_lsb				2u

	/* 0x10FA */
	uint8_t RESERVED237[0x10FEu-0x10FAu];

	/* 0x10FE: clicintattr Register */
	uint32_t volatile CLICINTATTR_63;
	/* SHV */
#define ECLIC_CLICINTATTR_63_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_63_TRIG_msb				1u
#define ECLIC_CLICINTATTR_63_TRIG_lsb				2u

	/* 0x10FE */
	uint8_t RESERVED238[0x1102u-0x10FEu];

	/* 0x1102: clicintattr Register */
	uint32_t volatile CLICINTATTR_64;
	/* SHV */
#define ECLIC_CLICINTATTR_64_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_64_TRIG_msb				1u
#define ECLIC_CLICINTATTR_64_TRIG_lsb				2u

	/* 0x1102 */
	uint8_t RESERVED239[0x1106u-0x1102u];

	/* 0x1106: clicintattr Register */
	uint32_t volatile CLICINTATTR_65;
	/* SHV */
#define ECLIC_CLICINTATTR_65_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_65_TRIG_msb				1u
#define ECLIC_CLICINTATTR_65_TRIG_lsb				2u

	/* 0x1106 */
	uint8_t RESERVED240[0x110Au-0x1106u];

	/* 0x110A: clicintattr Register */
	uint32_t volatile CLICINTATTR_66;
	/* SHV */
#define ECLIC_CLICINTATTR_66_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_66_TRIG_msb				1u
#define ECLIC_CLICINTATTR_66_TRIG_lsb				2u

	/* 0x110A */
	uint8_t RESERVED241[0x110Eu-0x110Au];

	/* 0x110E: clicintattr Register */
	uint32_t volatile CLICINTATTR_67;
	/* SHV */
#define ECLIC_CLICINTATTR_67_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_67_TRIG_msb				1u
#define ECLIC_CLICINTATTR_67_TRIG_lsb				2u

