josuah/mcu-gd32vf103/registers.h
	/* 0x110E */
	uint8_t RESERVED242[0x1112u-0x110Eu];

	/* 0x1112: clicintattr Register */
	uint32_t volatile CLICINTATTR_68;
	/* SHV */
#define ECLIC_CLICINTATTR_68_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_68_TRIG_msb				1u
#define ECLIC_CLICINTATTR_68_TRIG_lsb				2u

	/* 0x1112 */
	uint8_t RESERVED243[0x1116u-0x1112u];

	/* 0x1116: clicintattr Register */
	uint32_t volatile CLICINTATTR_69;
	/* SHV */
#define ECLIC_CLICINTATTR_69_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_69_TRIG_msb				1u
#define ECLIC_CLICINTATTR_69_TRIG_lsb				2u

	/* 0x1116 */
	uint8_t RESERVED244[0x111Au-0x1116u];

	/* 0x111A: clicintattr Register */
	uint32_t volatile CLICINTATTR_70;
	/* SHV */
#define ECLIC_CLICINTATTR_70_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_70_TRIG_msb				1u
#define ECLIC_CLICINTATTR_70_TRIG_lsb				2u

	/* 0x111A */
	uint8_t RESERVED245[0x111Eu-0x111Au];

	/* 0x111E: clicintattr Register */
	uint32_t volatile CLICINTATTR_71;
	/* SHV */
#define ECLIC_CLICINTATTR_71_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_71_TRIG_msb				1u
#define ECLIC_CLICINTATTR_71_TRIG_lsb				2u

	/* 0x111E */
	uint8_t RESERVED246[0x1122u-0x111Eu];

	/* 0x1122: clicintattr Register */
	uint32_t volatile CLICINTATTR_72;
	/* SHV */
#define ECLIC_CLICINTATTR_72_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_72_TRIG_msb				1u
#define ECLIC_CLICINTATTR_72_TRIG_lsb				2u

	/* 0x1122 */
	uint8_t RESERVED247[0x1126u-0x1122u];

	/* 0x1126: clicintattr Register */
	uint32_t volatile CLICINTATTR_73;
	/* SHV */
#define ECLIC_CLICINTATTR_73_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_73_TRIG_msb				1u
#define ECLIC_CLICINTATTR_73_TRIG_lsb				2u

	/* 0x1126 */
	uint8_t RESERVED248[0x112Au-0x1126u];

	/* 0x112A: clicintattr Register */
	uint32_t volatile CLICINTATTR_74;
	/* SHV */
#define ECLIC_CLICINTATTR_74_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_74_TRIG_msb				1u
#define ECLIC_CLICINTATTR_74_TRIG_lsb				2u

	/* 0x112A */
	uint8_t RESERVED249[0x112Eu-0x112Au];

	/* 0x112E: clicintattr Register */
	uint32_t volatile CLICINTATTR_75;
	/* SHV */
#define ECLIC_CLICINTATTR_75_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_75_TRIG_msb				1u
#define ECLIC_CLICINTATTR_75_TRIG_lsb				2u

	/* 0x112E */
	uint8_t RESERVED250[0x1132u-0x112Eu];

	/* 0x1132: clicintattr Register */
	uint32_t volatile CLICINTATTR_76;
	/* SHV */
#define ECLIC_CLICINTATTR_76_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_76_TRIG_msb				1u
#define ECLIC_CLICINTATTR_76_TRIG_lsb				2u

	/* 0x1132 */
	uint8_t RESERVED251[0x1136u-0x1132u];

	/* 0x1136: clicintattr Register */
	uint32_t volatile CLICINTATTR_77;
	/* SHV */
#define ECLIC_CLICINTATTR_77_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_77_TRIG_msb				1u
#define ECLIC_CLICINTATTR_77_TRIG_lsb				2u

	/* 0x1136 */
	uint8_t RESERVED252[0x113Au-0x1136u];

	/* 0x113A: clicintattr Register */
	uint32_t volatile CLICINTATTR_78;
	/* SHV */
#define ECLIC_CLICINTATTR_78_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_78_TRIG_msb				1u
#define ECLIC_CLICINTATTR_78_TRIG_lsb				2u

	/* 0x113A */
	uint8_t RESERVED253[0x113Eu-0x113Au];

	/* 0x113E: clicintattr Register */
	uint32_t volatile CLICINTATTR_79;
	/* SHV */
#define ECLIC_CLICINTATTR_79_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_79_TRIG_msb				1u
#define ECLIC_CLICINTATTR_79_TRIG_lsb				2u

	/* 0x113E */
	uint8_t RESERVED254[0x1142u-0x113Eu];

	/* 0x1142: clicintattr Register */
	uint32_t volatile CLICINTATTR_80;
	/* SHV */
#define ECLIC_CLICINTATTR_80_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_80_TRIG_msb				1u
#define ECLIC_CLICINTATTR_80_TRIG_lsb				2u

	/* 0x1142 */
	uint8_t RESERVED255[0x1146u-0x1142u];

	/* 0x1146: clicintattr Register */
	uint32_t volatile CLICINTATTR_81;
	/* SHV */
#define ECLIC_CLICINTATTR_81_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_81_TRIG_msb				1u
#define ECLIC_CLICINTATTR_81_TRIG_lsb				2u

	/* 0x1146 */
	uint8_t RESERVED256[0x114Au-0x1146u];

	/* 0x114A: clicintattr Register */
	uint32_t volatile CLICINTATTR_82;
	/* SHV */
#define ECLIC_CLICINTATTR_82_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_82_TRIG_msb				1u
#define ECLIC_CLICINTATTR_82_TRIG_lsb				2u

	/* 0x114A */
	uint8_t RESERVED257[0x114Eu-0x114Au];

	/* 0x114E: clicintattr Register */
	uint32_t volatile CLICINTATTR_83;
	/* SHV */
#define ECLIC_CLICINTATTR_83_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_83_TRIG_msb				1u
#define ECLIC_CLICINTATTR_83_TRIG_lsb				2u

	/* 0x114E */
	uint8_t RESERVED258[0x1152u-0x114Eu];

	/* 0x1152: clicintattr Register */
	uint32_t volatile CLICINTATTR_84;
	/* SHV */
#define ECLIC_CLICINTATTR_84_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_84_TRIG_msb				1u
#define ECLIC_CLICINTATTR_84_TRIG_lsb				2u

	/* 0x1152 */
	uint8_t RESERVED259[0x1156u-0x1152u];

	/* 0x1156: clicintattr Register */
	uint32_t volatile CLICINTATTR_85;
	/* SHV */
#define ECLIC_CLICINTATTR_85_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_85_TRIG_msb				1u
#define ECLIC_CLICINTATTR_85_TRIG_lsb				2u

	/* 0x1156 */
	uint8_t RESERVED260[0x115Au-0x1156u];

	/* 0x115A: clicintattr Register */
	uint32_t volatile CLICINTATTR_86;
	/* SHV */
#define ECLIC_CLICINTATTR_86_SHV				0u
	/* TRIG */
#define ECLIC_CLICINTATTR_86_TRIG_msb				1u
#define ECLIC_CLICINTATTR_86_TRIG_lsb				2u

	/* 0x1003: clicintctl Register */
	uint32_t volatile CLICINTCTL_0;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_0_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_0_LEVEL_PRIORITY_lsb			7u

	/* 0x1003 */
	uint8_t RESERVED261[0x1007u-0x1003u];

	/* 0x1007: clicintctl Register */
	uint32_t volatile CLICINTCTL_1;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_1_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_1_LEVEL_PRIORITY_lsb			7u

	/* 0x1007 */
	uint8_t RESERVED262[0x100Bu-0x1007u];

	/* 0x100B: clicintctl Register */
	uint32_t volatile CLICINTCTL_2;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_2_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_2_LEVEL_PRIORITY_lsb			7u

	/* 0x100B */
	uint8_t RESERVED263[0x100Fu-0x100Bu];

	/* 0x100F: clicintctl Register */
	uint32_t volatile CLICINTCTL_3;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_3_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_3_LEVEL_PRIORITY_lsb			7u

	/* 0x100F */
	uint8_t RESERVED264[0x1013u-0x100Fu];

