josuah/mcu-gd32vf103/registers.h
	/* 0x1013: clicintctl Register */
	uint32_t volatile CLICINTCTL_4;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_4_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_4_LEVEL_PRIORITY_lsb			7u

	/* 0x1013 */
	uint8_t RESERVED265[0x1017u-0x1013u];

	/* 0x1017: clicintctl Register */
	uint32_t volatile CLICINTCTL_5;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_5_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_5_LEVEL_PRIORITY_lsb			7u

	/* 0x1017 */
	uint8_t RESERVED266[0x101Bu-0x1017u];

	/* 0x101B: clicintctl Register */
	uint32_t volatile CLICINTCTL_6;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_6_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_6_LEVEL_PRIORITY_lsb			7u

	/* 0x101B */
	uint8_t RESERVED267[0x101Fu-0x101Bu];

	/* 0x101F: clicintctl Register */
	uint32_t volatile CLICINTCTL_7;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_7_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_7_LEVEL_PRIORITY_lsb			7u

	/* 0x101F */
	uint8_t RESERVED268[0x1023u-0x101Fu];

	/* 0x1023: clicintctl Register */
	uint32_t volatile CLICINTCTL_8;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_8_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_8_LEVEL_PRIORITY_lsb			7u

	/* 0x1023 */
	uint8_t RESERVED269[0x1027u-0x1023u];

	/* 0x1027: clicintctl Register */
	uint32_t volatile CLICINTCTL_9;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_9_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_9_LEVEL_PRIORITY_lsb			7u

	/* 0x1027 */
	uint8_t RESERVED270[0x102Bu-0x1027u];

	/* 0x102B: clicintctl Register */
	uint32_t volatile CLICINTCTL_10;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_10_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_10_LEVEL_PRIORITY_lsb			7u

	/* 0x102B */
	uint8_t RESERVED271[0x102Fu-0x102Bu];

	/* 0x102F: clicintctl Register */
	uint32_t volatile CLICINTCTL_11;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_11_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_11_LEVEL_PRIORITY_lsb			7u

	/* 0x102F */
	uint8_t RESERVED272[0x1033u-0x102Fu];

	/* 0x1033: clicintctl Register */
	uint32_t volatile CLICINTCTL_12;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_12_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_12_LEVEL_PRIORITY_lsb			7u

	/* 0x1033 */
	uint8_t RESERVED273[0x1037u-0x1033u];

	/* 0x1037: clicintctl Register */
	uint32_t volatile CLICINTCTL_13;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_13_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_13_LEVEL_PRIORITY_lsb			7u

	/* 0x1037 */
	uint8_t RESERVED274[0x103Bu-0x1037u];

	/* 0x103B: clicintctl Register */
	uint32_t volatile CLICINTCTL_14;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_14_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_14_LEVEL_PRIORITY_lsb			7u

	/* 0x103B */
	uint8_t RESERVED275[0x103Fu-0x103Bu];

	/* 0x103F: clicintctl Register */
	uint32_t volatile CLICINTCTL_15;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_15_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_15_LEVEL_PRIORITY_lsb			7u

	/* 0x103F */
	uint8_t RESERVED276[0x1043u-0x103Fu];

	/* 0x1043: clicintctl Register */
	uint32_t volatile CLICINTCTL_16;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_16_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_16_LEVEL_PRIORITY_lsb			7u

	/* 0x1043 */
	uint8_t RESERVED277[0x1047u-0x1043u];

	/* 0x1047: clicintctl Register */
	uint32_t volatile CLICINTCTL_17;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_17_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_17_LEVEL_PRIORITY_lsb			7u

	/* 0x1047 */
	uint8_t RESERVED278[0x104Bu-0x1047u];

	/* 0x104B: clicintctl Register */
	uint32_t volatile CLICINTCTL_18;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_18_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_18_LEVEL_PRIORITY_lsb			7u

	/* 0x104B */
	uint8_t RESERVED279[0x104Fu-0x104Bu];

	/* 0x104F: clicintctl Register */
	uint32_t volatile CLICINTCTL_19;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_19_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_19_LEVEL_PRIORITY_lsb			7u

	/* 0x104F */
	uint8_t RESERVED280[0x1053u-0x104Fu];

	/* 0x1053: clicintctl Register */
	uint32_t volatile CLICINTCTL_20;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_20_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_20_LEVEL_PRIORITY_lsb			7u

	/* 0x1053 */
	uint8_t RESERVED281[0x1057u-0x1053u];

	/* 0x1057: clicintctl Register */
	uint32_t volatile CLICINTCTL_21;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_21_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_21_LEVEL_PRIORITY_lsb			7u

	/* 0x1057 */
	uint8_t RESERVED282[0x105Bu-0x1057u];

	/* 0x105B: clicintctl Register */
	uint32_t volatile CLICINTCTL_22;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_22_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_22_LEVEL_PRIORITY_lsb			7u

	/* 0x105B */
	uint8_t RESERVED283[0x105Fu-0x105Bu];

	/* 0x105F: clicintctl Register */
	uint32_t volatile CLICINTCTL_23;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_23_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_23_LEVEL_PRIORITY_lsb			7u

	/* 0x105F */
	uint8_t RESERVED284[0x1063u-0x105Fu];

	/* 0x1063: clicintctl Register */
	uint32_t volatile CLICINTCTL_24;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_24_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_24_LEVEL_PRIORITY_lsb			7u

	/* 0x1063 */
	uint8_t RESERVED285[0x1067u-0x1063u];

	/* 0x1067: clicintctl Register */
	uint32_t volatile CLICINTCTL_25;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_25_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_25_LEVEL_PRIORITY_lsb			7u

	/* 0x1067 */
	uint8_t RESERVED286[0x106Bu-0x1067u];

	/* 0x106B: clicintctl Register */
	uint32_t volatile CLICINTCTL_26;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_26_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_26_LEVEL_PRIORITY_lsb			7u

	/* 0x106B */
	uint8_t RESERVED287[0x106Fu-0x106Bu];

	/* 0x106F: clicintctl Register */
	uint32_t volatile CLICINTCTL_27;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_27_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_27_LEVEL_PRIORITY_lsb			7u

	/* 0x106F */
	uint8_t RESERVED288[0x1073u-0x106Fu];

	/* 0x1073: clicintctl Register */
	uint32_t volatile CLICINTCTL_28;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_28_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_28_LEVEL_PRIORITY_lsb			7u

	/* 0x1073 */
	uint8_t RESERVED289[0x1077u-0x1073u];

	/* 0x1077: clicintctl Register */
	uint32_t volatile CLICINTCTL_29;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_29_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_29_LEVEL_PRIORITY_lsb			7u

	/* 0x1077 */
	uint8_t RESERVED290[0x107Bu-0x1077u];

