josuah/mcu-gd32vf103/registers.h
	/* 0x107B: clicintctl Register */
	uint32_t volatile CLICINTCTL_30;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_30_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_30_LEVEL_PRIORITY_lsb			7u

	/* 0x107B */
	uint8_t RESERVED291[0x107Fu-0x107Bu];

	/* 0x107F: clicintctl Register */
	uint32_t volatile CLICINTCTL_31;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_31_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_31_LEVEL_PRIORITY_lsb			7u

	/* 0x107F */
	uint8_t RESERVED292[0x1083u-0x107Fu];

	/* 0x1083: clicintctl Register */
	uint32_t volatile CLICINTCTL_32;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_32_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_32_LEVEL_PRIORITY_lsb			7u

	/* 0x1083 */
	uint8_t RESERVED293[0x1087u-0x1083u];

	/* 0x1087: clicintctl Register */
	uint32_t volatile CLICINTCTL_33;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_33_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_33_LEVEL_PRIORITY_lsb			7u

	/* 0x1087 */
	uint8_t RESERVED294[0x108Bu-0x1087u];

	/* 0x108B: clicintctl Register */
	uint32_t volatile CLICINTCTL_34;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_34_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_34_LEVEL_PRIORITY_lsb			7u

	/* 0x108B */
	uint8_t RESERVED295[0x108Fu-0x108Bu];

	/* 0x108F: clicintctl Register */
	uint32_t volatile CLICINTCTL_35;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_35_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_35_LEVEL_PRIORITY_lsb			7u

	/* 0x108F */
	uint8_t RESERVED296[0x1093u-0x108Fu];

	/* 0x1093: clicintctl Register */
	uint32_t volatile CLICINTCTL_36;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_36_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_36_LEVEL_PRIORITY_lsb			7u

	/* 0x1093 */
	uint8_t RESERVED297[0x1097u-0x1093u];

	/* 0x1097: clicintctl Register */
	uint32_t volatile CLICINTCTL_37;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_37_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_37_LEVEL_PRIORITY_lsb			7u

	/* 0x1097 */
	uint8_t RESERVED298[0x109Bu-0x1097u];

	/* 0x109B: clicintctl Register */
	uint32_t volatile CLICINTCTL_38;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_38_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_38_LEVEL_PRIORITY_lsb			7u

	/* 0x109B */
	uint8_t RESERVED299[0x109Fu-0x109Bu];

	/* 0x109F: clicintctl Register */
	uint32_t volatile CLICINTCTL_39;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_39_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_39_LEVEL_PRIORITY_lsb			7u

	/* 0x109F */
	uint8_t RESERVED300[0x10A3u-0x109Fu];

	/* 0x10A3: clicintctl Register */
	uint32_t volatile CLICINTCTL_40;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_40_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_40_LEVEL_PRIORITY_lsb			7u

	/* 0x10A3 */
	uint8_t RESERVED301[0x10A7u-0x10A3u];

	/* 0x10A7: clicintctl Register */
	uint32_t volatile CLICINTCTL_41;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_41_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_41_LEVEL_PRIORITY_lsb			7u

	/* 0x10A7 */
	uint8_t RESERVED302[0x10ABu-0x10A7u];

	/* 0x10AB: clicintctl Register */
	uint32_t volatile CLICINTCTL_42;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_42_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_42_LEVEL_PRIORITY_lsb			7u

	/* 0x10AB */
	uint8_t RESERVED303[0x10AFu-0x10ABu];

	/* 0x10AF: clicintctl Register */
	uint32_t volatile CLICINTCTL_43;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_43_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_43_LEVEL_PRIORITY_lsb			7u

	/* 0x10AF */
	uint8_t RESERVED304[0x10B3u-0x10AFu];

	/* 0x10B3: clicintctl Register */
	uint32_t volatile CLICINTCTL_44;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_44_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_44_LEVEL_PRIORITY_lsb			7u

	/* 0x10B3 */
	uint8_t RESERVED305[0x10B7u-0x10B3u];

	/* 0x10B7: clicintctl Register */
	uint32_t volatile CLICINTCTL_45;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_45_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_45_LEVEL_PRIORITY_lsb			7u

	/* 0x10B7 */
	uint8_t RESERVED306[0x10BBu-0x10B7u];

	/* 0x10BB: clicintctl Register */
	uint32_t volatile CLICINTCTL_46;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_46_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_46_LEVEL_PRIORITY_lsb			7u

	/* 0x10BB */
	uint8_t RESERVED307[0x10BFu-0x10BBu];

	/* 0x10BF: clicintctl Register */
	uint32_t volatile CLICINTCTL_47;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_47_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_47_LEVEL_PRIORITY_lsb			7u

	/* 0x10BF */
	uint8_t RESERVED308[0x10C3u-0x10BFu];

	/* 0x10C3: clicintctl Register */
	uint32_t volatile CLICINTCTL_48;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_48_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_48_LEVEL_PRIORITY_lsb			7u

	/* 0x10C3 */
	uint8_t RESERVED309[0x10C7u-0x10C3u];

	/* 0x10C7: clicintctl Register */
	uint32_t volatile CLICINTCTL_49;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_49_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_49_LEVEL_PRIORITY_lsb			7u

	/* 0x10C7 */
	uint8_t RESERVED310[0x10CBu-0x10C7u];

	/* 0x10CB: clicintctl Register */
	uint32_t volatile CLICINTCTL_50;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_50_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_50_LEVEL_PRIORITY_lsb			7u

	/* 0x10CB */
	uint8_t RESERVED311[0x10CFu-0x10CBu];

	/* 0x10CF: clicintctl Register */
	uint32_t volatile CLICINTCTL_51;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_51_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_51_LEVEL_PRIORITY_lsb			7u

	/* 0x10CF */
	uint8_t RESERVED312[0x10D3u-0x10CFu];

	/* 0x10D3: clicintctl Register */
	uint32_t volatile CLICINTCTL_52;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_52_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_52_LEVEL_PRIORITY_lsb			7u

	/* 0x10D3 */
	uint8_t RESERVED313[0x10D7u-0x10D3u];

	/* 0x10D7: clicintctl Register */
	uint32_t volatile CLICINTCTL_53;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_53_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_53_LEVEL_PRIORITY_lsb			7u

	/* 0x10D7 */
	uint8_t RESERVED314[0x10DBu-0x10D7u];

	/* 0x10DB: clicintctl Register */
	uint32_t volatile CLICINTCTL_54;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_54_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_54_LEVEL_PRIORITY_lsb			7u

	/* 0x10DB */
	uint8_t RESERVED315[0x10DFu-0x10DBu];

	/* 0x10DF: clicintctl Register */
	uint32_t volatile CLICINTCTL_55;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_55_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_55_LEVEL_PRIORITY_lsb			7u

