josuah/mcu-gd32vf103/registers.h
	/* 0x10DF */
	uint8_t RESERVED316[0x10E3u-0x10DFu];

	/* 0x10E3: clicintctl Register */
	uint32_t volatile CLICINTCTL_56;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_56_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_56_LEVEL_PRIORITY_lsb			7u

	/* 0x10E3 */
	uint8_t RESERVED317[0x10E7u-0x10E3u];

	/* 0x10E7: clicintctl Register */
	uint32_t volatile CLICINTCTL_57;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_57_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_57_LEVEL_PRIORITY_lsb			7u

	/* 0x10E7 */
	uint8_t RESERVED318[0x10EBu-0x10E7u];

	/* 0x10EB: clicintctl Register */
	uint32_t volatile CLICINTCTL_58;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_58_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_58_LEVEL_PRIORITY_lsb			7u

	/* 0x10EB */
	uint8_t RESERVED319[0x10EFu-0x10EBu];

	/* 0x10EF: clicintctl Register */
	uint32_t volatile CLICINTCTL_59;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_59_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_59_LEVEL_PRIORITY_lsb			7u

	/* 0x10EF */
	uint8_t RESERVED320[0x10F3u-0x10EFu];

	/* 0x10F3: clicintctl Register */
	uint32_t volatile CLICINTCTL_60;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_60_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_60_LEVEL_PRIORITY_lsb			7u

	/* 0x10F3 */
	uint8_t RESERVED321[0x10F7u-0x10F3u];

	/* 0x10F7: clicintctl Register */
	uint32_t volatile CLICINTCTL_61;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_61_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_61_LEVEL_PRIORITY_lsb			7u

	/* 0x10F7 */
	uint8_t RESERVED322[0x10FBu-0x10F7u];

	/* 0x10FB: clicintctl Register */
	uint32_t volatile CLICINTCTL_62;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_62_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_62_LEVEL_PRIORITY_lsb			7u

	/* 0x10FB */
	uint8_t RESERVED323[0x10FFu-0x10FBu];

	/* 0x10FF: clicintctl Register */
	uint32_t volatile CLICINTCTL_63;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_63_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_63_LEVEL_PRIORITY_lsb			7u

	/* 0x10FF */
	uint8_t RESERVED324[0x1103u-0x10FFu];

	/* 0x1103: clicintctl Register */
	uint32_t volatile CLICINTCTL_64;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_64_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_64_LEVEL_PRIORITY_lsb			7u

	/* 0x1103 */
	uint8_t RESERVED325[0x1107u-0x1103u];

	/* 0x1107: clicintctl Register */
	uint32_t volatile CLICINTCTL_65;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_65_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_65_LEVEL_PRIORITY_lsb			7u

	/* 0x1107 */
	uint8_t RESERVED326[0x110Bu-0x1107u];

	/* 0x110B: clicintctl Register */
	uint32_t volatile CLICINTCTL_66;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_66_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_66_LEVEL_PRIORITY_lsb			7u

	/* 0x110B */
	uint8_t RESERVED327[0x110Fu-0x110Bu];

	/* 0x110F: clicintctl Register */
	uint32_t volatile CLICINTCTL_67;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_67_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_67_LEVEL_PRIORITY_lsb			7u

	/* 0x110F */
	uint8_t RESERVED328[0x1113u-0x110Fu];

	/* 0x1113: clicintctl Register */
	uint32_t volatile CLICINTCTL_68;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_68_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_68_LEVEL_PRIORITY_lsb			7u

	/* 0x1113 */
	uint8_t RESERVED329[0x1117u-0x1113u];

	/* 0x1117: clicintctl Register */
	uint32_t volatile CLICINTCTL_69;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_69_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_69_LEVEL_PRIORITY_lsb			7u

	/* 0x1117 */
	uint8_t RESERVED330[0x111Bu-0x1117u];

	/* 0x111B: clicintctl Register */
	uint32_t volatile CLICINTCTL_70;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_70_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_70_LEVEL_PRIORITY_lsb			7u

	/* 0x111B */
	uint8_t RESERVED331[0x111Fu-0x111Bu];

	/* 0x111F: clicintctl Register */
	uint32_t volatile CLICINTCTL_71;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_71_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_71_LEVEL_PRIORITY_lsb			7u

	/* 0x111F */
	uint8_t RESERVED332[0x1123u-0x111Fu];

	/* 0x1123: clicintctl Register */
	uint32_t volatile CLICINTCTL_72;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_72_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_72_LEVEL_PRIORITY_lsb			7u

	/* 0x1123 */
	uint8_t RESERVED333[0x1127u-0x1123u];

	/* 0x1127: clicintctl Register */
	uint32_t volatile CLICINTCTL_73;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_73_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_73_LEVEL_PRIORITY_lsb			7u

	/* 0x1127 */
	uint8_t RESERVED334[0x112Bu-0x1127u];

	/* 0x112B: clicintctl Register */
	uint32_t volatile CLICINTCTL_74;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_74_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_74_LEVEL_PRIORITY_lsb			7u

	/* 0x112B */
	uint8_t RESERVED335[0x112Fu-0x112Bu];

	/* 0x112F: clicintctl Register */
	uint32_t volatile CLICINTCTL_75;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_75_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_75_LEVEL_PRIORITY_lsb			7u

	/* 0x112F */
	uint8_t RESERVED336[0x1133u-0x112Fu];

	/* 0x1133: clicintctl Register */
	uint32_t volatile CLICINTCTL_76;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_76_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_76_LEVEL_PRIORITY_lsb			7u

	/* 0x1133 */
	uint8_t RESERVED337[0x1137u-0x1133u];

	/* 0x1137: clicintctl Register */
	uint32_t volatile CLICINTCTL_77;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_77_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_77_LEVEL_PRIORITY_lsb			7u

	/* 0x1137 */
	uint8_t RESERVED338[0x113Bu-0x1137u];

	/* 0x113B: clicintctl Register */
	uint32_t volatile CLICINTCTL_78;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_78_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_78_LEVEL_PRIORITY_lsb			7u

	/* 0x113B */
	uint8_t RESERVED339[0x113Fu-0x113Bu];

	/* 0x113F: clicintctl Register */
	uint32_t volatile CLICINTCTL_79;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_79_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_79_LEVEL_PRIORITY_lsb			7u

	/* 0x113F */
	uint8_t RESERVED340[0x1143u-0x113Fu];

