josuah/mcu-gd32vf103/registers.h
	/* 0x1143: clicintctl Register */
	uint32_t volatile CLICINTCTL_80;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_80_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_80_LEVEL_PRIORITY_lsb			7u

	/* 0x1143 */
	uint8_t RESERVED341[0x1147u-0x1143u];

	/* 0x1147: clicintctl Register */
	uint32_t volatile CLICINTCTL_81;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_81_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_81_LEVEL_PRIORITY_lsb			7u

	/* 0x1147 */
	uint8_t RESERVED342[0x114Bu-0x1147u];

	/* 0x114B: clicintctl Register */
	uint32_t volatile CLICINTCTL_82;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_82_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_82_LEVEL_PRIORITY_lsb			7u

	/* 0x114B */
	uint8_t RESERVED343[0x114Fu-0x114Bu];

	/* 0x114F: clicintctl Register */
	uint32_t volatile CLICINTCTL_83;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_83_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_83_LEVEL_PRIORITY_lsb			7u

	/* 0x114F */
	uint8_t RESERVED344[0x1153u-0x114Fu];

	/* 0x1153: clicintctl Register */
	uint32_t volatile CLICINTCTL_84;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_84_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_84_LEVEL_PRIORITY_lsb			7u

	/* 0x1153 */
	uint8_t RESERVED345[0x1157u-0x1153u];

	/* 0x1157: clicintctl Register */
	uint32_t volatile CLICINTCTL_85;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_85_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_85_LEVEL_PRIORITY_lsb			7u

	/* 0x1157 */
	uint8_t RESERVED346[0x115Bu-0x1157u];

	/* 0x115B: clicintctl Register */
	uint32_t volatile CLICINTCTL_86;
	/* LEVEL_PRIORITY */
#define ECLIC_CLICINTCTL_86_LEVEL_PRIORITY_msb			0u
#define ECLIC_CLICINTCTL_86_LEVEL_PRIORITY_lsb			7u

};


#define PMU ((struct sdk_pmu *)0x40007000)

struct sdk_pmu {

	/* 0x00: power control register */
	uint32_t volatile CTL;
	/* Backup Domain Write Enable */
#define PMU_CTL_BKPWEN						8u
	/* Low Voltage Detector Threshold */
#define PMU_CTL_LVDT_msb					5u
#define PMU_CTL_LVDT_lsb					7u
	/* Low Voltage Detector Enable */
#define PMU_CTL_LVDEN						4u
	/* Standby Flag Reset */
#define PMU_CTL_STBRST						3u
	/* Wakeup Flag Reset */
#define PMU_CTL_WURST						2u
	/* Standby Mode */
#define PMU_CTL_STBMOD						1u
	/* LDO Low Power Mode */
#define PMU_CTL_LDOLP						0u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: power control/status register */
	uint32_t volatile CS;
	/* Enable WKUP pin */
#define PMU_CS_WUPEN						8u
	/* Low Voltage Detector Status Flag */
#define PMU_CS_LVDF						2u
	/* Standby flag */
#define PMU_CS_STBF						1u
	/* Wakeup flag */
#define PMU_CS_WUF						0u

};


#define RCU ((struct sdk_rcu *)0x40021000)

struct sdk_rcu {

	/* 0x00: Control register */
	uint32_t volatile CTL;
	/* Internal 8MHz RC oscillator Enable */
#define RCU_CTL_IRC8MEN						0u
	/* IRC8M Internal 8MHz RC Oscillator stabilization Flag */
#define RCU_CTL_IRC8MSTB					1u
	/* Internal 8MHz RC Oscillator clock trim adjust value */
#define RCU_CTL_IRC8MADJ_msb					3u
#define RCU_CTL_IRC8MADJ_lsb					7u
	/* Internal 8MHz RC Oscillator calibration value register */
#define RCU_CTL_IRC8MCALIB_msb					8u
#define RCU_CTL_IRC8MCALIB_lsb					15u
	/* External High Speed oscillator Enable */
#define RCU_CTL_HXTALEN						16u
	/* External crystal oscillator (HXTAL) clock stabilization flag */
#define RCU_CTL_HXTALSTB					17u
	/* External crystal oscillator (HXTAL) clock bypass mode enable */
#define RCU_CTL_HXTALBPS					18u
	/* HXTAL Clock Monitor Enable */
#define RCU_CTL_CKMEN						19u
	/* PLL enable */
#define RCU_CTL_PLLEN						24u
	/* PLL Clock Stabilization Flag */
#define RCU_CTL_PLLSTB						25u
	/* PLL1 enable */
#define RCU_CTL_PLL1EN						26u
	/* PLL1 Clock Stabilization Flag */
#define RCU_CTL_PLL1STB						27u
	/* PLL2 enable */
#define RCU_CTL_PLL2EN						28u
	/* PLL2 Clock Stabilization Flag */
#define RCU_CTL_PLL2STB						29u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: Clock configuration register 0 */
	uint32_t volatile CFG0;
	/* System clock switch */
#define RCU_CFG0_SCS_msb					0u
#define RCU_CFG0_SCS_lsb					1u
	/* System clock switch status */
#define RCU_CFG0_SCSS_msb					2u
#define RCU_CFG0_SCSS_lsb					3u
	/* AHB prescaler selection */
#define RCU_CFG0_AHBPSC_msb					4u
#define RCU_CFG0_AHBPSC_lsb					7u
	/* APB1 prescaler selection */
#define RCU_CFG0_APB1PSC_msb					8u
#define RCU_CFG0_APB1PSC_lsb					10u
	/* APB2 prescaler selection */
#define RCU_CFG0_APB2PSC_msb					11u
#define RCU_CFG0_APB2PSC_lsb					13u
	/* ADC clock prescaler selection */
#define RCU_CFG0_ADCPSC_1_0_msb					14u
#define RCU_CFG0_ADCPSC_1_0_lsb					15u
	/* PLL Clock Source Selection */
#define RCU_CFG0_PLLSEL						16u
	/* The LSB of PREDV0 division factor */
#define RCU_CFG0_PREDV0_LSB					17u
	/* The PLL clock multiplication factor */
#define RCU_CFG0_PLLMF_3_0_msb					18u
#define RCU_CFG0_PLLMF_3_0_lsb					21u
	/* USBFS clock prescaler selection */
#define RCU_CFG0_USBFSPSC_msb					22u
#define RCU_CFG0_USBFSPSC_lsb					23u
	/* CKOUT0 Clock Source Selection */
#define RCU_CFG0_CKOUT0SEL_msb					24u
#define RCU_CFG0_CKOUT0SEL_lsb					27u
	/* Bit 2 of ADCPSC */
#define RCU_CFG0_ADCPSC_2					28u
	/* Bit 4 of PLLMF */
#define RCU_CFG0_PLLMF_4					29u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: Clock interrupt register */
	uint32_t volatile INT;
	/* IRC40K stabilization interrupt flag */
#define RCU_INT_IRC40KSTBIF					0u
	/* LXTAL stabilization interrupt flag */
#define RCU_INT_LXTALSTBIF					1u
	/* IRC8M stabilization interrupt flag */
#define RCU_INT_IRC8MSTBIF					2u
	/* HXTAL stabilization interrupt flag */
#define RCU_INT_HXTALSTBIF					3u
	/* PLL stabilization interrupt flag */
#define RCU_INT_PLLSTBIF					4u
	/* PLL1 stabilization interrupt flag */
#define RCU_INT_PLL1STBIF					5u
	/* PLL2 stabilization interrupt flag */
#define RCU_INT_PLL2STBIF					6u
	/* HXTAL Clock Stuck Interrupt Flag */
#define RCU_INT_CKMIF						7u
	/* IRC40K Stabilization interrupt enable */
#define RCU_INT_IRC40KSTBIE					8u
	/* LXTAL Stabilization Interrupt Enable */
#define RCU_INT_LXTALSTBIE					9u
	/* IRC8M Stabilization Interrupt Enable */
#define RCU_INT_IRC8MSTBIE					10u
	/* HXTAL Stabilization Interrupt Enable */
#define RCU_INT_HXTALSTBIE					11u
	/* PLL Stabilization Interrupt Enable */
#define RCU_INT_PLLSTBIE					12u
	/* PLL1 Stabilization Interrupt Enable */
#define RCU_INT_PLL1STBIE					13u
	/* PLL2 Stabilization Interrupt Enable */
#define RCU_INT_PLL2STBIE					14u
	/* IRC40K Stabilization Interrupt Clear */
#define RCU_INT_IRC40KSTBIC					16u
	/* LXTAL Stabilization Interrupt Clear */
#define RCU_INT_LXTALSTBIC					17u
	/* IRC8M Stabilization Interrupt Clear */
#define RCU_INT_IRC8MSTBIC					18u
	/* HXTAL Stabilization Interrupt Clear */
#define RCU_INT_HXTALSTBIC					19u
	/* PLL stabilization Interrupt Clear */
#define RCU_INT_PLLSTBIC					20u
	/* PLL1 stabilization Interrupt Clear */
#define RCU_INT_PLL1STBIC					21u
	/* PLL2 stabilization Interrupt Clear */
#define RCU_INT_PLL2STBIC					22u
	/* HXTAL Clock Stuck Interrupt Clear */
#define RCU_INT_CKMIC						23u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C: APB2 reset register */
	uint32_t volatile APB2RST;
	/* Alternate function I/O reset */
#define RCU_APB2RST_AFRST					0u
	/* GPIO port A reset */
#define RCU_APB2RST_PARST					2u
	/* GPIO port B reset */
#define RCU_APB2RST_PBRST					3u
	/* GPIO port C reset */
#define RCU_APB2RST_PCRST					4u
	/* GPIO port D reset */
#define RCU_APB2RST_PDRST					5u
	/* GPIO port E reset */
#define RCU_APB2RST_PERST					6u
	/* ADC0 reset */
#define RCU_APB2RST_ADC0RST					9u
	/* ADC1 reset */
#define RCU_APB2RST_ADC1RST					10u
	/* Timer 0 reset */
#define RCU_APB2RST_TIMER0RST					11u
	/* SPI0 reset */
#define RCU_APB2RST_SPI0RST					12u
	/* USART0 Reset */
#define RCU_APB2RST_USART0RST					14u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

	/* 0x10: APB1 reset register */
	uint32_t volatile APB1RST;
	/* TIMER1 timer reset */
#define RCU_APB1RST_TIMER1RST					0u
	/* TIMER2 timer reset */
#define RCU_APB1RST_TIMER2RST					1u
	/* TIMER3 timer reset */
#define RCU_APB1RST_TIMER3RST					2u
	/* TIMER4 timer reset */
#define RCU_APB1RST_TIMER4RST					3u
	/* TIMER5 timer reset */
#define RCU_APB1RST_TIMER5RST					4u
	/* TIMER6 timer reset */
#define RCU_APB1RST_TIMER6RST					5u
	/* Window watchdog timer reset */
#define RCU_APB1RST_WWDGTRST					11u
	/* SPI1 reset */
#define RCU_APB1RST_SPI1RST					14u
	/* SPI2 reset */
#define RCU_APB1RST_SPI2RST					15u
	/* USART1 reset */
#define RCU_APB1RST_USART1RST					17u
	/* USART2 reset */
#define RCU_APB1RST_USART2RST					18u
	/* UART3 reset */
#define RCU_APB1RST_UART3RST					19u
	/* UART4 reset */
#define RCU_APB1RST_UART4RST					20u
	/* I2C0 reset */
#define RCU_APB1RST_I2C0RST					21u
	/* I2C1 reset */
#define RCU_APB1RST_I2C1RST					22u
	/* CAN0 reset */
#define RCU_APB1RST_CAN0RST					25u
	/* CAN1 reset */
#define RCU_APB1RST_CAN1RST					26u
	/* Backup interface reset */
#define RCU_APB1RST_BKPIRST					27u
	/* Power control reset */
#define RCU_APB1RST_PMURST					28u
	/* DAC reset */
#define RCU_APB1RST_DACRST					29u

