josuah/mcu-gd32vf103/registers.h
	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: AHB enable register */
	uint32_t volatile AHBEN;
	/* DMA0 clock enable */
#define RCU_AHBEN_DMA0EN					0u
	/* DMA1 clock enable */
#define RCU_AHBEN_DMA1EN					1u
	/* SRAM interface clock enable when sleep mode */
#define RCU_AHBEN_SRAMSPEN					2u
	/* FMC clock enable when sleep mode */
#define RCU_AHBEN_FMCSPEN					4u
	/* CRC clock enable */
#define RCU_AHBEN_CRCEN						6u
	/* EXMC clock enable */
#define RCU_AHBEN_EXMCEN					8u
	/* USBFS clock enable */
#define RCU_AHBEN_USBFSEN					12u

	/* 0x14 */
	uint8_t RESERVED5[0x18-0x14];

	/* 0x18: APB2 clock enable register */
	uint32_t volatile APB2EN;
	/* Alternate function IO clock enable */
#define RCU_APB2EN_AFEN						0u
	/* GPIO port A clock enable */
#define RCU_APB2EN_PAEN						2u
	/* GPIO port B clock enable */
#define RCU_APB2EN_PBEN						3u
	/* GPIO port C clock enable */
#define RCU_APB2EN_PCEN						4u
	/* GPIO port D clock enable */
#define RCU_APB2EN_PDEN						5u
	/* GPIO port E clock enable */
#define RCU_APB2EN_PEEN						6u
	/* ADC0 clock enable */
#define RCU_APB2EN_ADC0EN					9u
	/* ADC1 clock enable */
#define RCU_APB2EN_ADC1EN					10u
	/* TIMER0 clock enable */
#define RCU_APB2EN_TIMER0EN					11u
	/* SPI0 clock enable */
#define RCU_APB2EN_SPI0EN					12u
	/* USART0 clock enable */
#define RCU_APB2EN_USART0EN					14u

	/* 0x18 */
	uint8_t RESERVED6[0x1C-0x18];

	/* 0x1C: APB1 clock enable register */
	uint32_t volatile APB1EN;
	/* TIMER1 timer clock enable */
#define RCU_APB1EN_TIMER1EN					0u
	/* TIMER2 timer clock enable */
#define RCU_APB1EN_TIMER2EN					1u
	/* TIMER3 timer clock enable */
#define RCU_APB1EN_TIMER3EN					2u
	/* TIMER4 timer clock enable */
#define RCU_APB1EN_TIMER4EN					3u
	/* TIMER5 timer clock enable */
#define RCU_APB1EN_TIMER5EN					4u
	/* TIMER6 timer clock enable */
#define RCU_APB1EN_TIMER6EN					5u
	/* Window watchdog timer clock enable */
#define RCU_APB1EN_WWDGTEN					11u
	/* SPI1 clock enable */
#define RCU_APB1EN_SPI1EN					14u
	/* SPI2 clock enable */
#define RCU_APB1EN_SPI2EN					15u
	/* USART1 clock enable */
#define RCU_APB1EN_USART1EN					17u
	/* USART2 clock enable */
#define RCU_APB1EN_USART2EN					18u
	/* UART3 clock enable */
#define RCU_APB1EN_UART3EN					19u
	/* UART4 clock enable */
#define RCU_APB1EN_UART4EN					20u
	/* I2C0 clock enable */
#define RCU_APB1EN_I2C0EN					21u
	/* I2C1 clock enable */
#define RCU_APB1EN_I2C1EN					22u
	/* CAN0 clock enable */
#define RCU_APB1EN_CAN0EN					25u
	/* CAN1 clock enable */
#define RCU_APB1EN_CAN1EN					26u
	/* Backup interface clock enable */
#define RCU_APB1EN_BKPIEN					27u
	/* Power control clock enable */
#define RCU_APB1EN_PMUEN					28u
	/* DAC clock enable */
#define RCU_APB1EN_DACEN					29u

	/* 0x1C */
	uint8_t RESERVED7[0x20-0x1C];

	/* 0x20: Backup domain control register */
	uint32_t volatile BDCTL;
	/* LXTAL enable */
#define RCU_BDCTL_LXTALEN					0u
	/* External low-speed oscillator stabilization */
#define RCU_BDCTL_LXTALSTB					1u
	/* LXTAL bypass mode enable */
#define RCU_BDCTL_LXTALBPS					2u
	/* RTC clock entry selection */
#define RCU_BDCTL_RTCSRC_msb					8u
#define RCU_BDCTL_RTCSRC_lsb					9u
	/* RTC clock enable */
#define RCU_BDCTL_RTCEN						15u
	/* Backup domain reset */
#define RCU_BDCTL_BKPRST					16u

	/* 0x20 */
	uint8_t RESERVED8[0x24-0x20];

	/* 0x24: Reset source /clock register */
	uint32_t volatile RSTSCK;
	/* IRC40K enable */
#define RCU_RSTSCK_IRC40KEN					0u
	/* IRC40K stabilization */
#define RCU_RSTSCK_IRC40KSTB					1u
	/* Reset flag clear */
#define RCU_RSTSCK_RSTFC					24u
	/* External PIN reset flag */
#define RCU_RSTSCK_EPRSTF					26u
	/* Power reset flag */
#define RCU_RSTSCK_PORRSTF					27u
	/* Software reset flag */
#define RCU_RSTSCK_SWRSTF					28u
	/* Free Watchdog timer reset flag */
#define RCU_RSTSCK_FWDGTRSTF					29u
	/* Window watchdog timer reset flag */
#define RCU_RSTSCK_WWDGTRSTF					30u
	/* Low-power reset flag */
#define RCU_RSTSCK_LPRSTF					31u

	/* 0x24 */
	uint8_t RESERVED9[0x28-0x24];

	/* 0x28: AHB reset register */
	uint32_t volatile AHBRST;
	/* USBFS reset */
#define RCU_AHBRST_USBFSRST					12u

	/* 0x28 */
	uint8_t RESERVED10[0x2C-0x28];

	/* 0x2C: Clock Configuration register 1 */
	uint32_t volatile CFG1;
	/* PREDV0 division factor */
#define RCU_CFG1_PREDV0_msb					0u
#define RCU_CFG1_PREDV0_lsb					3u
	/* PREDV1 division factor */
#define RCU_CFG1_PREDV1_msb					4u
#define RCU_CFG1_PREDV1_lsb					7u
	/* The PLL1 clock multiplication factor */
#define RCU_CFG1_PLL1MF_msb					8u
#define RCU_CFG1_PLL1MF_lsb					11u
	/* The PLL2 clock multiplication factor */
#define RCU_CFG1_PLL2MF_msb					12u
#define RCU_CFG1_PLL2MF_lsb					15u
	/* PREDV0 input Clock Source Selection */
#define RCU_CFG1_PREDV0SEL					16u
	/* I2S1 Clock Source Selection */
#define RCU_CFG1_I2S1SEL					17u
	/* I2S2 Clock Source Selection */
#define RCU_CFG1_I2S2SEL					18u

	/* 0x2C */
	uint8_t RESERVED11[0x34-0x2C];

	/* 0x34: Deep sleep mode Voltage register */
	uint32_t volatile DSV;
	/* Deep-sleep mode voltage select */
#define RCU_DSV_DSLPVS_msb					0u
#define RCU_DSV_DSLPVS_lsb					1u

};


#define RTC ((struct sdk_rtc *)0x40002800)

struct sdk_rtc {

	/* 0x00: RTC interrupt enable register */
	uint32_t volatile INTEN;
	/* Overflow interrupt enable */
#define RTC_INTEN_OVIE						2u
	/* Alarm interrupt enable */
#define RTC_INTEN_ALRMIE					1u
	/* Second interrupt */
#define RTC_INTEN_SCIE						0u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: control register */
	uint32_t volatile CTL;
	/* Last write operation finished flag */
#define RTC_CTL_LWOFF						5u
	/* Configuration mode flag */
#define RTC_CTL_CMF						4u
	/* Registers synchronized flag */
#define RTC_CTL_RSYNF						3u
	/* Overflow interrupt flag */
#define RTC_CTL_OVIF						2u
	/* Alarm interrupt flag */
#define RTC_CTL_ALRMIF						1u
	/* Sencond interrupt flag */
#define RTC_CTL_SCIF						0u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: RTC prescaler high register */
	uint32_t volatile PSCH;
	/* RTC prescaler value high */
#define RTC_PSCH_PSC_msb					0u
#define RTC_PSCH_PSC_lsb					3u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C:  */
	uint32_t volatile PSCL;
	/* RTC prescaler value low */
#define RTC_PSCL_PSC_msb					0u
#define RTC_PSCL_PSC_lsb					15u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

	/* 0x10: RTC divider high register */
	uint32_t volatile DIVH;
	/* RTC divider value high */
#define RTC_DIVH_DIV_msb					0u
#define RTC_DIVH_DIV_lsb					3u

