josuah/mcu-gd32vf103/registers.h
	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: RTC divider low register */
	uint32_t volatile DIVL;
	/* RTC divider value low */
#define RTC_DIVL_DIV_msb					0u
#define RTC_DIVL_DIV_lsb					15u

	/* 0x14 */
	uint8_t RESERVED5[0x18-0x14];

	/* 0x18: RTC counter high register */
	uint32_t volatile CNTH;
	/* RTC counter value high */
#define RTC_CNTH_CNT_msb					0u
#define RTC_CNTH_CNT_lsb					15u

	/* 0x18 */
	uint8_t RESERVED6[0x1C-0x18];

	/* 0x1C: RTC counter low register */
	uint32_t volatile CNTL;
	/* RTC counter value low */
#define RTC_CNTL_CNT_msb					0u
#define RTC_CNTL_CNT_lsb					15u

	/* 0x1C */
	uint8_t RESERVED7[0x20-0x1C];

	/* 0x20: Alarm high register */
	uint32_t volatile ALRMH;
	/* Alarm  value high */
#define RTC_ALRMH_ALRM_msb					0u
#define RTC_ALRMH_ALRM_lsb					15u

	/* 0x20 */
	uint8_t RESERVED8[0x24-0x20];

	/* 0x24: RTC alarm low register */
	uint32_t volatile ALRML;
	/* alarm value low */
#define RTC_ALRML_ALRM_msb					0u
#define RTC_ALRML_ALRM_lsb					15u

};


#define SPI0 ((struct sdk_spi0 *)0x40013000)
#define SPI1 ((struct sdk_spi1 *)0x40003800)
#define SPI2 ((struct sdk_spi2 *)0x40003C00)

struct sdk_spi0 {

	/* 0x00: control register 0 */
	uint32_t volatile CTL0;
	/* Bidirectional */
#define SPI0_CTL0_BDEN						15u
	/* Bidirectional Transmit output enable */
#define SPI0_CTL0_BDOEN						14u
	/* CRC Calculation Enable */
#define SPI0_CTL0_CRCEN						13u
	/* CRC Next Transfer */
#define SPI0_CTL0_CRCNT						12u
	/* Data frame format */
#define SPI0_CTL0_FF16						11u
	/* Receive only */
#define SPI0_CTL0_RO						10u
	/* NSS Software Mode Selection */
#define SPI0_CTL0_SWNSSEN					9u
	/* NSS Pin Selection In NSS Software Mode */
#define SPI0_CTL0_SWNSS						8u
	/* LSB First Mode */
#define SPI0_CTL0_LF						7u
	/* SPI enable */
#define SPI0_CTL0_SPIEN						6u
	/* Master Clock Prescaler Selection */
#define SPI0_CTL0_PSC_msb					3u
#define SPI0_CTL0_PSC_lsb					5u
	/* Master Mode Enable */
#define SPI0_CTL0_MSTMOD					2u
	/* Clock polarity Selection */
#define SPI0_CTL0_CKPL						1u
	/* Clock Phase Selection */
#define SPI0_CTL0_CKPH						0u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: control register 1 */
	uint32_t volatile CTL1;
	/* Tx buffer empty interrupt */
#define SPI0_CTL1_TBEIE						7u
	/* RX buffer not empty interrupt */
#define SPI0_CTL1_RBNEIE					6u
	/* Error interrupt enable */
#define SPI0_CTL1_ERRIE						5u
	/* SPI TI mode enable */
#define SPI0_CTL1_TMOD						4u
	/* SPI NSS pulse mode enable */
#define SPI0_CTL1_NSSP						3u
	/* Drive NSS Output */
#define SPI0_CTL1_NSSDRV					2u
	/* Transmit Buffer DMA Enable */
#define SPI0_CTL1_DMATEN					1u
	/* Rx buffer DMA enable */
#define SPI0_CTL1_DMAREN					0u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: status register */
	uint32_t volatile STAT;
	/* Format error */
#define SPI0_STAT_FERR						8u
	/* Transmitting On-going Bit */
#define SPI0_STAT_TRANS						7u
	/* Reception Overrun Error Bit */
#define SPI0_STAT_RXORERR					6u
	/* SPI Configuration error */
#define SPI0_STAT_CONFERR					5u
	/* SPI CRC Error Bit */
#define SPI0_STAT_CRCERR					4u
	/* Transmission underrun error bit */
#define SPI0_STAT_TXURERR					3u
	/* I2S channel side */
#define SPI0_STAT_I2SCH						2u
	/* Transmit Buffer Empty */
#define SPI0_STAT_TBE						1u
	/* Receive Buffer Not Empty */
#define SPI0_STAT_RBNE						0u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C: data register */
	uint32_t volatile DATA;
	/* Data transfer register */
#define SPI0_DATA_SPI_DATA_msb					0u
#define SPI0_DATA_SPI_DATA_lsb					15u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

	/* 0x10: CRC polynomial register */
	uint32_t volatile CRCPOLY;
	/* CRC polynomial value */
#define SPI0_CRCPOLY_CRCPOLY_msb				0u
#define SPI0_CRCPOLY_CRCPOLY_lsb				15u

	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: RX CRC register */
	uint32_t volatile RCRC;
	/* RX CRC value */
#define SPI0_RCRC_RCRC_msb					0u
#define SPI0_RCRC_RCRC_lsb					15u

	/* 0x14 */
	uint8_t RESERVED5[0x18-0x14];

	/* 0x18: TX CRC register */
	uint32_t volatile TCRC;
	/* Tx CRC value */
#define SPI0_TCRC_TCRC_msb					0u
#define SPI0_TCRC_TCRC_lsb					15u

	/* 0x18 */
	uint8_t RESERVED6[0x1C-0x18];

	/* 0x1C: I2S control register */
	uint32_t volatile I2SCTL;
	/* I2S mode selection */
#define SPI0_I2SCTL_I2SSEL					11u
	/* I2S Enable */
#define SPI0_I2SCTL_I2SEN					10u
	/* I2S operation mode */
#define SPI0_I2SCTL_I2SOPMOD_msb				8u
#define SPI0_I2SCTL_I2SOPMOD_lsb				9u
	/* PCM frame synchronization mode */
#define SPI0_I2SCTL_PCMSMOD					7u
	/* I2S standard selection */
#define SPI0_I2SCTL_I2SSTD_msb					4u
#define SPI0_I2SCTL_I2SSTD_lsb					5u
	/* Idle state clock polarity */
#define SPI0_I2SCTL_CKPL					3u
	/* Data length */
#define SPI0_I2SCTL_DTLEN_msb					1u
#define SPI0_I2SCTL_DTLEN_lsb					2u
	/* Channel length (number of bits per audio */
#define SPI0_I2SCTL_CHLEN					0u

	/* 0x1C */
	uint8_t RESERVED7[0x20-0x1C];

	/* 0x20: I2S prescaler register */
	uint32_t volatile I2SPSC;
	/* I2S_MCK output enable */
#define SPI0_I2SPSC_MCKOEN					9u
	/* Odd factor for the */
#define SPI0_I2SPSC_OF						8u
	/* Dividing factor for the prescaler */
#define SPI0_I2SPSC_DIV_msb					0u
#define SPI0_I2SPSC_DIV_lsb					7u

};


#define TIMER0 ((struct sdk_timer0 *)0x40012C00)

struct sdk_timer0 {

	/* 0x00: control register 0 */
	uint32_t volatile CTL0;
	/* Clock division */
#define TIMER0_CTL0_CKDIV_msb					8u
#define TIMER0_CTL0_CKDIV_lsb					9u
	/* Auto-reload shadow enable */
#define TIMER0_CTL0_ARSE					7u
	/* Counter aligns mode */
#define TIMER0_CTL0_CAM_msb					5u
#define TIMER0_CTL0_CAM_lsb					6u
	/* Direction */
#define TIMER0_CTL0_DIR						4u
	/* Single pulse mode */
#define TIMER0_CTL0_SPM						3u
	/* Update source */
#define TIMER0_CTL0_UPS						2u
	/* Update disable */
#define TIMER0_CTL0_UPDIS					1u
	/* Counter enable */
#define TIMER0_CTL0_CEN						0u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: control register 1 */
	uint32_t volatile CTL1;
	/* Idle state of channel 3 output */
#define TIMER0_CTL1_ISO3					14u
	/* Idle state of channel 2 complementary output */
#define TIMER0_CTL1_ISO2N					13u
	/* Idle state of channel 2 output */
#define TIMER0_CTL1_ISO2					12u
	/* Idle state of channel 1 complementary output */
#define TIMER0_CTL1_ISO1N					11u
	/* Idle state of channel 1 output */
#define TIMER0_CTL1_ISO1					10u
	/* Idle state of channel 0 complementary output */
#define TIMER0_CTL1_ISO0N					9u
	/* Idle state of channel 0 output */
#define TIMER0_CTL1_ISO0					8u
	/* Channel 0 trigger input selection */
#define TIMER0_CTL1_TI0S					7u
	/* Master mode control */
#define TIMER0_CTL1_MMC_msb					4u
#define TIMER0_CTL1_MMC_lsb					6u
	/* DMA request source selection */
#define TIMER0_CTL1_DMAS					3u
	/* Commutation control shadow register update control */
#define TIMER0_CTL1_CCUC					2u
	/* Commutation control shadow enable */
#define TIMER0_CTL1_CCSE					0u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: slave mode configuration register */
	uint32_t volatile SMCFG;
	/* External trigger polarity */
#define TIMER0_SMCFG_ETP					15u
	/* Part of SMC for enable External clock mode1 */
#define TIMER0_SMCFG_SMC1					14u
	/* External trigger prescaler */
#define TIMER0_SMCFG_ETPSC_msb					12u
#define TIMER0_SMCFG_ETPSC_lsb					13u
	/* External trigger filter control */
#define TIMER0_SMCFG_ETFC_msb					8u
#define TIMER0_SMCFG_ETFC_lsb					11u
	/* Master/Slave mode */
#define TIMER0_SMCFG_MSM					7u
	/* Trigger selection */
#define TIMER0_SMCFG_TRGS_msb					4u
#define TIMER0_SMCFG_TRGS_lsb					6u
	/* Slave mode selection */
#define TIMER0_SMCFG_SMC_msb					0u
#define TIMER0_SMCFG_SMC_lsb					2u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

