josuah/mcu-gd32vf103/registers.h
	/* 0x0C: DMA/Interrupt enable register */
	uint32_t volatile DMAINTEN;
	/* Trigger DMA request enable */
#define TIMER0_DMAINTEN_TRGDEN					14u
	/* Commutation DMA request enable */
#define TIMER0_DMAINTEN_CMTDEN					13u
	/* Channel 3 capture/compare DMA request enable */
#define TIMER0_DMAINTEN_CH3DEN					12u
	/* Channel 2 capture/compare DMA request enable */
#define TIMER0_DMAINTEN_CH2DEN					11u
	/* Channel 1 capture/compare DMA request enable */
#define TIMER0_DMAINTEN_CH1DEN					10u
	/* Channel 0 capture/compare DMA request enable */
#define TIMER0_DMAINTEN_CH0DEN					9u
	/* Update DMA request enable */
#define TIMER0_DMAINTEN_UPDEN					8u
	/* Break interrupt enable */
#define TIMER0_DMAINTEN_BRKIE					7u
	/* Trigger interrupt enable */
#define TIMER0_DMAINTEN_TRGIE					6u
	/* commutation interrupt enable */
#define TIMER0_DMAINTEN_CMTIE					5u
	/* Channel 3 capture/compare interrupt enable */
#define TIMER0_DMAINTEN_CH3IE					4u
	/* Channel 2 capture/compare interrupt enable */
#define TIMER0_DMAINTEN_CH2IE					3u
	/* Channel 1 capture/compare interrupt enable */
#define TIMER0_DMAINTEN_CH1IE					2u
	/* Channel 0 capture/compare interrupt enable */
#define TIMER0_DMAINTEN_CH0IE					1u
	/* Update interrupt enable */
#define TIMER0_DMAINTEN_UPIE					0u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

	/* 0x10: Interrupt flag register */
	uint32_t volatile INTF;
	/* Channel 3 over capture flag */
#define TIMER0_INTF_CH3OF					12u
	/* Channel 2 over capture flag */
#define TIMER0_INTF_CH2OF					11u
	/* Channel 1 over capture flag */
#define TIMER0_INTF_CH1OF					10u
	/* Channel 0 over capture flag */
#define TIMER0_INTF_CH0OF					9u
	/* Break interrupt flag */
#define TIMER0_INTF_BRKIF					7u
	/* Trigger interrupt flag */
#define TIMER0_INTF_TRGIF					6u
	/* Channel commutation interrupt flag */
#define TIMER0_INTF_CMTIF					5u
	/* Channel 3 capture/compare interrupt flag */
#define TIMER0_INTF_CH3IF					4u
	/*  */
#define TIMER0_INTF_CH2IF					3u
	/* Channel 1  capture/compare interrupt flag */
#define TIMER0_INTF_CH1IF					2u
	/* Channel 0  capture/compare interrupt flag */
#define TIMER0_INTF_CH0IF					1u
	/* Update interrupt flag */
#define TIMER0_INTF_UPIF					0u

	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: Software event generation register */
	uint32_t volatile SWEVG;
	/* Break event generation */
#define TIMER0_SWEVG_BRKG					7u
	/* Trigger event generation */
#define TIMER0_SWEVG_TRGG					6u
	/* Channel commutation event generation */
#define TIMER0_SWEVG_CMTG					5u
	/* Channel  3 capture or compare event generation */
#define TIMER0_SWEVG_CH3G					4u
	/* Channel 2 capture or compare event generation */
#define TIMER0_SWEVG_CH2G					3u
	/* Channel 1 capture or compare event generation */
#define TIMER0_SWEVG_CH1G					2u
	/* Channel 0 capture or compare event generation */
#define TIMER0_SWEVG_CH0G					1u
	/* Update event generation */
#define TIMER0_SWEVG_UPG					0u

	/* 0x14 */
	uint8_t RESERVED5[0x18-0x14];

	/* 0x18: Channel control register 0 (output */
	uint32_t volatile CHCTL0_OUTPUT;
	/* Channel 1 output compare clear enable */
#define TIMER0_CHCTL0_OUTPUT_CH1COMCEN				15u
	/* Channel 1 compare output control */
#define TIMER0_CHCTL0_OUTPUT_CH1COMCTL_msb			12u
#define TIMER0_CHCTL0_OUTPUT_CH1COMCTL_lsb			14u
	/* Channel 1 output compare shadow enable */
#define TIMER0_CHCTL0_OUTPUT_CH1COMSEN				11u
	/* Channel 1 output compare fast enable */
#define TIMER0_CHCTL0_OUTPUT_CH1COMFEN				10u
	/* Channel 1 mode selection */
#define TIMER0_CHCTL0_OUTPUT_CH1MS_msb				8u
#define TIMER0_CHCTL0_OUTPUT_CH1MS_lsb				9u
	/* Channel 0 output compare clear enable */
#define TIMER0_CHCTL0_OUTPUT_CH0COMCEN				7u
	/* Channel 0 compare output control */
#define TIMER0_CHCTL0_OUTPUT_CH0COMCTL_msb			4u
#define TIMER0_CHCTL0_OUTPUT_CH0COMCTL_lsb			6u
	/* Channel 0 compare output shadow enable */
#define TIMER0_CHCTL0_OUTPUT_CH0COMSEN				3u
	/* Channel 0 output compare fast enable */
#define TIMER0_CHCTL0_OUTPUT_CH0COMFEN				2u
	/* Channel 0 I/O mode selection */
#define TIMER0_CHCTL0_OUTPUT_CH0MS_msb				0u
#define TIMER0_CHCTL0_OUTPUT_CH0MS_lsb				1u

	/* 0x18: Channel control register 0 (input */
	uint32_t volatile CHCTL0_INPUT;
	/* Channel 1 input capture filter control */
#define TIMER0_CHCTL0_INPUT_CH1CAPFLT_msb			12u
#define TIMER0_CHCTL0_INPUT_CH1CAPFLT_lsb			15u
	/* Channel 1 input capture prescaler */
#define TIMER0_CHCTL0_INPUT_CH1CAPPSC_msb			10u
#define TIMER0_CHCTL0_INPUT_CH1CAPPSC_lsb			11u
	/* Channel 1 mode selection */
#define TIMER0_CHCTL0_INPUT_CH1MS_msb				8u
#define TIMER0_CHCTL0_INPUT_CH1MS_lsb				9u
	/* Channel 0 input capture filter control */
#define TIMER0_CHCTL0_INPUT_CH0CAPFLT_msb			4u
#define TIMER0_CHCTL0_INPUT_CH0CAPFLT_lsb			7u
	/* Channel 0 input capture prescaler */
#define TIMER0_CHCTL0_INPUT_CH0CAPPSC_msb			2u
#define TIMER0_CHCTL0_INPUT_CH0CAPPSC_lsb			3u
	/* Channel 0 mode selection */
#define TIMER0_CHCTL0_INPUT_CH0MS_msb				0u
#define TIMER0_CHCTL0_INPUT_CH0MS_lsb				1u

	/* 0x18 */
	uint8_t RESERVED6[0x1C-0x18];

	/* 0x1C: Channel control register 1 (output */
	uint32_t volatile CHCTL1_OUTPUT;
	/* Channel 3 output compare clear enable */
#define TIMER0_CHCTL1_OUTPUT_CH3COMCEN				15u
	/* Channel 3 compare output control */
#define TIMER0_CHCTL1_OUTPUT_CH3COMCTL_msb			12u
#define TIMER0_CHCTL1_OUTPUT_CH3COMCTL_lsb			14u
	/* Channel 3 output compare shadow enable */
#define TIMER0_CHCTL1_OUTPUT_CH3COMSEN				11u
	/* Channel 3 output compare fast enable */
#define TIMER0_CHCTL1_OUTPUT_CH3COMFEN				10u
	/* Channel 3 mode selection */
#define TIMER0_CHCTL1_OUTPUT_CH3MS_msb				8u
#define TIMER0_CHCTL1_OUTPUT_CH3MS_lsb				9u
	/* Channel 2 output compare clear enable */
#define TIMER0_CHCTL1_OUTPUT_CH2COMCEN				7u
	/* Channel 2 compare output control */
#define TIMER0_CHCTL1_OUTPUT_CH2COMCTL_msb			4u
#define TIMER0_CHCTL1_OUTPUT_CH2COMCTL_lsb			6u
	/* Channel 2 compare output shadow enable */
#define TIMER0_CHCTL1_OUTPUT_CH2COMSEN				3u
	/* Channel 2 output compare fast enable */
#define TIMER0_CHCTL1_OUTPUT_CH2COMFEN				2u
	/* Channel 2 I/O mode selection */
#define TIMER0_CHCTL1_OUTPUT_CH2MS_msb				0u
#define TIMER0_CHCTL1_OUTPUT_CH2MS_lsb				1u

