josuah/mcu-gd32vf103/registers.h
	/* 0x1C: Channel control register 1 (input */
	uint32_t volatile CHCTL1_INPUT;
	/* Channel 3 input capture filter control */
#define TIMER0_CHCTL1_INPUT_CH3CAPFLT_msb			12u
#define TIMER0_CHCTL1_INPUT_CH3CAPFLT_lsb			15u
	/* Channel 3 input capture prescaler */
#define TIMER0_CHCTL1_INPUT_CH3CAPPSC_msb			10u
#define TIMER0_CHCTL1_INPUT_CH3CAPPSC_lsb			11u
	/* Channel 3 mode selection */
#define TIMER0_CHCTL1_INPUT_CH3MS_msb				8u
#define TIMER0_CHCTL1_INPUT_CH3MS_lsb				9u
	/* Channel 2 input capture filter control */
#define TIMER0_CHCTL1_INPUT_CH2CAPFLT_msb			4u
#define TIMER0_CHCTL1_INPUT_CH2CAPFLT_lsb			7u
	/* Channel 2 input capture prescaler */
#define TIMER0_CHCTL1_INPUT_CH2CAPPSC_msb			2u
#define TIMER0_CHCTL1_INPUT_CH2CAPPSC_lsb			3u
	/* Channel 2 mode selection */
#define TIMER0_CHCTL1_INPUT_CH2MS_msb				0u
#define TIMER0_CHCTL1_INPUT_CH2MS_lsb				1u

	/* 0x1C */
	uint8_t RESERVED7[0x20-0x1C];

	/* 0x20: Channel control register 2 */
	uint32_t volatile CHCTL2;
	/* Channel 3 capture/compare function polarity */
#define TIMER0_CHCTL2_CH3P					13u
	/* Channel 3 capture/compare function enable */
#define TIMER0_CHCTL2_CH3EN					12u
	/* Channel 2 complementary output polarity */
#define TIMER0_CHCTL2_CH2NP					11u
	/* Channel 2 complementary output enable */
#define TIMER0_CHCTL2_CH2NEN					10u
	/* Channel 2 capture/compare function polarity */
#define TIMER0_CHCTL2_CH2P					9u
	/* Channel 2 capture/compare function enable */
#define TIMER0_CHCTL2_CH2EN					8u
	/* Channel 1 complementary output polarity */
#define TIMER0_CHCTL2_CH1NP					7u
	/* Channel 1 complementary output enable */
#define TIMER0_CHCTL2_CH1NEN					6u
	/* Channel 1 capture/compare function polarity */
#define TIMER0_CHCTL2_CH1P					5u
	/* Channel 1 capture/compare function enable */
#define TIMER0_CHCTL2_CH1EN					4u
	/* Channel 0 complementary output polarity */
#define TIMER0_CHCTL2_CH0NP					3u
	/* Channel 0 complementary output enable */
#define TIMER0_CHCTL2_CH0NEN					2u
	/* Channel 0 capture/compare function polarity */
#define TIMER0_CHCTL2_CH0P					1u
	/* Channel 0 capture/compare function enable */
#define TIMER0_CHCTL2_CH0EN					0u

	/* 0x20 */
	uint8_t RESERVED8[0x24-0x20];

	/* 0x24: counter */
	uint32_t volatile CNT;
	/* current counter value */
#define TIMER0_CNT_CNT_msb					0u
#define TIMER0_CNT_CNT_lsb					15u

	/* 0x24 */
	uint8_t RESERVED9[0x28-0x24];

	/* 0x28: prescaler */
	uint32_t volatile PSC;
	/* Prescaler value of the counter clock */
#define TIMER0_PSC_PSC_msb					0u
#define TIMER0_PSC_PSC_lsb					15u

	/* 0x28 */
	uint8_t RESERVED10[0x2C-0x28];

	/* 0x2C: Counter auto reload register */
	uint32_t volatile CAR;
	/* Counter auto reload value */
#define TIMER0_CAR_CARL_msb					0u
#define TIMER0_CAR_CARL_lsb					15u

	/* 0x2C */
	uint8_t RESERVED11[0x30-0x2C];

	/* 0x30: Counter repetition register */
	uint32_t volatile CREP;
	/* Counter repetition value */
#define TIMER0_CREP_CREP_msb					0u
#define TIMER0_CREP_CREP_lsb					7u

	/* 0x30 */
	uint8_t RESERVED12[0x34-0x30];

	/* 0x34: Channel 0 capture/compare value register */
	uint32_t volatile CH0CV;
	/* Capture or compare value of channel0 */
#define TIMER0_CH0CV_CH0VAL_msb					0u
#define TIMER0_CH0CV_CH0VAL_lsb					15u

	/* 0x34 */
	uint8_t RESERVED13[0x38-0x34];

	/* 0x38: Channel 1 capture/compare value register */
	uint32_t volatile CH1CV;
	/* Capture or compare value of channel1 */
#define TIMER0_CH1CV_CH1VAL_msb					0u
#define TIMER0_CH1CV_CH1VAL_lsb					15u

	/* 0x38 */
	uint8_t RESERVED14[0x3C-0x38];

	/* 0x3C: Channel 2 capture/compare value register */
	uint32_t volatile CH2CV;
	/* Capture or compare value of channel 2 */
#define TIMER0_CH2CV_CH2VAL_msb					0u
#define TIMER0_CH2CV_CH2VAL_lsb					15u

	/* 0x3C */
	uint8_t RESERVED15[0x40-0x3C];

	/* 0x40: Channel 3 capture/compare value register */
	uint32_t volatile CH3CV;
	/* Capture or compare value of channel 3 */
#define TIMER0_CH3CV_CH3VAL_msb					0u
#define TIMER0_CH3CV_CH3VAL_lsb					15u

	/* 0x40 */
	uint8_t RESERVED16[0x44-0x40];

	/* 0x44: channel complementary protection register */
	uint32_t volatile CCHP;
	/* Primary output enable */
#define TIMER0_CCHP_POEN					15u
	/* Output automatic enable */
#define TIMER0_CCHP_OAEN					14u
	/* Break polarity */
#define TIMER0_CCHP_BRKP					13u
	/* Break enable */
#define TIMER0_CCHP_BRKEN					12u
	/* Run mode off-state configure */
#define TIMER0_CCHP_ROS						11u
	/* Idle mode off-state configure */
#define TIMER0_CCHP_IOS						10u
	/* Complementary register protect control */
#define TIMER0_CCHP_PROT_msb					8u
#define TIMER0_CCHP_PROT_lsb					9u
	/* Dead time configure */
#define TIMER0_CCHP_DTCFG_msb					0u
#define TIMER0_CCHP_DTCFG_lsb					7u

	/* 0x44 */
	uint8_t RESERVED17[0x48-0x44];

	/* 0x48: DMA configuration register */
	uint32_t volatile DMACFG;
	/* DMA transfer count */
#define TIMER0_DMACFG_DMATC_msb					8u
#define TIMER0_DMACFG_DMATC_lsb					12u
	/* DMA transfer access start address */
#define TIMER0_DMACFG_DMATA_msb					0u
#define TIMER0_DMACFG_DMATA_lsb					4u

	/* 0x48 */
	uint8_t RESERVED18[0x4C-0x48];

	/* 0x4C: DMA transfer buffer register */
	uint32_t volatile DMATB;
	/* DMA transfer buffer */
#define TIMER0_DMATB_DMATB_msb					0u
#define TIMER0_DMATB_DMATB_lsb					15u

};


#define TIMER1 ((struct sdk_timer1234 *)0x40000000)
#define TIMER2 ((struct sdk_timer1234 *)0x40000400)
#define TIMER3 ((struct sdk_timer1234 *)0x40000800)
#define TIMER4 ((struct sdk_timer1234 *)0x40000C00)

struct sdk_timer1234 {

	/* 0x00: control register 0 */
	uint32_t volatile CTL0;
	/* Clock division */
#define TIMER1_CTL0_CKDIV_msb					8u
#define TIMER1_CTL0_CKDIV_lsb					9u
	/* Auto-reload shadow enable */
#define TIMER1_CTL0_ARSE					7u
	/* Counter aligns mode selection */
#define TIMER1_CTL0_CAM_msb					5u
#define TIMER1_CTL0_CAM_lsb					6u
	/* Direction */
#define TIMER1_CTL0_DIR						4u
	/* Single pulse mode */
#define TIMER1_CTL0_SPM						3u
	/* Update source */
#define TIMER1_CTL0_UPS						2u
	/* Update disable */
#define TIMER1_CTL0_UPDIS					1u
	/* Counter enable */
#define TIMER1_CTL0_CEN						0u

