josuah/mcu-gd32vf103/registers.h
	/* 0x1C: Channel control register 1 (input */
	uint32_t volatile CHCTL1_INPUT;
	/* Channel 3 input capture filter control */
#define TIMER1_CHCTL1_INPUT_CH3CAPFLT_msb			12u
#define TIMER1_CHCTL1_INPUT_CH3CAPFLT_lsb			15u
	/* Channel 3 input capture prescaler */
#define TIMER1_CHCTL1_INPUT_CH3CAPPSC_msb			10u
#define TIMER1_CHCTL1_INPUT_CH3CAPPSC_lsb			11u
	/* Channel 3 mode selection */
#define TIMER1_CHCTL1_INPUT_CH3MS_msb				8u
#define TIMER1_CHCTL1_INPUT_CH3MS_lsb				9u
	/* Channel 2 input capture filter control */
#define TIMER1_CHCTL1_INPUT_CH2CAPFLT_msb			4u
#define TIMER1_CHCTL1_INPUT_CH2CAPFLT_lsb			7u
	/* Channel 2 input capture prescaler */
#define TIMER1_CHCTL1_INPUT_CH2CAPPSC_msb			2u
#define TIMER1_CHCTL1_INPUT_CH2CAPPSC_lsb			3u
	/* Channel 2 mode selection */
#define TIMER1_CHCTL1_INPUT_CH2MS_msb				0u
#define TIMER1_CHCTL1_INPUT_CH2MS_lsb				1u

	/* 0x1C */
	uint8_t RESERVED7[0x20-0x1C];

	/* 0x20: Channel control register 2 */
	uint32_t volatile CHCTL2;
	/* Channel 3 capture/compare function polarity */
#define TIMER1_CHCTL2_CH3P					13u
	/* Channel 3 capture/compare function enable */
#define TIMER1_CHCTL2_CH3EN					12u
	/* Channel 2 capture/compare function polarity */
#define TIMER1_CHCTL2_CH2P					9u
	/* Channel 2 capture/compare function enable */
#define TIMER1_CHCTL2_CH2EN					8u
	/* Channel 1 capture/compare function polarity */
#define TIMER1_CHCTL2_CH1P					5u
	/* Channel 1 capture/compare function enable */
#define TIMER1_CHCTL2_CH1EN					4u
	/* Channel 0 capture/compare function polarity */
#define TIMER1_CHCTL2_CH0P					1u
	/* Channel 0 capture/compare function enable */
#define TIMER1_CHCTL2_CH0EN					0u

	/* 0x20 */
	uint8_t RESERVED8[0x24-0x20];

	/* 0x24: Counter register */
	uint32_t volatile CNT;
	/* counter value */
#define TIMER1_CNT_CNT_msb					0u
#define TIMER1_CNT_CNT_lsb					15u

	/* 0x24 */
	uint8_t RESERVED9[0x28-0x24];

	/* 0x28: Prescaler register */
	uint32_t volatile PSC;
	/* Prescaler value of the counter clock */
#define TIMER1_PSC_PSC_msb					0u
#define TIMER1_PSC_PSC_lsb					15u

	/* 0x28 */
	uint8_t RESERVED10[0x2C-0x28];

	/* 0x2C: Counter auto reload register */
	uint32_t volatile CAR;
	/* Counter auto reload value */
#define TIMER1_CAR_CARL_msb					0u
#define TIMER1_CAR_CARL_lsb					15u

	/* 0x2C */
	uint8_t RESERVED11[0x34-0x2C];

	/* 0x34: Channel 0 capture/compare value register */
	uint32_t volatile CH0CV;
	/* Capture or compare value of channel 0 */
#define TIMER1_CH0CV_CH0VAL_msb					0u
#define TIMER1_CH0CV_CH0VAL_lsb					15u

	/* 0x34 */
	uint8_t RESERVED12[0x38-0x34];

	/* 0x38: Channel 1 capture/compare value register */
	uint32_t volatile CH1CV;
	/* Capture or compare value of channel1 */
#define TIMER1_CH1CV_CH1VAL_msb					0u
#define TIMER1_CH1CV_CH1VAL_lsb					15u

	/* 0x38 */
	uint8_t RESERVED13[0x3C-0x38];

	/* 0x3C: Channel 2 capture/compare value register */
	uint32_t volatile CH2CV;
	/* Capture or compare value of channel 2 */
#define TIMER1_CH2CV_CH2VAL_msb					0u
#define TIMER1_CH2CV_CH2VAL_lsb					15u

	/* 0x3C */
	uint8_t RESERVED14[0x40-0x3C];

	/* 0x40: Channel 3 capture/compare value register */
	uint32_t volatile CH3CV;
	/* Capture or compare value of channel 3 */
#define TIMER1_CH3CV_CH3VAL_msb					0u
#define TIMER1_CH3CV_CH3VAL_lsb					15u

	/* 0x40 */
	uint8_t RESERVED15[0x48-0x40];

	/* 0x48: DMA configuration register */
	uint32_t volatile DMACFG;
	/* DMA transfer count */
#define TIMER1_DMACFG_DMATC_msb					8u
#define TIMER1_DMACFG_DMATC_lsb					12u
	/* DMA transfer access start address */
#define TIMER1_DMACFG_DMATA_msb					0u
#define TIMER1_DMACFG_DMATA_lsb					4u

	/* 0x48 */
	uint8_t RESERVED16[0x4C-0x48];

	/* 0x4C: DMA transfer buffer register */
	uint32_t volatile DMATB;
	/* DMA transfer buffer */
#define TIMER1_DMATB_DMATB_msb					0u
#define TIMER1_DMATB_DMATB_lsb					15u

};


#define TIMER5 ((struct sdk_timer56 *)0x40001000)
#define TIMER6 ((struct sdk_timer56 *)0x40001400)

struct sdk_timer56 {

	/* 0x00: control register 0 */
	uint32_t volatile CTL0;
	/* Auto-reload shadow enable */
#define TIMER5_CTL0_ARSE					7u
	/* Single pulse mode */
#define TIMER5_CTL0_SPM						3u
	/* Update source */
#define TIMER5_CTL0_UPS						2u
	/* Update disable */
#define TIMER5_CTL0_UPDIS					1u
	/* Counter enable */
#define TIMER5_CTL0_CEN						0u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: control register 1 */
	uint32_t volatile CTL1;
	/* Master mode control */
#define TIMER5_CTL1_MMC_msb					4u
#define TIMER5_CTL1_MMC_lsb					6u

	/* 0x04 */
	uint8_t RESERVED1[0x0C-0x04];

	/* 0x0C: DMA/Interrupt enable register */
	uint32_t volatile DMAINTEN;
	/* Update DMA request enable */
#define TIMER5_DMAINTEN_UPDEN					8u
	/* Update interrupt enable */
#define TIMER5_DMAINTEN_UPIE					0u

	/* 0x0C */
	uint8_t RESERVED2[0x10-0x0C];

	/* 0x10: Interrupt flag register */
	uint32_t volatile INTF;
	/* Update interrupt flag */
#define TIMER5_INTF_UPIF					0u

	/* 0x10 */
	uint8_t RESERVED3[0x14-0x10];

	/* 0x14: event generation register */
	uint32_t volatile SWEVG;
	/* Update generation */
#define TIMER5_SWEVG_UPG					0u

	/* 0x14 */
	uint8_t RESERVED4[0x24-0x14];

	/* 0x24: Counter register */
	uint32_t volatile CNT;
	/* Low counter value */
#define TIMER5_CNT_CNT_msb					0u
#define TIMER5_CNT_CNT_lsb					15u

	/* 0x24 */
	uint8_t RESERVED5[0x28-0x24];

	/* 0x28: Prescaler register */
	uint32_t volatile PSC;
	/* Prescaler value of the counter clock */
#define TIMER5_PSC_PSC_msb					0u
#define TIMER5_PSC_PSC_lsb					15u

	/* 0x28 */
	uint8_t RESERVED6[0x2C-0x28];

	/* 0x2C: Counter auto reload register */
	uint32_t volatile CAR;
	/* Counter auto reload value */
#define TIMER5_CAR_CARL_msb					0u
#define TIMER5_CAR_CARL_lsb					15u

};


#define USART0 ((struct sdk_usart *)0x40013800)
#define USART1 ((struct sdk_usart *)0x40004400)
#define USART2 ((struct sdk_usart *)0x40004800)

struct sdk_usart {

	/* 0x00: Status register */
	uint32_t volatile STAT;
	/* CTS change flag */
#define USART_STAT_CTSF						9u
	/* LIN break detection flag */
#define USART_STAT_LBDF						8u
	/* Transmit data buffer empty */
#define USART_STAT_TBE						7u
	/* Transmission complete */
#define USART_STAT_TC						6u
	/* Read data buffer not empty */
#define USART_STAT_RBNE						5u
	/* IDLE frame detected flag */
#define USART_STAT_IDLEF					4u
	/* Overrun error */
#define USART_STAT_ORERR					3u
	/* Noise error flag */
#define USART_STAT_NERR						2u
	/* Frame error flag */
#define USART_STAT_FERR						1u
	/* Parity error flag */
#define USART_STAT_PERR						0u

