josuah/mcu-gd32vf103/registers.h
	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: Data register */
	uint32_t volatile DATA;
	/* Transmit or read data value */
#define USART_DATA_DATA_msb					0u
#define USART_DATA_DATA_lsb					8u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: Baud rate register */
	uint32_t volatile BAUD;
	/* Integer part of baud-rate divider */
#define USART_BAUD_INTDIV_msb					4u
#define USART_BAUD_INTDIV_lsb					15u
	/* Fraction part of baud-rate divider */
#define USART_BAUD_FRADIV_msb					0u
#define USART_BAUD_FRADIV_lsb					3u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C: Control register 0 */
	uint32_t volatile CTL0;
	/* USART enable */
#define USART_CTL0_UEN						13u
	/* Word length */
#define USART_CTL0_WL						12u
	/* Wakeup method in mute mode */
#define USART_CTL0_WM						11u
	/* Parity check function enable */
#define USART_CTL0_PCEN						10u
	/* Parity mode */
#define USART_CTL0_PM						9u
	/* Parity error interrupt enable */
#define USART_CTL0_PERRIE					8u
	/* Transmitter buffer empty interrupt enable */
#define USART_CTL0_TBEIE					7u
	/* Transmission complete interrupt enable */
#define USART_CTL0_TCIE						6u
	/* Read data buffer not empty interrupt and overrun error interrupt enable */
#define USART_CTL0_RBNEIE					5u
	/* IDLE line detected interrupt enable */
#define USART_CTL0_IDLEIE					4u
	/* Transmitter enable */
#define USART_CTL0_TEN						3u
	/* Receiver enable */
#define USART_CTL0_REN						2u
	/* Receiver wakeup from mute mode */
#define USART_CTL0_RWU						1u
	/* Send break command */
#define USART_CTL0_SBKCMD					0u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

	/* 0x10: Control register 1 */
	uint32_t volatile CTL1;
	/* LIN mode enable */
#define USART_CTL1_LMEN						14u
	/* STOP bits length */
#define USART_CTL1_STB_msb					12u
#define USART_CTL1_STB_lsb					13u
	/* CK pin enable */
#define USART_CTL1_CKEN						11u
	/* Clock polarity */
#define USART_CTL1_CPL						10u
	/* Clock phase */
#define USART_CTL1_CPH						9u
	/* CK Length */
#define USART_CTL1_CLEN						8u
	/* LIN break detection interrupt */
#define USART_CTL1_LBDIE					6u
	/* LIN break frame length */
#define USART_CTL1_LBLEN					5u
	/* Address of the USART */
#define USART_CTL1_ADDR_msb					0u
#define USART_CTL1_ADDR_lsb					3u

	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: Control register 2 */
	uint32_t volatile CTL2;
	/* CTS interrupt enable */
#define USART_CTL2_CTSIE					10u
	/* CTS enable */
#define USART_CTL2_CTSEN					9u
	/* RTS enable */
#define USART_CTL2_RTSEN					8u
	/* DMA request enable for transmission */
#define USART_CTL2_DENT						7u
	/* DMA request enable for reception */
#define USART_CTL2_DENR						6u
	/* Smartcard mode enable */
#define USART_CTL2_SCEN						5u
	/* Smartcard NACK enable */
#define USART_CTL2_NKEN						4u
	/* Half-duplex selection */
#define USART_CTL2_HDEN						3u
	/* IrDA low-power */
#define USART_CTL2_IRLP						2u
	/* IrDA mode enable */
#define USART_CTL2_IREN						1u
	/* Error interrupt enable */
#define USART_CTL2_ERRIE					0u

	/* 0x14 */
	uint8_t RESERVED5[0x18-0x14];

	/* 0x18: Guard time and prescaler */
	uint32_t volatile GP;
	/* Guard time value in Smartcard mode */
#define USART_GP_GUAT_msb					8u
#define USART_GP_GUAT_lsb					15u
	/* Prescaler value */
#define USART_GP_PSC_msb					0u
#define USART_GP_PSC_lsb					7u

};


#define UART3 ((struct sdk_uart *)0x40004C00)
#define UART4 ((struct sdk_uart *)0x40005000)

struct sdk_uart {

	/* 0x00: Status register */
	uint32_t volatile STAT;
	/* LIN break detection flag */
#define UART_STAT_LBDF						8u
	/* Transmit data buffer empty */
#define UART_STAT_TBE						7u
	/* Transmission complete */
#define UART_STAT_TC						6u
	/* Read data buffer not empty */
#define UART_STAT_RBNE						5u
	/* IDLE frame detected flag */
#define UART_STAT_IDLEF						4u
	/* Overrun error */
#define UART_STAT_ORERR						3u
	/* Noise error flag */
#define UART_STAT_NERR						2u
	/* Frame error flag */
#define UART_STAT_FERR						1u
	/* Parity error flag */
#define UART_STAT_PERR						0u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: Data register */
	uint32_t volatile DATA;
	/* Transmit or read data value */
#define UART_DATA_DATA_msb					0u
#define UART_DATA_DATA_lsb					8u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: Baud rate register */
	uint32_t volatile BAUD;
	/* Integer part of baud-rate divider */
#define UART_BAUD_INTDIV_msb					4u
#define UART_BAUD_INTDIV_lsb					15u
	/* Fraction part of baud-rate divider */
#define UART_BAUD_FRADIV_msb					0u
#define UART_BAUD_FRADIV_lsb					3u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C: Control register 0 */
	uint32_t volatile CTL0;
	/* USART enable */
#define UART_CTL0_UEN						13u
	/* Word length */
#define UART_CTL0_WL						12u
	/* Wakeup method in mute mode */
#define UART_CTL0_WM						11u
	/* Parity check function enable */
#define UART_CTL0_PCEN						10u
	/* Parity mode */
#define UART_CTL0_PM						9u
	/* Parity error interrupt enable */
#define UART_CTL0_PERRIE					8u
	/* Transmitter buffer empty interrupt enable */
#define UART_CTL0_TBEIE						7u
	/* Transmission complete interrupt enable */
#define UART_CTL0_TCIE						6u
	/* Read data buffer not empty interrupt and overrun error interrupt enable */
#define UART_CTL0_RBNEIE					5u
	/* IDLE line detected interrupt enable */
#define UART_CTL0_IDLEIE					4u
	/* Transmitter enable */
#define UART_CTL0_TEN						3u
	/* Receiver enable */
#define UART_CTL0_REN						2u
	/* Receiver wakeup from mute mode */
#define UART_CTL0_RWU						1u
	/* Send break command */
#define UART_CTL0_SBKCMD					0u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

	/* 0x10: Control register 1 */
	uint32_t volatile CTL1;
	/* LIN mode enable */
#define UART_CTL1_LMEN						14u
	/* STOP bits length */
#define UART_CTL1_STB_msb					12u
#define UART_CTL1_STB_lsb					13u
	/* LIN break detection interrupt */
#define UART_CTL1_LBDIE						6u
	/* LIN break frame length */
#define UART_CTL1_LBLEN						5u
	/* Address of the USART */
#define UART_CTL1_ADDR_msb					0u
#define UART_CTL1_ADDR_lsb					3u

