josuah/mcu-gd32vf103/registers.h
	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: Control register 2 */
	uint32_t volatile CTL2;
	/* DMA request enable for transmission */
#define UART_CTL2_DENT						7u
	/* DMA request enable for reception */
#define UART_CTL2_DENR						6u
	/* Half-duplex selection */
#define UART_CTL2_HDEN						3u
	/* IrDA low-power */
#define UART_CTL2_IRLP						2u
	/* IrDA mode enable */
#define UART_CTL2_IREN						1u
	/* Error interrupt enable */
#define UART_CTL2_ERRIE						0u

	/* 0x14 */
	uint8_t RESERVED5[0x18-0x14];

	/* 0x18: Guard time and prescaler */
	uint32_t volatile GP;
	/* Prescaler value */
#define UART_GP_PSC_msb						0u
#define UART_GP_PSC_lsb						7u

};


#define USBFS_GLOBAL ((struct sdk_usbfs_global *)0x50000000)

struct sdk_usbfs_global {

	/* 0x00: Global OTG control and status register */
	uint32_t volatile GOTGCS;
	/* SRP success */
#define USBFS_GLOBAL_GOTGCS_SRPS				0u
	/* SRP request */
#define USBFS_GLOBAL_GOTGCS_SRPREQ				1u
	/* Host success */
#define USBFS_GLOBAL_GOTGCS_HNPS				8u
	/* HNP request */
#define USBFS_GLOBAL_GOTGCS_HNPREQ				9u
	/* Host HNP enable */
#define USBFS_GLOBAL_GOTGCS_HHNPEN				10u
	/* Device HNP enabled */
#define USBFS_GLOBAL_GOTGCS_DHNPEN				11u
	/* ID pin status */
#define USBFS_GLOBAL_GOTGCS_IDPS				16u
	/* Debounce interval */
#define USBFS_GLOBAL_GOTGCS_DI					17u
	/* A-session valid */
#define USBFS_GLOBAL_GOTGCS_ASV					18u
	/* B-session valid */
#define USBFS_GLOBAL_GOTGCS_BSV					19u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: Global OTG interrupt flag register */
	uint32_t volatile GOTGINTF;
	/* Session end */
#define USBFS_GLOBAL_GOTGINTF_SESEND				2u
	/* Session request success status */
#define USBFS_GLOBAL_GOTGINTF_SRPEND				8u
	/* HNP end */
#define USBFS_GLOBAL_GOTGINTF_HNPEND				9u
	/* Host negotiation request detected */
#define USBFS_GLOBAL_GOTGINTF_HNPDET				17u
	/* A-device timeout */
#define USBFS_GLOBAL_GOTGINTF_ADTO				18u
	/* Debounce finish */
#define USBFS_GLOBAL_GOTGINTF_DF				19u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: Global AHB control and status register */
	uint32_t volatile GAHBCS;
	/* Global interrupt enable */
#define USBFS_GLOBAL_GAHBCS_GINTEN				0u
	/* Tx FIFO threshold */
#define USBFS_GLOBAL_GAHBCS_TXFTH				7u
	/* Periodic Tx FIFO threshold */
#define USBFS_GLOBAL_GAHBCS_PTXFTH				8u

	/* 0x08 */
	uint8_t RESERVED2[0x0C-0x08];

	/* 0x0C: Global USB control and status register */
	uint32_t volatile GUSBCS;
	/* Timeout calibration */
#define USBFS_GLOBAL_GUSBCS_TOC_msb				0u
#define USBFS_GLOBAL_GUSBCS_TOC_lsb				2u
	/* SRP capability enable */
#define USBFS_GLOBAL_GUSBCS_SRPCEN				8u
	/* HNP capability enable */
#define USBFS_GLOBAL_GUSBCS_HNPCEN				9u
	/* USB turnaround time */
#define USBFS_GLOBAL_GUSBCS_UTT_msb				10u
#define USBFS_GLOBAL_GUSBCS_UTT_lsb				13u
	/* Force host mode */
#define USBFS_GLOBAL_GUSBCS_FHM					29u
	/* Force device mode */
#define USBFS_GLOBAL_GUSBCS_FDM					30u

	/* 0x0C */
	uint8_t RESERVED3[0x10-0x0C];

	/* 0x10: Global reset control register (USBFS_GRSTCTL) */
	uint32_t volatile GRSTCTL;
	/* Core soft reset */
#define USBFS_GLOBAL_GRSTCTL_CSRST				0u
	/* HCLK soft reset */
#define USBFS_GLOBAL_GRSTCTL_HCSRST				1u
	/* Host frame counter reset */
#define USBFS_GLOBAL_GRSTCTL_HFCRST				2u
	/* RxFIFO flush */
#define USBFS_GLOBAL_GRSTCTL_RXFF				4u
	/* TxFIFO flush */
#define USBFS_GLOBAL_GRSTCTL_TXFF				5u
	/* TxFIFO number */
#define USBFS_GLOBAL_GRSTCTL_TXFNUM_msb				6u
#define USBFS_GLOBAL_GRSTCTL_TXFNUM_lsb				10u

	/* 0x10 */
	uint8_t RESERVED4[0x14-0x10];

	/* 0x14: Global interrupt flag register (USBFS_GINTF) */
	uint32_t volatile GINTF;
	/* Current operation mode */
#define USBFS_GLOBAL_GINTF_COPM					0u
	/* Mode fault interrupt flag */
#define USBFS_GLOBAL_GINTF_MFIF					1u
	/* OTG interrupt flag */
#define USBFS_GLOBAL_GINTF_OTGIF				2u
	/* Start of frame */
#define USBFS_GLOBAL_GINTF_SOF					3u
	/* RxFIFO non-empty interrupt flag */
#define USBFS_GLOBAL_GINTF_RXFNEIF				4u
	/* Non-periodic TxFIFO empty interrupt flag */
#define USBFS_GLOBAL_GINTF_NPTXFEIF				5u
	/* Global Non-Periodic IN NAK effective */
#define USBFS_GLOBAL_GINTF_GNPINAK				6u
	/* Global OUT NAK effective */
#define USBFS_GLOBAL_GINTF_GONAK				7u
	/* Early suspend */
#define USBFS_GLOBAL_GINTF_ESP					10u
	/* USB suspend */
#define USBFS_GLOBAL_GINTF_SP					11u
	/* USB reset */
#define USBFS_GLOBAL_GINTF_RST					12u
	/* Enumeration finished */
#define USBFS_GLOBAL_GINTF_ENUMF				13u
	/* Isochronous OUT packet dropped */
#define USBFS_GLOBAL_GINTF_ISOOPDIF				14u
	/* End of periodic frame */
#define USBFS_GLOBAL_GINTF_EOPFIF				15u
	/* IN endpoint interrupt flag */
#define USBFS_GLOBAL_GINTF_IEPIF				18u
	/* OUT endpoint interrupt flag */
#define USBFS_GLOBAL_GINTF_OEPIF				19u
	/* Isochronous IN transfer Not Complete Interrupt Flag */
#define USBFS_GLOBAL_GINTF_ISOINCIF				20u
	/* periodic transfer not complete interrupt flag(Host */
#define USBFS_GLOBAL_GINTF_PXNCIF_ISOONCIF			21u
	/* Host port interrupt flag */
#define USBFS_GLOBAL_GINTF_HPIF					24u
	/* Host channels interrupt flag */
#define USBFS_GLOBAL_GINTF_HCIF					25u
	/* Periodic TxFIFO empty interrupt flag */
#define USBFS_GLOBAL_GINTF_PTXFEIF				26u
	/* ID pin status change */
#define USBFS_GLOBAL_GINTF_IDPSC				28u
	/* Disconnect interrupt flag */
#define USBFS_GLOBAL_GINTF_DISCIF				29u
	/* Session interrupt flag */
#define USBFS_GLOBAL_GINTF_SESIF				30u
	/* Wakeup interrupt flag */
#define USBFS_GLOBAL_GINTF_WKUPIF				31u

	/* 0x14 */
	uint8_t RESERVED5[0x18-0x14];

	/* 0x18: Global interrupt enable register */
	uint32_t volatile GINTEN;
	/* Mode fault interrupt */
#define USBFS_GLOBAL_GINTEN_MFIE				1u
	/* OTG interrupt enable */
#define USBFS_GLOBAL_GINTEN_OTGIE				2u
	/* Start of frame interrupt enable */
#define USBFS_GLOBAL_GINTEN_SOFIE				3u
	/* Receive FIFO non-empty */
#define USBFS_GLOBAL_GINTEN_RXFNEIE				4u
	/* Non-periodic TxFIFO empty */
#define USBFS_GLOBAL_GINTEN_NPTXFEIE				5u
	/* Global non-periodic IN NAK effective interrupt enable */
#define USBFS_GLOBAL_GINTEN_GNPINAKIE				6u
	/* Global OUT NAK effective */
#define USBFS_GLOBAL_GINTEN_GONAKIE				7u
	/* Early suspend interrupt enable */
#define USBFS_GLOBAL_GINTEN_ESPIE				10u
	/* USB suspend interrupt enable */
#define USBFS_GLOBAL_GINTEN_SPIE				11u
	/* USB reset interrupt enable */
#define USBFS_GLOBAL_GINTEN_RSTIE				12u
	/* Enumeration finish interrupt enable */
#define USBFS_GLOBAL_GINTEN_ENUMFIE				13u
	/* Isochronous OUT packet dropped interrupt enable */
#define USBFS_GLOBAL_GINTEN_ISOOPDIE				14u
	/* End of periodic frame interrupt enable */
#define USBFS_GLOBAL_GINTEN_EOPFIE				15u
	/* IN endpoints interrupt enable */
#define USBFS_GLOBAL_GINTEN_IEPIE				18u
	/* OUT endpoints interrupt enable */
#define USBFS_GLOBAL_GINTEN_OEPIE				19u
	/* isochronous IN transfer not complete */
#define USBFS_GLOBAL_GINTEN_ISOINCIE				20u
	/* periodic transfer not compelete Interrupt enable(Host */
#define USBFS_GLOBAL_GINTEN_PXNCIE_ISOONCIE			21u
	/* Host port interrupt enable */
#define USBFS_GLOBAL_GINTEN_HPIE				24u
	/* Host channels interrupt enable */
#define USBFS_GLOBAL_GINTEN_HCIE				25u
	/* Periodic TxFIFO empty interrupt enable */
#define USBFS_GLOBAL_GINTEN_PTXFEIE				26u
	/* ID pin status change interrupt enable */
#define USBFS_GLOBAL_GINTEN_IDPSCIE				28u
	/* Disconnect interrupt enable */
#define USBFS_GLOBAL_GINTEN_DISCIE				29u
	/* Session interrupt enable */
#define USBFS_GLOBAL_GINTEN_SESIE				30u
	/* Wakeup interrupt enable */
#define USBFS_GLOBAL_GINTEN_WKUPIE				31u

	/* 0x18 */
	uint8_t RESERVED6[0x1C-0x18];

	/* 0x1C: Global Receive status read(Device */
	uint32_t volatile GRSTATR_DEVICE;
	/* Endpoint number */
#define USBFS_GLOBAL_GRSTATR_DEVICE_EPNUM_msb			0u
#define USBFS_GLOBAL_GRSTATR_DEVICE_EPNUM_lsb			3u
	/* Byte count */
#define USBFS_GLOBAL_GRSTATR_DEVICE_BCOUNT_msb			4u
#define USBFS_GLOBAL_GRSTATR_DEVICE_BCOUNT_lsb			14u
	/* Data PID */
#define USBFS_GLOBAL_GRSTATR_DEVICE_DPID_msb			15u
#define USBFS_GLOBAL_GRSTATR_DEVICE_DPID_lsb			16u
	/* Recieve packet status */
#define USBFS_GLOBAL_GRSTATR_DEVICE_RPCKST_msb			17u
#define USBFS_GLOBAL_GRSTATR_DEVICE_RPCKST_lsb			20u

	/* 0x1C: Global Receive status read(Host */
	uint32_t volatile GRSTATR_HOST;
	/* Channel number */
#define USBFS_GLOBAL_GRSTATR_HOST_CNUM_msb			0u
#define USBFS_GLOBAL_GRSTATR_HOST_CNUM_lsb			3u
	/* Byte count */
#define USBFS_GLOBAL_GRSTATR_HOST_BCOUNT_msb			4u
#define USBFS_GLOBAL_GRSTATR_HOST_BCOUNT_lsb			14u
	/* Data PID */
#define USBFS_GLOBAL_GRSTATR_HOST_DPID_msb			15u
#define USBFS_GLOBAL_GRSTATR_HOST_DPID_lsb			16u
	/* Reivece packet status */
#define USBFS_GLOBAL_GRSTATR_HOST_RPCKST_msb			17u
#define USBFS_GLOBAL_GRSTATR_HOST_RPCKST_lsb			20u

	/* 0x1C */
	uint8_t RESERVED7[0x20-0x1C];

	/* 0x20: Global Receive status pop(Device */
	uint32_t volatile GRSTATP_DEVICE;
	/* Endpoint number */
#define USBFS_GLOBAL_GRSTATP_DEVICE_EPNUM_msb			0u
#define USBFS_GLOBAL_GRSTATP_DEVICE_EPNUM_lsb			3u
	/* Byte count */
#define USBFS_GLOBAL_GRSTATP_DEVICE_BCOUNT_msb			4u
#define USBFS_GLOBAL_GRSTATP_DEVICE_BCOUNT_lsb			14u
	/* Data PID */
#define USBFS_GLOBAL_GRSTATP_DEVICE_DPID_msb			15u
#define USBFS_GLOBAL_GRSTATP_DEVICE_DPID_lsb			16u
	/* Recieve packet status */
#define USBFS_GLOBAL_GRSTATP_DEVICE_RPCKST_msb			17u
#define USBFS_GLOBAL_GRSTATP_DEVICE_RPCKST_lsb			20u

	/* 0x20: Global Receive status pop(Host */
	uint32_t volatile GRSTATP_HOST;
	/* Channel number */
#define USBFS_GLOBAL_GRSTATP_HOST_CNUM_msb			0u
#define USBFS_GLOBAL_GRSTATP_HOST_CNUM_lsb			3u
	/* Byte count */
#define USBFS_GLOBAL_GRSTATP_HOST_BCOUNT_msb			4u
#define USBFS_GLOBAL_GRSTATP_HOST_BCOUNT_lsb			14u
	/* Data PID */
#define USBFS_GLOBAL_GRSTATP_HOST_DPID_msb			15u
#define USBFS_GLOBAL_GRSTATP_HOST_DPID_lsb			16u
	/* Reivece packet status */
#define USBFS_GLOBAL_GRSTATP_HOST_RPCKST_msb			17u
#define USBFS_GLOBAL_GRSTATP_HOST_RPCKST_lsb			20u

