josuah/mcu-gd32vf103/registers.h
	/* 0x20 */
	uint8_t RESERVED8[0x24-0x20];

	/* 0x24: Global Receive FIFO size register */
	uint32_t volatile GRFLEN;
	/* Rx FIFO depth */
#define USBFS_GLOBAL_GRFLEN_RXFD_msb				0u
#define USBFS_GLOBAL_GRFLEN_RXFD_lsb				15u

	/* 0x24 */
	uint8_t RESERVED9[0x28-0x24];

	/* 0x28: Host non-periodic transmit FIFO length register */
	uint32_t volatile HNPTFLEN;
	/* host non-periodic transmit Tx RAM start */
#define USBFS_GLOBAL_HNPTFLEN_HNPTXRSAR_msb			0u
#define USBFS_GLOBAL_HNPTFLEN_HNPTXRSAR_lsb			15u
	/* host non-periodic TxFIFO depth */
#define USBFS_GLOBAL_HNPTFLEN_HNPTXFD_msb			16u
#define USBFS_GLOBAL_HNPTFLEN_HNPTXFD_lsb			31u

	/* 0x28: Device IN endpoint 0 transmit FIFO length */
	uint32_t volatile DIEP0TFLEN;
	/* in endpoint 0 Tx FIFO depth */
#define USBFS_GLOBAL_DIEP0TFLEN_IEP0TXFD_msb			16u
#define USBFS_GLOBAL_DIEP0TFLEN_IEP0TXFD_lsb			31u
	/* in endpoint 0 Tx RAM start address */
#define USBFS_GLOBAL_DIEP0TFLEN_IEP0TXRSAR_msb			0u
#define USBFS_GLOBAL_DIEP0TFLEN_IEP0TXRSAR_lsb			15u

	/* 0x28 */
	uint8_t RESERVED10[0x2C-0x28];

	/* 0x2C: Host non-periodic transmit FIFO/queue */
	uint32_t volatile HNPTFQSTAT;
	/* Non-periodic TxFIFO space */
#define USBFS_GLOBAL_HNPTFQSTAT_NPTXFS_msb			0u
#define USBFS_GLOBAL_HNPTFQSTAT_NPTXFS_lsb			15u
	/* Non-periodic transmit request queue */
#define USBFS_GLOBAL_HNPTFQSTAT_NPTXRQS_msb			16u
#define USBFS_GLOBAL_HNPTFQSTAT_NPTXRQS_lsb			23u
	/* Top of the non-periodic transmit request */
#define USBFS_GLOBAL_HNPTFQSTAT_NPTXRQTOP_msb			24u
#define USBFS_GLOBAL_HNPTFQSTAT_NPTXRQTOP_lsb			30u

	/* 0x2C */
	uint8_t RESERVED11[0x38-0x2C];

	/* 0x38: Global core configuration register (USBFS_GCCFG) */
	uint32_t volatile GCCFG;
	/* Power on */
#define USBFS_GLOBAL_GCCFG_PWRON				16u
	/* The VBUS A-device Comparer enable */
#define USBFS_GLOBAL_GCCFG_VBUSACEN				18u
	/* The VBUS B-device Comparer enable */
#define USBFS_GLOBAL_GCCFG_VBUSBCEN				19u
	/* SOF output enable */
#define USBFS_GLOBAL_GCCFG_SOFOEN				20u
	/* VBUS ignored */
#define USBFS_GLOBAL_GCCFG_VBUSIG				21u

	/* 0x38 */
	uint8_t RESERVED12[0x3C-0x38];

	/* 0x3C: core ID register */
	uint32_t volatile CID;
	/* Core ID */
#define USBFS_GLOBAL_CID_CID_msb				0u
#define USBFS_GLOBAL_CID_CID_lsb				31u

	/* 0x3C */
	uint8_t RESERVED13[0x100-0x3C];

	/* 0x100: Host periodic transmit FIFO length register (HPTFLEN) */
	uint32_t volatile HPTFLEN;
	/* Host periodic TxFIFO start */
#define USBFS_GLOBAL_HPTFLEN_HPTXFSAR_msb			0u
#define USBFS_GLOBAL_HPTFLEN_HPTXFSAR_lsb			15u
	/* Host periodic TxFIFO depth */
#define USBFS_GLOBAL_HPTFLEN_HPTXFD_msb				16u
#define USBFS_GLOBAL_HPTFLEN_HPTXFD_lsb				31u

	/* 0x100 */
	uint8_t RESERVED14[0x104-0x100];

	/* 0x104: device IN endpoint transmit FIFO size */
	uint32_t volatile DIEP1TFLEN;
	/* IN endpoint FIFO transmit RAM start */
#define USBFS_GLOBAL_DIEP1TFLEN_IEPTXRSAR_msb			0u
#define USBFS_GLOBAL_DIEP1TFLEN_IEPTXRSAR_lsb			15u
	/* IN endpoint TxFIFO depth */
#define USBFS_GLOBAL_DIEP1TFLEN_IEPTXFD_msb			16u
#define USBFS_GLOBAL_DIEP1TFLEN_IEPTXFD_lsb			31u

	/* 0x104 */
	uint8_t RESERVED15[0x108-0x104];

	/* 0x108: device IN endpoint transmit FIFO size */
	uint32_t volatile DIEP2TFLEN;
	/* IN endpoint FIFO transmit RAM start */
#define USBFS_GLOBAL_DIEP2TFLEN_IEPTXRSAR_msb			0u
#define USBFS_GLOBAL_DIEP2TFLEN_IEPTXRSAR_lsb			15u
	/* IN endpoint TxFIFO depth */
#define USBFS_GLOBAL_DIEP2TFLEN_IEPTXFD_msb			16u
#define USBFS_GLOBAL_DIEP2TFLEN_IEPTXFD_lsb			31u

	/* 0x108 */
	uint8_t RESERVED16[0x10C-0x108];

	/* 0x10C: device IN endpoint transmit FIFO size */
	uint32_t volatile DIEP3TFLEN;
	/* IN endpoint FIFO4 transmit RAM start */
#define USBFS_GLOBAL_DIEP3TFLEN_IEPTXRSAR_msb			0u
#define USBFS_GLOBAL_DIEP3TFLEN_IEPTXRSAR_lsb			15u
	/* IN endpoint TxFIFO depth */
#define USBFS_GLOBAL_DIEP3TFLEN_IEPTXFD_msb			16u
#define USBFS_GLOBAL_DIEP3TFLEN_IEPTXFD_lsb			31u

};


#define USBFS_HOST ((struct sdk_usbfs_host *)0x50000400)

struct sdk_usbfs_host {

	/* 0x00: host configuration register */
	uint32_t volatile HCTL;
	/* clock select for USB clock */
#define USBFS_HOST_HCTL_CLKSEL_msb				0u
#define USBFS_HOST_HCTL_CLKSEL_lsb				1u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: Host frame interval */
	uint32_t volatile HFT;
	/* Frame interval */
#define USBFS_HOST_HFT_FRI_msb					0u
#define USBFS_HOST_HFT_FRI_lsb					15u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: FS host frame number/frame time */
	uint32_t volatile HFINFR;
	/* Frame number */
#define USBFS_HOST_HFINFR_FRNUM_msb				0u
#define USBFS_HOST_HFINFR_FRNUM_lsb				15u
	/* Frame remaining time */
#define USBFS_HOST_HFINFR_FRT_msb				16u
#define USBFS_HOST_HFINFR_FRT_lsb				31u

	/* 0x08 */
	uint8_t RESERVED2[0x10-0x08];

	/* 0x10: Host periodic transmit FIFO/queue */
	uint32_t volatile HPTFQSTAT;
	/* Periodic transmit data FIFO space */
#define USBFS_HOST_HPTFQSTAT_PTXFS_msb				0u
#define USBFS_HOST_HPTFQSTAT_PTXFS_lsb				15u
	/* Periodic transmit request queue space */
#define USBFS_HOST_HPTFQSTAT_PTXREQS_msb			16u
#define USBFS_HOST_HPTFQSTAT_PTXREQS_lsb			23u
	/* Top of the periodic transmit request */
#define USBFS_HOST_HPTFQSTAT_PTXREQT_msb			24u
#define USBFS_HOST_HPTFQSTAT_PTXREQT_lsb			31u

	/* 0x10 */
	uint8_t RESERVED3[0x14-0x10];

	/* 0x14:  */
	uint32_t volatile HACHINT;
	/* Host all channel interrupts */
#define USBFS_HOST_HACHINT_HACHINT_msb				0u
#define USBFS_HOST_HACHINT_HACHINT_lsb				7u

	/* 0x14 */
	uint8_t RESERVED4[0x18-0x14];

	/* 0x18: host all channels interrupt mask */
	uint32_t volatile HACHINTEN;
	/* Channel interrupt enable */
#define USBFS_HOST_HACHINTEN_CINTEN_msb				0u
#define USBFS_HOST_HACHINTEN_CINTEN_lsb				7u

	/* 0x18 */
	uint8_t RESERVED5[0x40-0x18];

	/* 0x40: Host port control and status register (USBFS_HPCS) */
	uint32_t volatile HPCS;
	/* Port connect status */
#define USBFS_HOST_HPCS_PCST					0u
	/* Port connect detected */
#define USBFS_HOST_HPCS_PCD					1u
	/* Port enable */
#define USBFS_HOST_HPCS_PE					2u
	/* Port enable/disable change */
#define USBFS_HOST_HPCS_PEDC					3u
	/* Port resume */
#define USBFS_HOST_HPCS_PREM					6u
	/* Port suspend */
#define USBFS_HOST_HPCS_PSP					7u
	/* Port reset */
#define USBFS_HOST_HPCS_PRST					8u
	/* Port line status */
#define USBFS_HOST_HPCS_PLST_msb				10u
#define USBFS_HOST_HPCS_PLST_lsb				11u
	/* Port power */
#define USBFS_HOST_HPCS_PP					12u
	/* Port speed */
#define USBFS_HOST_HPCS_PS_msb					17u
#define USBFS_HOST_HPCS_PS_lsb					18u

