josuah/mcu-gd32vf103/registers.h
	/* 0x40 */
	uint8_t RESERVED6[0x100-0x40];

	/* 0x100: host channel-0 characteristics */
	uint32_t volatile HCH0CTL;
	/* Maximum packet size */
#define USBFS_HOST_HCH0CTL_MPL_msb				0u
#define USBFS_HOST_HCH0CTL_MPL_lsb				10u
	/* Endpoint number */
#define USBFS_HOST_HCH0CTL_EPNUM_msb				11u
#define USBFS_HOST_HCH0CTL_EPNUM_lsb				14u
	/* Endpoint direction */
#define USBFS_HOST_HCH0CTL_EPDIR				15u
	/* Low-speed device */
#define USBFS_HOST_HCH0CTL_LSD					17u
	/* Endpoint type */
#define USBFS_HOST_HCH0CTL_EPTYPE_msb				18u
#define USBFS_HOST_HCH0CTL_EPTYPE_lsb				19u
	/* Device address */
#define USBFS_HOST_HCH0CTL_DAR_msb				22u
#define USBFS_HOST_HCH0CTL_DAR_lsb				28u
	/* Odd frame */
#define USBFS_HOST_HCH0CTL_ODDFRM				29u
	/* Channel disable */
#define USBFS_HOST_HCH0CTL_CDIS					30u
	/* Channel enable */
#define USBFS_HOST_HCH0CTL_CEN					31u

	/* 0x100 */
	uint8_t RESERVED7[0x120-0x100];

	/* 0x120:  */
	uint32_t volatile HCH1CTL;
	/* Maximum packet size */
#define USBFS_HOST_HCH1CTL_MPL_msb				0u
#define USBFS_HOST_HCH1CTL_MPL_lsb				10u
	/* Endpoint number */
#define USBFS_HOST_HCH1CTL_EPNUM_msb				11u
#define USBFS_HOST_HCH1CTL_EPNUM_lsb				14u
	/* Endpoint direction */
#define USBFS_HOST_HCH1CTL_EPDIR				15u
	/* Low-speed device */
#define USBFS_HOST_HCH1CTL_LSD					17u
	/* Endpoint type */
#define USBFS_HOST_HCH1CTL_EPTYPE_msb				18u
#define USBFS_HOST_HCH1CTL_EPTYPE_lsb				19u
	/* Device address */
#define USBFS_HOST_HCH1CTL_DAR_msb				22u
#define USBFS_HOST_HCH1CTL_DAR_lsb				28u
	/* Odd frame */
#define USBFS_HOST_HCH1CTL_ODDFRM				29u
	/* Channel disable */
#define USBFS_HOST_HCH1CTL_CDIS					30u
	/* Channel enable */
#define USBFS_HOST_HCH1CTL_CEN					31u

	/* 0x120 */
	uint8_t RESERVED8[0x140-0x120];

	/* 0x140: host channel-2 characteristics */
	uint32_t volatile HCH2CTL;
	/* Maximum packet size */
#define USBFS_HOST_HCH2CTL_MPL_msb				0u
#define USBFS_HOST_HCH2CTL_MPL_lsb				10u
	/* Endpoint number */
#define USBFS_HOST_HCH2CTL_EPNUM_msb				11u
#define USBFS_HOST_HCH2CTL_EPNUM_lsb				14u
	/* Endpoint direction */
#define USBFS_HOST_HCH2CTL_EPDIR				15u
	/* Low-speed device */
#define USBFS_HOST_HCH2CTL_LSD					17u
	/* Endpoint type */
#define USBFS_HOST_HCH2CTL_EPTYPE_msb				18u
#define USBFS_HOST_HCH2CTL_EPTYPE_lsb				19u
	/* Device address */
#define USBFS_HOST_HCH2CTL_DAR_msb				22u
#define USBFS_HOST_HCH2CTL_DAR_lsb				28u
	/* Odd frame */
#define USBFS_HOST_HCH2CTL_ODDFRM				29u
	/* Channel disable */
#define USBFS_HOST_HCH2CTL_CDIS					30u
	/* Channel enable */
#define USBFS_HOST_HCH2CTL_CEN					31u

	/* 0x140 */
	uint8_t RESERVED9[0x160-0x140];

	/* 0x160: host channel-3 characteristics */
	uint32_t volatile HCH3CTL;
	/* Maximum packet size */
#define USBFS_HOST_HCH3CTL_MPL_msb				0u
#define USBFS_HOST_HCH3CTL_MPL_lsb				10u
	/* Endpoint number */
#define USBFS_HOST_HCH3CTL_EPNUM_msb				11u
#define USBFS_HOST_HCH3CTL_EPNUM_lsb				14u
	/* Endpoint direction */
#define USBFS_HOST_HCH3CTL_EPDIR				15u
	/* Low-speed device */
#define USBFS_HOST_HCH3CTL_LSD					17u
	/* Endpoint type */
#define USBFS_HOST_HCH3CTL_EPTYPE_msb				18u
#define USBFS_HOST_HCH3CTL_EPTYPE_lsb				19u
	/* Device address */
#define USBFS_HOST_HCH3CTL_DAR_msb				22u
#define USBFS_HOST_HCH3CTL_DAR_lsb				28u
	/* Odd frame */
#define USBFS_HOST_HCH3CTL_ODDFRM				29u
	/* Channel disable */
#define USBFS_HOST_HCH3CTL_CDIS					30u
	/* Channel enable */
#define USBFS_HOST_HCH3CTL_CEN					31u

	/* 0x160 */
	uint8_t RESERVED10[0x180-0x160];

	/* 0x180:  */
	uint32_t volatile HCH4CTL;
	/* Maximum packet size */
#define USBFS_HOST_HCH4CTL_MPL_msb				0u
#define USBFS_HOST_HCH4CTL_MPL_lsb				10u
	/* Endpoint number */
#define USBFS_HOST_HCH4CTL_EPNUM_msb				11u
#define USBFS_HOST_HCH4CTL_EPNUM_lsb				14u
	/* Endpoint direction */
#define USBFS_HOST_HCH4CTL_EPDIR				15u
	/* Low-speed device */
#define USBFS_HOST_HCH4CTL_LSD					17u
	/* Endpoint type */
#define USBFS_HOST_HCH4CTL_EPTYPE_msb				18u
#define USBFS_HOST_HCH4CTL_EPTYPE_lsb				19u
	/* Device address */
#define USBFS_HOST_HCH4CTL_DAR_msb				22u
#define USBFS_HOST_HCH4CTL_DAR_lsb				28u
	/* Odd frame */
#define USBFS_HOST_HCH4CTL_ODDFRM				29u
	/* Channel disable */
#define USBFS_HOST_HCH4CTL_CDIS					30u
	/* Channel enable */
#define USBFS_HOST_HCH4CTL_CEN					31u

	/* 0x180 */
	uint8_t RESERVED11[0x1A0-0x180];

	/* 0x1A0: host channel-5 characteristics */
	uint32_t volatile HCH5CTL;
	/* Maximum packet size */
#define USBFS_HOST_HCH5CTL_MPL_msb				0u
#define USBFS_HOST_HCH5CTL_MPL_lsb				10u
	/* Endpoint number */
#define USBFS_HOST_HCH5CTL_EPNUM_msb				11u
#define USBFS_HOST_HCH5CTL_EPNUM_lsb				14u
	/* Endpoint direction */
#define USBFS_HOST_HCH5CTL_EPDIR				15u
	/* Low-speed device */
#define USBFS_HOST_HCH5CTL_LSD					17u
	/* Endpoint type */
#define USBFS_HOST_HCH5CTL_EPTYPE_msb				18u
#define USBFS_HOST_HCH5CTL_EPTYPE_lsb				19u
	/* Device address */
#define USBFS_HOST_HCH5CTL_DAR_msb				22u
#define USBFS_HOST_HCH5CTL_DAR_lsb				28u
	/* Odd frame */
#define USBFS_HOST_HCH5CTL_ODDFRM				29u
	/* Channel disable */
#define USBFS_HOST_HCH5CTL_CDIS					30u
	/* Channel enable */
#define USBFS_HOST_HCH5CTL_CEN					31u

	/* 0x1A0 */
	uint8_t RESERVED12[0x1C0-0x1A0];

	/* 0x1C0: host channel-6 characteristics */
	uint32_t volatile HCH6CTL;
	/* Maximum packet size */
#define USBFS_HOST_HCH6CTL_MPL_msb				0u
#define USBFS_HOST_HCH6CTL_MPL_lsb				10u
	/* Endpoint number */
#define USBFS_HOST_HCH6CTL_EPNUM_msb				11u
#define USBFS_HOST_HCH6CTL_EPNUM_lsb				14u
	/* Endpoint direction */
#define USBFS_HOST_HCH6CTL_EPDIR				15u
	/* Low-speed device */
#define USBFS_HOST_HCH6CTL_LSD					17u
	/* Endpoint type */
#define USBFS_HOST_HCH6CTL_EPTYPE_msb				18u
#define USBFS_HOST_HCH6CTL_EPTYPE_lsb				19u
	/* Device address */
#define USBFS_HOST_HCH6CTL_DAR_msb				22u
#define USBFS_HOST_HCH6CTL_DAR_lsb				28u
	/* Odd frame */
#define USBFS_HOST_HCH6CTL_ODDFRM				29u
	/* Channel disable */
#define USBFS_HOST_HCH6CTL_CDIS					30u
	/* Channel enable */
#define USBFS_HOST_HCH6CTL_CEN					31u

	/* 0x1C0 */
	uint8_t RESERVED13[0x1E0-0x1C0];

