josuah/mcu-gd32vf103/registers.h
	/* 0x1E0: host channel-7 characteristics */
	uint32_t volatile HCH7CTL;
	/* Maximum packet size */
#define USBFS_HOST_HCH7CTL_MPL_msb				0u
#define USBFS_HOST_HCH7CTL_MPL_lsb				10u
	/* Endpoint number */
#define USBFS_HOST_HCH7CTL_EPNUM_msb				11u
#define USBFS_HOST_HCH7CTL_EPNUM_lsb				14u
	/* Endpoint direction */
#define USBFS_HOST_HCH7CTL_EPDIR				15u
	/* Low-speed device */
#define USBFS_HOST_HCH7CTL_LSD					17u
	/* Endpoint type */
#define USBFS_HOST_HCH7CTL_EPTYPE_msb				18u
#define USBFS_HOST_HCH7CTL_EPTYPE_lsb				19u
	/* Device address */
#define USBFS_HOST_HCH7CTL_DAR_msb				22u
#define USBFS_HOST_HCH7CTL_DAR_lsb				28u
	/* Odd frame */
#define USBFS_HOST_HCH7CTL_ODDFRM				29u
	/* Channel disable */
#define USBFS_HOST_HCH7CTL_CDIS					30u
	/* Channel enable */
#define USBFS_HOST_HCH7CTL_CEN					31u

	/* 0x108: host channel-0 interrupt register */
	uint32_t volatile HCH0INTF;
	/* Transfer finished */
#define USBFS_HOST_HCH0INTF_TF					0u
	/* Channel halted */
#define USBFS_HOST_HCH0INTF_CH					1u
	/* STALL response received */
#define USBFS_HOST_HCH0INTF_STALL				3u
	/* NAK response received */
#define USBFS_HOST_HCH0INTF_NAK					4u
	/* ACK response received/transmitted */
#define USBFS_HOST_HCH0INTF_ACK					5u
	/* USB bus error */
#define USBFS_HOST_HCH0INTF_USBER				7u
	/* Babble error */
#define USBFS_HOST_HCH0INTF_BBER				8u
	/* Request queue overrun */
#define USBFS_HOST_HCH0INTF_REQOVR				9u
	/* Data toggle error */
#define USBFS_HOST_HCH0INTF_DTER				10u

	/* 0x108 */
	uint8_t RESERVED14[0x128-0x108];

	/* 0x128: host channel-1 interrupt register */
	uint32_t volatile HCH1INTF;
	/* Transfer finished */
#define USBFS_HOST_HCH1INTF_TF					0u
	/* Channel halted */
#define USBFS_HOST_HCH1INTF_CH					1u
	/* STALL response received */
#define USBFS_HOST_HCH1INTF_STALL				3u
	/* NAK response received */
#define USBFS_HOST_HCH1INTF_NAK					4u
	/* ACK response received/transmitted */
#define USBFS_HOST_HCH1INTF_ACK					5u
	/* USB bus error */
#define USBFS_HOST_HCH1INTF_USBER				7u
	/* Babble error */
#define USBFS_HOST_HCH1INTF_BBER				8u
	/* Request queue overrun */
#define USBFS_HOST_HCH1INTF_REQOVR				9u
	/* Data toggle error */
#define USBFS_HOST_HCH1INTF_DTER				10u

	/* 0x128 */
	uint8_t RESERVED15[0x148-0x128];

	/* 0x148: host channel-2 interrupt register */
	uint32_t volatile HCH2INTF;
	/* Transfer finished */
#define USBFS_HOST_HCH2INTF_TF					0u
	/* Channel halted */
#define USBFS_HOST_HCH2INTF_CH					1u
	/* STALL response received */
#define USBFS_HOST_HCH2INTF_STALL				3u
	/* NAK response received */
#define USBFS_HOST_HCH2INTF_NAK					4u
	/* ACK response received/transmitted */
#define USBFS_HOST_HCH2INTF_ACK					5u
	/* USB bus error */
#define USBFS_HOST_HCH2INTF_USBER				7u
	/* Babble error */
#define USBFS_HOST_HCH2INTF_BBER				8u
	/* Request queue overrun */
#define USBFS_HOST_HCH2INTF_REQOVR				9u
	/* Data toggle error */
#define USBFS_HOST_HCH2INTF_DTER				10u

	/* 0x148 */
	uint8_t RESERVED16[0x168-0x148];

	/* 0x168: host channel-3 interrupt register */
	uint32_t volatile HCH3INTF;
	/* Transfer finished */
#define USBFS_HOST_HCH3INTF_TF					0u
	/* Channel halted */
#define USBFS_HOST_HCH3INTF_CH					1u
	/* STALL response received */
#define USBFS_HOST_HCH3INTF_STALL				3u
	/* NAK response received */
#define USBFS_HOST_HCH3INTF_NAK					4u
	/* ACK response received/transmitted */
#define USBFS_HOST_HCH3INTF_ACK					5u
	/* USB bus error */
#define USBFS_HOST_HCH3INTF_USBER				7u
	/* Babble error */
#define USBFS_HOST_HCH3INTF_BBER				8u
	/* Request queue overrun */
#define USBFS_HOST_HCH3INTF_REQOVR				9u
	/* Data toggle error */
#define USBFS_HOST_HCH3INTF_DTER				10u

	/* 0x168 */
	uint8_t RESERVED17[0x188-0x168];

	/* 0x188: host channel-4 interrupt register */
	uint32_t volatile HCH4INTF;
	/* Transfer finished */
#define USBFS_HOST_HCH4INTF_TF					0u
	/* Channel halted */
#define USBFS_HOST_HCH4INTF_CH					1u
	/* STALL response received */
#define USBFS_HOST_HCH4INTF_STALL				3u
	/* NAK response received */
#define USBFS_HOST_HCH4INTF_NAK					4u
	/* ACK response received/transmitted */
#define USBFS_HOST_HCH4INTF_ACK					5u
	/* USB bus error */
#define USBFS_HOST_HCH4INTF_USBER				7u
	/* Babble error */
#define USBFS_HOST_HCH4INTF_BBER				8u
	/* Request queue overrun */
#define USBFS_HOST_HCH4INTF_REQOVR				9u
	/* Data toggle error */
#define USBFS_HOST_HCH4INTF_DTER				10u

	/* 0x188 */
	uint8_t RESERVED18[0x1A8-0x188];

	/* 0x1A8: host channel-5 interrupt register */
	uint32_t volatile HCH5INTF;
	/* Transfer finished */
#define USBFS_HOST_HCH5INTF_TF					0u
	/* Channel halted */
#define USBFS_HOST_HCH5INTF_CH					1u
	/* STALL response received */
#define USBFS_HOST_HCH5INTF_STALL				3u
	/* NAK response received */
#define USBFS_HOST_HCH5INTF_NAK					4u
	/* ACK response received/transmitted */
#define USBFS_HOST_HCH5INTF_ACK					5u
	/* USB bus error */
#define USBFS_HOST_HCH5INTF_USBER				7u
	/* Babble error */
#define USBFS_HOST_HCH5INTF_BBER				8u
	/* Request queue overrun */
#define USBFS_HOST_HCH5INTF_REQOVR				9u
	/* Data toggle error */
#define USBFS_HOST_HCH5INTF_DTER				10u

	/* 0x1A8 */
	uint8_t RESERVED19[0x1C8-0x1A8];

	/* 0x1C8: host channel-6 interrupt register */
	uint32_t volatile HCH6INTF;
	/* Transfer finished */
#define USBFS_HOST_HCH6INTF_TF					0u
	/* Channel halted */
#define USBFS_HOST_HCH6INTF_CH					1u
	/* STALL response received */
#define USBFS_HOST_HCH6INTF_STALL				3u
	/* NAK response received */
#define USBFS_HOST_HCH6INTF_NAK					4u
	/* ACK response received/transmitted */
#define USBFS_HOST_HCH6INTF_ACK					5u
	/* USB bus error */
#define USBFS_HOST_HCH6INTF_USBER				7u
	/* Babble error */
#define USBFS_HOST_HCH6INTF_BBER				8u
	/* Request queue overrun */
#define USBFS_HOST_HCH6INTF_REQOVR				9u
	/* Data toggle error */
#define USBFS_HOST_HCH6INTF_DTER				10u

	/* 0x1C8 */
	uint8_t RESERVED20[0x1E8-0x1C8];

	/* 0x1E8: host channel-7 interrupt register */
	uint32_t volatile HCH7INTF;
	/* Transfer finished */
#define USBFS_HOST_HCH7INTF_TF					0u
	/* Channel halted */
#define USBFS_HOST_HCH7INTF_CH					1u
	/* STALL response received */
#define USBFS_HOST_HCH7INTF_STALL				3u
	/* NAK response received */
#define USBFS_HOST_HCH7INTF_NAK					4u
	/* ACK response received/transmitted */
#define USBFS_HOST_HCH7INTF_ACK					5u
	/* USB bus error */
#define USBFS_HOST_HCH7INTF_USBER				7u
	/* Babble error */
#define USBFS_HOST_HCH7INTF_BBER				8u
	/* Request queue overrun */
#define USBFS_HOST_HCH7INTF_REQOVR				9u
	/* Data toggle error */
#define USBFS_HOST_HCH7INTF_DTER				10u

	/* 0x10C: host channel-0 interrupt enable register */
	uint32_t volatile HCH0INTEN;
	/* Transfer completed interrupt enable */
#define USBFS_HOST_HCH0INTEN_TFIE				0u
	/* Channel halted interrupt enable */
#define USBFS_HOST_HCH0INTEN_CHIE				1u
	/* STALL interrupt enable */
#define USBFS_HOST_HCH0INTEN_STALLIE				3u
	/* NAK interrupt enable */
#define USBFS_HOST_HCH0INTEN_NAKIE				4u
	/* ACK interrupt enable */
#define USBFS_HOST_HCH0INTEN_ACKIE				5u
	/* USB bus error interrupt enable */
#define USBFS_HOST_HCH0INTEN_USBERIE				7u
	/* Babble error interrupt enable */
#define USBFS_HOST_HCH0INTEN_BBERIE				8u
	/* request queue overrun interrupt enable */
#define USBFS_HOST_HCH0INTEN_REQOVRIE				9u
	/* Data toggle error interrupt enable */
#define USBFS_HOST_HCH0INTEN_DTERIE				10u

	/* 0x10C */
	uint8_t RESERVED21[0x12C-0x10C];

