josuah/mcu-gd32vf103/registers.h
	/* 0x12C: host channel-1 interrupt enable register */
	uint32_t volatile HCH1INTEN;
	/* Transfer completed interrupt enable */
#define USBFS_HOST_HCH1INTEN_TFIE				0u
	/* Channel halted interrupt enable */
#define USBFS_HOST_HCH1INTEN_CHIE				1u
	/* STALL interrupt enable */
#define USBFS_HOST_HCH1INTEN_STALLIE				3u
	/* NAK interrupt enable */
#define USBFS_HOST_HCH1INTEN_NAKIE				4u
	/* ACK interrupt enable */
#define USBFS_HOST_HCH1INTEN_ACKIE				5u
	/* USB bus error interrupt enable */
#define USBFS_HOST_HCH1INTEN_USBERIE				7u
	/* Babble error interrupt enable */
#define USBFS_HOST_HCH1INTEN_BBERIE				8u
	/* request queue overrun interrupt enable */
#define USBFS_HOST_HCH1INTEN_REQOVRIE				9u
	/* Data toggle error interrupt enable */
#define USBFS_HOST_HCH1INTEN_DTERIE				10u

	/* 0x12C */
	uint8_t RESERVED22[0x14C-0x12C];

	/* 0x14C: host channel-2 interrupt enable register */
	uint32_t volatile HCH2INTEN;
	/* Transfer completed interrupt enable */
#define USBFS_HOST_HCH2INTEN_TFIE				0u
	/* Channel halted interrupt enable */
#define USBFS_HOST_HCH2INTEN_CHIE				1u
	/* STALL interrupt enable */
#define USBFS_HOST_HCH2INTEN_STALLIE				3u
	/* NAK interrupt enable */
#define USBFS_HOST_HCH2INTEN_NAKIE				4u
	/* ACK interrupt enable */
#define USBFS_HOST_HCH2INTEN_ACKIE				5u
	/* USB bus error interrupt enable */
#define USBFS_HOST_HCH2INTEN_USBERIE				7u
	/* Babble error interrupt enable */
#define USBFS_HOST_HCH2INTEN_BBERIE				8u
	/* request queue overrun interrupt enable */
#define USBFS_HOST_HCH2INTEN_REQOVRIE				9u
	/* Data toggle error interrupt enable */
#define USBFS_HOST_HCH2INTEN_DTERIE				10u

	/* 0x14C */
	uint8_t RESERVED23[0x16C-0x14C];

	/* 0x16C: host channel-3 interrupt enable register */
	uint32_t volatile HCH3INTEN;
	/* Transfer completed interrupt enable */
#define USBFS_HOST_HCH3INTEN_TFIE				0u
	/* Channel halted interrupt enable */
#define USBFS_HOST_HCH3INTEN_CHIE				1u
	/* STALL interrupt enable */
#define USBFS_HOST_HCH3INTEN_STALLIE				3u
	/* NAK interrupt enable */
#define USBFS_HOST_HCH3INTEN_NAKIE				4u
	/* ACK interrupt enable */
#define USBFS_HOST_HCH3INTEN_ACKIE				5u
	/* USB bus error interrupt enable */
#define USBFS_HOST_HCH3INTEN_USBERIE				7u
	/* Babble error interrupt enable */
#define USBFS_HOST_HCH3INTEN_BBERIE				8u
	/* request queue overrun interrupt enable */
#define USBFS_HOST_HCH3INTEN_REQOVRIE				9u
	/* Data toggle error interrupt enable */
#define USBFS_HOST_HCH3INTEN_DTERIE				10u

	/* 0x16C */
	uint8_t RESERVED24[0x18C-0x16C];

	/* 0x18C: host channel-4 interrupt enable register */
	uint32_t volatile HCH4INTEN;
	/* Transfer completed interrupt enable */
#define USBFS_HOST_HCH4INTEN_TFIE				0u
	/* Channel halted interrupt enable */
#define USBFS_HOST_HCH4INTEN_CHIE				1u
	/* STALL interrupt enable */
#define USBFS_HOST_HCH4INTEN_STALLIE				3u
	/* NAK interrupt enable */
#define USBFS_HOST_HCH4INTEN_NAKIE				4u
	/* ACK interrupt enable */
#define USBFS_HOST_HCH4INTEN_ACKIE				5u
	/* USB bus error interrupt enable */
#define USBFS_HOST_HCH4INTEN_USBERIE				7u
	/* Babble error interrupt enable */
#define USBFS_HOST_HCH4INTEN_BBERIE				8u
	/* request queue overrun interrupt enable */
#define USBFS_HOST_HCH4INTEN_REQOVRIE				9u
	/* Data toggle error interrupt enable */
#define USBFS_HOST_HCH4INTEN_DTERIE				10u

	/* 0x18C */
	uint8_t RESERVED25[0x1AC-0x18C];

	/* 0x1AC: host channel-5 interrupt enable register */
	uint32_t volatile HCH5INTEN;
	/* Transfer completed interrupt enable */
#define USBFS_HOST_HCH5INTEN_TFIE				0u
	/* Channel halted interrupt enable */
#define USBFS_HOST_HCH5INTEN_CHIE				1u
	/* STALL interrupt enable */
#define USBFS_HOST_HCH5INTEN_STALLIE				3u
	/* NAK interrupt enable */
#define USBFS_HOST_HCH5INTEN_NAKIE				4u
	/* ACK interrupt enable */
#define USBFS_HOST_HCH5INTEN_ACKIE				5u
	/* USB bus error interrupt enable */
#define USBFS_HOST_HCH5INTEN_USBERIE				7u
	/* Babble error interrupt enable */
#define USBFS_HOST_HCH5INTEN_BBERIE				8u
	/* request queue overrun interrupt enable */
#define USBFS_HOST_HCH5INTEN_REQOVRIE				9u
	/* Data toggle error interrupt enable */
#define USBFS_HOST_HCH5INTEN_DTERIE				10u

	/* 0x1AC */
	uint8_t RESERVED26[0x1CC-0x1AC];

	/* 0x1CC: host channel-6 interrupt enable register */
	uint32_t volatile HCH6INTEN;
	/* Transfer completed interrupt enable */
#define USBFS_HOST_HCH6INTEN_TFIE				0u
	/* Channel halted interrupt enable */
#define USBFS_HOST_HCH6INTEN_CHIE				1u
	/* STALL interrupt enable */
#define USBFS_HOST_HCH6INTEN_STALLIE				3u
	/* NAK interrupt enable */
#define USBFS_HOST_HCH6INTEN_NAKIE				4u
	/* ACK interrupt enable */
#define USBFS_HOST_HCH6INTEN_ACKIE				5u
	/* USB bus error interrupt enable */
#define USBFS_HOST_HCH6INTEN_USBERIE				7u
	/* Babble error interrupt enable */
#define USBFS_HOST_HCH6INTEN_BBERIE				8u
	/* request queue overrun interrupt enable */
#define USBFS_HOST_HCH6INTEN_REQOVRIE				9u
	/* Data toggle error interrupt enable */
#define USBFS_HOST_HCH6INTEN_DTERIE				10u

	/* 0x1CC */
	uint8_t RESERVED27[0x1EC-0x1CC];

	/* 0x1EC: host channel-7 interrupt enable register */
	uint32_t volatile HCH7INTEN;
	/* Transfer completed interrupt enable */
#define USBFS_HOST_HCH7INTEN_TFIE				0u
	/* Channel halted interrupt enable */
#define USBFS_HOST_HCH7INTEN_CHIE				1u
	/* STALL interrupt enable */
#define USBFS_HOST_HCH7INTEN_STALLIE				3u
	/* NAK interrupt enable */
#define USBFS_HOST_HCH7INTEN_NAKIE				4u
	/* ACK interrupt enable */
#define USBFS_HOST_HCH7INTEN_ACKIE				5u
	/* USB bus error interrupt enable */
#define USBFS_HOST_HCH7INTEN_USBERIE				7u
	/* Babble error interrupt enable */
#define USBFS_HOST_HCH7INTEN_BBERIE				8u
	/* request queue overrun interrupt enable */
#define USBFS_HOST_HCH7INTEN_REQOVRIE				9u
	/* Data toggle error interrupt enable */
#define USBFS_HOST_HCH7INTEN_DTERIE				10u

	/* 0x110: host channel-0 transfer length */
	uint32_t volatile HCH0LEN;
	/* Transfer length */
#define USBFS_HOST_HCH0LEN_TLEN_msb				0u
#define USBFS_HOST_HCH0LEN_TLEN_lsb				18u
	/* Packet count */
#define USBFS_HOST_HCH0LEN_PCNT_msb				19u
#define USBFS_HOST_HCH0LEN_PCNT_lsb				28u
	/* Data PID */
#define USBFS_HOST_HCH0LEN_DPID_msb				29u
#define USBFS_HOST_HCH0LEN_DPID_lsb				30u

