josuah/mcu-gd32vf103/registers.h
	/* 0x110 */
	uint8_t RESERVED28[0x130-0x110];

	/* 0x130: host channel-1 transfer length */
	uint32_t volatile HCH1LEN;
	/* Transfer length */
#define USBFS_HOST_HCH1LEN_TLEN_msb				0u
#define USBFS_HOST_HCH1LEN_TLEN_lsb				18u
	/* Packet count */
#define USBFS_HOST_HCH1LEN_PCNT_msb				19u
#define USBFS_HOST_HCH1LEN_PCNT_lsb				28u
	/* Data PID */
#define USBFS_HOST_HCH1LEN_DPID_msb				29u
#define USBFS_HOST_HCH1LEN_DPID_lsb				30u

	/* 0x130 */
	uint8_t RESERVED29[0x150-0x130];

	/* 0x150:  */
	uint32_t volatile HCH2LEN;
	/* Transfer length */
#define USBFS_HOST_HCH2LEN_TLEN_msb				0u
#define USBFS_HOST_HCH2LEN_TLEN_lsb				18u
	/* Packet count */
#define USBFS_HOST_HCH2LEN_PCNT_msb				19u
#define USBFS_HOST_HCH2LEN_PCNT_lsb				28u
	/* Data PID */
#define USBFS_HOST_HCH2LEN_DPID_msb				29u
#define USBFS_HOST_HCH2LEN_DPID_lsb				30u

	/* 0x150 */
	uint8_t RESERVED30[0x170-0x150];

	/* 0x170:  */
	uint32_t volatile HCH3LEN;
	/* Transfer length */
#define USBFS_HOST_HCH3LEN_TLEN_msb				0u
#define USBFS_HOST_HCH3LEN_TLEN_lsb				18u
	/* Packet count */
#define USBFS_HOST_HCH3LEN_PCNT_msb				19u
#define USBFS_HOST_HCH3LEN_PCNT_lsb				28u
	/* Data PID */
#define USBFS_HOST_HCH3LEN_DPID_msb				29u
#define USBFS_HOST_HCH3LEN_DPID_lsb				30u

	/* 0x170 */
	uint8_t RESERVED31[0x190-0x170];

	/* 0x190: host channel-4 transfer length */
	uint32_t volatile HCH4LEN;
	/* Transfer length */
#define USBFS_HOST_HCH4LEN_TLEN_msb				0u
#define USBFS_HOST_HCH4LEN_TLEN_lsb				18u
	/* Packet count */
#define USBFS_HOST_HCH4LEN_PCNT_msb				19u
#define USBFS_HOST_HCH4LEN_PCNT_lsb				28u
	/* Data PID */
#define USBFS_HOST_HCH4LEN_DPID_msb				29u
#define USBFS_HOST_HCH4LEN_DPID_lsb				30u

	/* 0x190 */
	uint8_t RESERVED32[0x1B0-0x190];

	/* 0x1B0: host channel-5 transfer length */
	uint32_t volatile HCH5LEN;
	/* Transfer length */
#define USBFS_HOST_HCH5LEN_TLEN_msb				0u
#define USBFS_HOST_HCH5LEN_TLEN_lsb				18u
	/* Packet count */
#define USBFS_HOST_HCH5LEN_PCNT_msb				19u
#define USBFS_HOST_HCH5LEN_PCNT_lsb				28u
	/* Data PID */
#define USBFS_HOST_HCH5LEN_DPID_msb				29u
#define USBFS_HOST_HCH5LEN_DPID_lsb				30u

	/* 0x1B0 */
	uint8_t RESERVED33[0x1D0-0x1B0];

	/* 0x1D0: host channel-6 transfer length */
	uint32_t volatile HCH6LEN;
	/* Transfer length */
#define USBFS_HOST_HCH6LEN_TLEN_msb				0u
#define USBFS_HOST_HCH6LEN_TLEN_lsb				18u
	/* Packet count */
#define USBFS_HOST_HCH6LEN_PCNT_msb				19u
#define USBFS_HOST_HCH6LEN_PCNT_lsb				28u
	/* Data PID */
#define USBFS_HOST_HCH6LEN_DPID_msb				29u
#define USBFS_HOST_HCH6LEN_DPID_lsb				30u

	/* 0x1D0 */
	uint8_t RESERVED34[0x1F0-0x1D0];

	/* 0x1F0: host channel-7 transfer length */
	uint32_t volatile HCH7LEN;
	/* Transfer length */
#define USBFS_HOST_HCH7LEN_TLEN_msb				0u
#define USBFS_HOST_HCH7LEN_TLEN_lsb				18u
	/* Packet count */
#define USBFS_HOST_HCH7LEN_PCNT_msb				19u
#define USBFS_HOST_HCH7LEN_PCNT_lsb				28u
	/* Data PID */
#define USBFS_HOST_HCH7LEN_DPID_msb				29u
#define USBFS_HOST_HCH7LEN_DPID_lsb				30u

};


#define USBFS_DEVICE ((struct sdk_usbfs_device *)0x50000800)

struct sdk_usbfs_device {

	/* 0x00: device configuration register */
	uint32_t volatile DCFG;
	/* Device speed */
#define USBFS_DEVICE_DCFG_DS_msb				0u
#define USBFS_DEVICE_DCFG_DS_lsb				1u
	/* Non-zero-length status OUT */
#define USBFS_DEVICE_DCFG_NZLSOH				2u
	/* Device address */
#define USBFS_DEVICE_DCFG_DAR_msb				4u
#define USBFS_DEVICE_DCFG_DAR_lsb				10u
	/* end of periodic frame time */
#define USBFS_DEVICE_DCFG_EOPFT_msb				11u
#define USBFS_DEVICE_DCFG_EOPFT_lsb				12u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: device control register */
	uint32_t volatile DCTL;
	/* Remote wakeup */
#define USBFS_DEVICE_DCTL_RWKUP					0u
	/* Soft disconnect */
#define USBFS_DEVICE_DCTL_SD					1u
	/* Global IN NAK status */
#define USBFS_DEVICE_DCTL_GINS					2u
	/* Global OUT NAK status */
#define USBFS_DEVICE_DCTL_GONS					3u
	/* Set global IN NAK */
#define USBFS_DEVICE_DCTL_SGINAK				7u
	/* Clear global IN NAK */
#define USBFS_DEVICE_DCTL_CGINAK				8u
	/* Set global OUT NAK */
#define USBFS_DEVICE_DCTL_SGONAK				9u
	/* Clear global OUT NAK */
#define USBFS_DEVICE_DCTL_CGONAK				10u
	/* Power-on initialization flag */
#define USBFS_DEVICE_DCTL_POIF					11u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: device status register */
	uint32_t volatile DSTAT;
	/* Suspend status */
#define USBFS_DEVICE_DSTAT_SPST					0u
	/* Enumerated speed */
#define USBFS_DEVICE_DSTAT_ES_msb				1u
#define USBFS_DEVICE_DSTAT_ES_lsb				2u
	/* Frame number of the received */
#define USBFS_DEVICE_DSTAT_FNRSOF_msb				8u
#define USBFS_DEVICE_DSTAT_FNRSOF_lsb				21u

	/* 0x08 */
	uint8_t RESERVED2[0x10-0x08];

	/* 0x10: device IN endpoint common interrupt */
	uint32_t volatile DIEPINTEN;
	/* Transfer finished interrupt */
#define USBFS_DEVICE_DIEPINTEN_TFEN				0u
	/* Endpoint disabled interrupt */
#define USBFS_DEVICE_DIEPINTEN_EPDISEN				1u
	/* Control IN timeout condition interrupt enable (Non-isochronous */
#define USBFS_DEVICE_DIEPINTEN_CITOEN				3u
	/* Endpoint Tx FIFO underrun interrupt enable bit */
#define USBFS_DEVICE_DIEPINTEN_EPTXFUDEN			4u
	/* IN endpoint NAK effective */
#define USBFS_DEVICE_DIEPINTEN_IEPNEEN				6u

	/* 0x10 */
	uint8_t RESERVED3[0x14-0x10];

	/* 0x14: device OUT endpoint common interrupt */
	uint32_t volatile DOEPINTEN;
	/* Transfer finished interrupt */
#define USBFS_DEVICE_DOEPINTEN_TFEN				0u
	/* Endpoint disabled interrupt */
#define USBFS_DEVICE_DOEPINTEN_EPDISEN				1u
	/* SETUP phase finished interrupt enable */
#define USBFS_DEVICE_DOEPINTEN_STPFEN				3u
	/*  */
#define USBFS_DEVICE_DOEPINTEN_EPRXFOVREN			4u
	/*  */
#define USBFS_DEVICE_DOEPINTEN_BTBSTPEN				6u

	/* 0x14 */
	uint8_t RESERVED4[0x18-0x14];

	/* 0x18: device all endpoints interrupt */
	uint32_t volatile DAEPINT;
	/* Device all IN endpoint interrupt bits */
#define USBFS_DEVICE_DAEPINT_IEPITB_msb				0u
#define USBFS_DEVICE_DAEPINT_IEPITB_lsb				3u
	/* Device all OUT endpoint interrupt bits */
#define USBFS_DEVICE_DAEPINT_OEPITB_msb				16u
#define USBFS_DEVICE_DAEPINT_OEPITB_lsb				19u

	/* 0x18 */
	uint8_t RESERVED5[0x1C-0x18];

