josuah/mcu-gd32vf103/registers.h
	/* 0x1C: Device all endpoints interrupt enable register */
	uint32_t volatile DAEPINTEN;
	/* IN EP interrupt interrupt enable bits */
#define USBFS_DEVICE_DAEPINTEN_IEPIE_msb			0u
#define USBFS_DEVICE_DAEPINTEN_IEPIE_lsb			3u
	/* OUT endpoint interrupt enable bits */
#define USBFS_DEVICE_DAEPINTEN_OEPIE_msb			16u
#define USBFS_DEVICE_DAEPINTEN_OEPIE_lsb			19u

	/* 0x1C */
	uint8_t RESERVED6[0x28-0x1C];

	/* 0x28: device VBUS discharge time */
	uint32_t volatile DVBUSDT;
	/* Device VBUS discharge time */
#define USBFS_DEVICE_DVBUSDT_DVBUSDT_msb			0u
#define USBFS_DEVICE_DVBUSDT_DVBUSDT_lsb			15u

	/* 0x28 */
	uint8_t RESERVED7[0x2C-0x28];

	/* 0x2C: device VBUS pulsing time */
	uint32_t volatile DVBUSPT;
	/* Device VBUS pulsing time */
#define USBFS_DEVICE_DVBUSPT_DVBUSPT_msb			0u
#define USBFS_DEVICE_DVBUSPT_DVBUSPT_lsb			11u

	/* 0x2C */
	uint8_t RESERVED8[0x34-0x2C];

	/* 0x34: device IN endpoint FIFO empty */
	uint32_t volatile DIEPFEINTEN;
	/* IN EP Tx FIFO empty interrupt enable */
#define USBFS_DEVICE_DIEPFEINTEN_IEPTXFEIE_msb			0u
#define USBFS_DEVICE_DIEPFEINTEN_IEPTXFEIE_lsb			3u

	/* 0x34 */
	uint8_t RESERVED9[0x100-0x34];

	/* 0x100: device IN endpoint 0 control */
	uint32_t volatile DIEP0CTL;
	/* Maximum packet length */
#define USBFS_DEVICE_DIEP0CTL_MPL_msb				0u
#define USBFS_DEVICE_DIEP0CTL_MPL_lsb				1u
	/* endpoint active */
#define USBFS_DEVICE_DIEP0CTL_EPACT				15u
	/* NAK status */
#define USBFS_DEVICE_DIEP0CTL_NAKS				17u
	/* Endpoint type */
#define USBFS_DEVICE_DIEP0CTL_EPTYPE_msb			18u
#define USBFS_DEVICE_DIEP0CTL_EPTYPE_lsb			19u
	/* STALL handshake */
#define USBFS_DEVICE_DIEP0CTL_STALL				21u
	/* TxFIFO number */
#define USBFS_DEVICE_DIEP0CTL_TXFNUM_msb			22u
#define USBFS_DEVICE_DIEP0CTL_TXFNUM_lsb			25u
	/* Clear NAK */
#define USBFS_DEVICE_DIEP0CTL_CNAK				26u
	/* Set NAK */
#define USBFS_DEVICE_DIEP0CTL_SNAK				27u
	/* Endpoint disable */
#define USBFS_DEVICE_DIEP0CTL_EPD				30u
	/* Endpoint enable */
#define USBFS_DEVICE_DIEP0CTL_EPEN				31u

	/* 0x100 */
	uint8_t RESERVED10[0x120-0x100];

	/* 0x120: device in endpoint-1 control */
	uint32_t volatile DIEP1CTL;
	/* Endpoint enable */
#define USBFS_DEVICE_DIEP1CTL_EPEN				31u
	/* Endpoint disable */
#define USBFS_DEVICE_DIEP1CTL_EPD				30u
	/* Set DATA1 PID/Set odd frame */
#define USBFS_DEVICE_DIEP1CTL_SD1PID_SODDFRM			29u
	/* SD0PID/SEVNFRM */
#define USBFS_DEVICE_DIEP1CTL_SD0PID_SEVENFRM			28u
	/* Set NAK */
#define USBFS_DEVICE_DIEP1CTL_SNAK				27u
	/* Clear NAK */
#define USBFS_DEVICE_DIEP1CTL_CNAK				26u
	/* Tx FIFO number */
#define USBFS_DEVICE_DIEP1CTL_TXFNUM_msb			22u
#define USBFS_DEVICE_DIEP1CTL_TXFNUM_lsb			25u
	/* STALL handshake */
#define USBFS_DEVICE_DIEP1CTL_STALL				21u
	/* Endpoint type */
#define USBFS_DEVICE_DIEP1CTL_EPTYPE_msb			18u
#define USBFS_DEVICE_DIEP1CTL_EPTYPE_lsb			19u
	/* NAK status */
#define USBFS_DEVICE_DIEP1CTL_NAKS				17u
	/* EOFRM/DPID */
#define USBFS_DEVICE_DIEP1CTL_EOFRM_DPID			16u
	/* Endpoint active */
#define USBFS_DEVICE_DIEP1CTL_EPACT				15u
	/* maximum packet length */
#define USBFS_DEVICE_DIEP1CTL_MPL_msb				0u
#define USBFS_DEVICE_DIEP1CTL_MPL_lsb				10u

	/* 0x120 */
	uint8_t RESERVED11[0x140-0x120];

	/* 0x140: device endpoint-2 control */
	uint32_t volatile DIEP2CTL;
	/* Endpoint enable */
#define USBFS_DEVICE_DIEP2CTL_EPEN				31u
	/* Endpoint disable */
#define USBFS_DEVICE_DIEP2CTL_EPD				30u
	/* Set DATA1 PID/Set odd frame */
#define USBFS_DEVICE_DIEP2CTL_SD1PID_SODDFRM			29u
	/* SD0PID/SEVNFRM */
#define USBFS_DEVICE_DIEP2CTL_SD0PID_SEVENFRM			28u
	/* Set NAK */
#define USBFS_DEVICE_DIEP2CTL_SNAK				27u
	/* Clear NAK */
#define USBFS_DEVICE_DIEP2CTL_CNAK				26u
	/* Tx FIFO number */
#define USBFS_DEVICE_DIEP2CTL_TXFNUM_msb			22u
#define USBFS_DEVICE_DIEP2CTL_TXFNUM_lsb			25u
	/* STALL handshake */
#define USBFS_DEVICE_DIEP2CTL_STALL				21u
	/* Endpoint type */
#define USBFS_DEVICE_DIEP2CTL_EPTYPE_msb			18u
#define USBFS_DEVICE_DIEP2CTL_EPTYPE_lsb			19u
	/* NAK status */
#define USBFS_DEVICE_DIEP2CTL_NAKS				17u
	/* EOFRM/DPID */
#define USBFS_DEVICE_DIEP2CTL_EOFRM_DPID			16u
	/* Endpoint active */
#define USBFS_DEVICE_DIEP2CTL_EPACT				15u
	/* maximum packet length */
#define USBFS_DEVICE_DIEP2CTL_MPL_msb				0u
#define USBFS_DEVICE_DIEP2CTL_MPL_lsb				10u

	/* 0x140 */
	uint8_t RESERVED12[0x160-0x140];

	/* 0x160: device endpoint-3 control */
	uint32_t volatile DIEP3CTL;
	/* Endpoint enable */
#define USBFS_DEVICE_DIEP3CTL_EPEN				31u
	/* Endpoint disable */
#define USBFS_DEVICE_DIEP3CTL_EPD				30u
	/* Set DATA1 PID/Set odd frame */
#define USBFS_DEVICE_DIEP3CTL_SD1PID_SODDFRM			29u
	/* SD0PID/SEVNFRM */
#define USBFS_DEVICE_DIEP3CTL_SD0PID_SEVENFRM			28u
	/* Set NAK */
#define USBFS_DEVICE_DIEP3CTL_SNAK				27u
	/* Clear NAK */
#define USBFS_DEVICE_DIEP3CTL_CNAK				26u
	/* Tx FIFO number */
#define USBFS_DEVICE_DIEP3CTL_TXFNUM_msb			22u
#define USBFS_DEVICE_DIEP3CTL_TXFNUM_lsb			25u
	/* STALL handshake */
#define USBFS_DEVICE_DIEP3CTL_STALL				21u
	/* Endpoint type */
#define USBFS_DEVICE_DIEP3CTL_EPTYPE_msb			18u
#define USBFS_DEVICE_DIEP3CTL_EPTYPE_lsb			19u
	/* NAK status */
#define USBFS_DEVICE_DIEP3CTL_NAKS				17u
	/* EOFRM/DPID */
#define USBFS_DEVICE_DIEP3CTL_EOFRM_DPID			16u
	/* Endpoint active */
#define USBFS_DEVICE_DIEP3CTL_EPACT				15u
	/* maximum packet length */
#define USBFS_DEVICE_DIEP3CTL_MPL_msb				0u
#define USBFS_DEVICE_DIEP3CTL_MPL_lsb				10u

	/* 0x160 */
	uint8_t RESERVED13[0x300-0x160];

	/* 0x300: device endpoint-0 control */
	uint32_t volatile DOEP0CTL;
	/* Endpoint enable */
#define USBFS_DEVICE_DOEP0CTL_EPEN				31u
	/* Endpoint disable */
#define USBFS_DEVICE_DOEP0CTL_EPD				30u
	/* Set NAK */
#define USBFS_DEVICE_DOEP0CTL_SNAK				27u
	/* Clear NAK */
#define USBFS_DEVICE_DOEP0CTL_CNAK				26u
	/* STALL handshake */
#define USBFS_DEVICE_DOEP0CTL_STALL				21u
	/* Snoop mode */
#define USBFS_DEVICE_DOEP0CTL_SNOOP				20u
	/* Endpoint type */
#define USBFS_DEVICE_DOEP0CTL_EPTYPE_msb			18u
#define USBFS_DEVICE_DOEP0CTL_EPTYPE_lsb			19u
	/* NAK status */
#define USBFS_DEVICE_DOEP0CTL_NAKS				17u
	/* Endpoint active */
#define USBFS_DEVICE_DOEP0CTL_EPACT				15u
	/* Maximum packet length */
#define USBFS_DEVICE_DOEP0CTL_MPL_msb				0u
#define USBFS_DEVICE_DOEP0CTL_MPL_lsb				1u

	/* 0x300 */
	uint8_t RESERVED14[0x320-0x300];

	/* 0x320: device endpoint-1 control */
	uint32_t volatile DOEP1CTL;
	/* Endpoint enable */
#define USBFS_DEVICE_DOEP1CTL_EPEN				31u
	/* Endpoint disable */
#define USBFS_DEVICE_DOEP1CTL_EPD				30u
	/* SD1PID/SODDFRM */
#define USBFS_DEVICE_DOEP1CTL_SD1PID_SODDFRM			29u
	/* SD0PID/SEVENFRM */
#define USBFS_DEVICE_DOEP1CTL_SD0PID_SEVENFRM			28u
	/* Set NAK */
#define USBFS_DEVICE_DOEP1CTL_SNAK				27u
	/* Clear NAK */
#define USBFS_DEVICE_DOEP1CTL_CNAK				26u
	/* STALL handshake */
#define USBFS_DEVICE_DOEP1CTL_STALL				21u
	/* Snoop mode */
#define USBFS_DEVICE_DOEP1CTL_SNOOP				20u
	/* Endpoint type */
#define USBFS_DEVICE_DOEP1CTL_EPTYPE_msb			18u
#define USBFS_DEVICE_DOEP1CTL_EPTYPE_lsb			19u
	/* NAK status */
#define USBFS_DEVICE_DOEP1CTL_NAKS				17u
	/* EOFRM/DPID */
#define USBFS_DEVICE_DOEP1CTL_EOFRM_DPID			16u
	/* Endpoint active */
#define USBFS_DEVICE_DOEP1CTL_EPACT				15u
	/* maximum packet length */
#define USBFS_DEVICE_DOEP1CTL_MPL_msb				0u
#define USBFS_DEVICE_DOEP1CTL_MPL_lsb				10u

	/* 0x320 */
	uint8_t RESERVED15[0x340-0x320];

	/* 0x340: device endpoint-2 control */
	uint32_t volatile DOEP2CTL;
	/* Endpoint enable */
#define USBFS_DEVICE_DOEP2CTL_EPEN				31u
	/* Endpoint disable */
#define USBFS_DEVICE_DOEP2CTL_EPD				30u
	/* SD1PID/SODDFRM */
#define USBFS_DEVICE_DOEP2CTL_SD1PID_SODDFRM			29u
	/* SD0PID/SEVENFRM */
#define USBFS_DEVICE_DOEP2CTL_SD0PID_SEVENFRM			28u
	/* Set NAK */
#define USBFS_DEVICE_DOEP2CTL_SNAK				27u
	/* Clear NAK */
#define USBFS_DEVICE_DOEP2CTL_CNAK				26u
	/* STALL handshake */
#define USBFS_DEVICE_DOEP2CTL_STALL				21u
	/* Snoop mode */
#define USBFS_DEVICE_DOEP2CTL_SNOOP				20u
	/* Endpoint type */
#define USBFS_DEVICE_DOEP2CTL_EPTYPE_msb			18u
#define USBFS_DEVICE_DOEP2CTL_EPTYPE_lsb			19u
	/* NAK status */
#define USBFS_DEVICE_DOEP2CTL_NAKS				17u
	/* EOFRM/DPID */
#define USBFS_DEVICE_DOEP2CTL_EOFRM_DPID			16u
	/* Endpoint active */
#define USBFS_DEVICE_DOEP2CTL_EPACT				15u
	/* maximum packet length */
#define USBFS_DEVICE_DOEP2CTL_MPL_msb				0u
#define USBFS_DEVICE_DOEP2CTL_MPL_lsb				10u

	/* 0x340 */
	uint8_t RESERVED16[0x360-0x340];

