josuah/mcu-gd32vf103/registers.h
	/* 0x360: device endpoint-3 control */
	uint32_t volatile DOEP3CTL;
	/* Endpoint enable */
#define USBFS_DEVICE_DOEP3CTL_EPEN				31u
	/* Endpoint disable */
#define USBFS_DEVICE_DOEP3CTL_EPD				30u
	/* SD1PID/SODDFRM */
#define USBFS_DEVICE_DOEP3CTL_SD1PID_SODDFRM			29u
	/* SD0PID/SEVENFRM */
#define USBFS_DEVICE_DOEP3CTL_SD0PID_SEVENFRM			28u
	/* Set NAK */
#define USBFS_DEVICE_DOEP3CTL_SNAK				27u
	/* Clear NAK */
#define USBFS_DEVICE_DOEP3CTL_CNAK				26u
	/* STALL handshake */
#define USBFS_DEVICE_DOEP3CTL_STALL				21u
	/* Snoop mode */
#define USBFS_DEVICE_DOEP3CTL_SNOOP				20u
	/* Endpoint type */
#define USBFS_DEVICE_DOEP3CTL_EPTYPE_msb			18u
#define USBFS_DEVICE_DOEP3CTL_EPTYPE_lsb			19u
	/* NAK status */
#define USBFS_DEVICE_DOEP3CTL_NAKS				17u
	/* EOFRM/DPID */
#define USBFS_DEVICE_DOEP3CTL_EOFRM_DPID			16u
	/* Endpoint active */
#define USBFS_DEVICE_DOEP3CTL_EPACT				15u
	/* maximum packet length */
#define USBFS_DEVICE_DOEP3CTL_MPL_msb				0u
#define USBFS_DEVICE_DOEP3CTL_MPL_lsb				10u

	/* 0x108: device endpoint-0 interrupt */
	uint32_t volatile DIEP0INTF;
	/* Transmit FIFO empty */
#define USBFS_DEVICE_DIEP0INTF_TXFE				7u
	/* IN endpoint NAK effective */
#define USBFS_DEVICE_DIEP0INTF_IEPNE				6u
	/* Endpoint Tx FIFO underrun */
#define USBFS_DEVICE_DIEP0INTF_EPTXFUD				4u
	/* Control in timeout interrupt */
#define USBFS_DEVICE_DIEP0INTF_CITO				3u
	/* Endpoint finished */
#define USBFS_DEVICE_DIEP0INTF_EPDIS				1u
	/* Transfer finished */
#define USBFS_DEVICE_DIEP0INTF_TF				0u

	/* 0x108 */
	uint8_t RESERVED17[0x128-0x108];

	/* 0x128: device endpoint-1 interrupt */
	uint32_t volatile DIEP1INTF;
	/* Transmit FIFO empty */
#define USBFS_DEVICE_DIEP1INTF_TXFE				7u
	/* IN endpoint NAK effective */
#define USBFS_DEVICE_DIEP1INTF_IEPNE				6u
	/* Endpoint Tx FIFO underrun */
#define USBFS_DEVICE_DIEP1INTF_EPTXFUD				4u
	/* Control in timeout interrupt */
#define USBFS_DEVICE_DIEP1INTF_CITO				3u
	/* Endpoint finished */
#define USBFS_DEVICE_DIEP1INTF_EPDIS				1u
	/* Transfer finished */
#define USBFS_DEVICE_DIEP1INTF_TF				0u

	/* 0x128 */
	uint8_t RESERVED18[0x148-0x128];

	/* 0x148: device endpoint-2 interrupt */
	uint32_t volatile DIEP2INTF;
	/* Transmit FIFO empty */
#define USBFS_DEVICE_DIEP2INTF_TXFE				7u
	/* IN endpoint NAK effective */
#define USBFS_DEVICE_DIEP2INTF_IEPNE				6u
	/* Endpoint Tx FIFO underrun */
#define USBFS_DEVICE_DIEP2INTF_EPTXFUD				4u
	/* Control in timeout interrupt */
#define USBFS_DEVICE_DIEP2INTF_CITO				3u
	/* Endpoint finished */
#define USBFS_DEVICE_DIEP2INTF_EPDIS				1u
	/* Transfer finished */
#define USBFS_DEVICE_DIEP2INTF_TF				0u

	/* 0x148 */
	uint8_t RESERVED19[0x168-0x148];

	/* 0x168: device endpoint-3 interrupt */
	uint32_t volatile DIEP3INTF;
	/* Transmit FIFO empty */
#define USBFS_DEVICE_DIEP3INTF_TXFE				7u
	/* IN endpoint NAK effective */
#define USBFS_DEVICE_DIEP3INTF_IEPNE				6u
	/* Endpoint Tx FIFO underrun */
#define USBFS_DEVICE_DIEP3INTF_EPTXFUD				4u
	/* Control in timeout interrupt */
#define USBFS_DEVICE_DIEP3INTF_CITO				3u
	/* Endpoint finished */
#define USBFS_DEVICE_DIEP3INTF_EPDIS				1u
	/* Transfer finished */
#define USBFS_DEVICE_DIEP3INTF_TF				0u

	/* 0x168 */
	uint8_t RESERVED20[0x308-0x168];

	/* 0x308: device out endpoint-0 interrupt flag */
	uint32_t volatile DOEP0INTF;
	/* Back-to-back SETUP packets */
#define USBFS_DEVICE_DOEP0INTF_BTBSTP				6u
	/* Endpoint Rx FIFO overrun */
#define USBFS_DEVICE_DOEP0INTF_EPRXFOVR				4u
	/* Setup phase finished */
#define USBFS_DEVICE_DOEP0INTF_STPF				3u
	/* Endpoint disabled */
#define USBFS_DEVICE_DOEP0INTF_EPDIS				1u
	/* Transfer finished */
#define USBFS_DEVICE_DOEP0INTF_TF				0u

	/* 0x308 */
	uint8_t RESERVED21[0x328-0x308];

	/* 0x328: device out endpoint-1 interrupt flag */
	uint32_t volatile DOEP1INTF;
	/* Back-to-back SETUP packets */
#define USBFS_DEVICE_DOEP1INTF_BTBSTP				6u
	/* Endpoint Rx FIFO overrun */
#define USBFS_DEVICE_DOEP1INTF_EPRXFOVR				4u
	/* Setup phase finished */
#define USBFS_DEVICE_DOEP1INTF_STPF				3u
	/* Endpoint disabled */
#define USBFS_DEVICE_DOEP1INTF_EPDIS				1u
	/* Transfer finished */
#define USBFS_DEVICE_DOEP1INTF_TF				0u

	/* 0x328 */
	uint8_t RESERVED22[0x348-0x328];

	/* 0x348: device out endpoint-2 interrupt flag */
	uint32_t volatile DOEP2INTF;
	/* Back-to-back SETUP packets */
#define USBFS_DEVICE_DOEP2INTF_BTBSTP				6u
	/* Endpoint Rx FIFO overrun */
#define USBFS_DEVICE_DOEP2INTF_EPRXFOVR				4u
	/* Setup phase finished */
#define USBFS_DEVICE_DOEP2INTF_STPF				3u
	/* Endpoint disabled */
#define USBFS_DEVICE_DOEP2INTF_EPDIS				1u
	/* Transfer finished */
#define USBFS_DEVICE_DOEP2INTF_TF				0u

	/* 0x348 */
	uint8_t RESERVED23[0x368-0x348];

	/* 0x368: device out endpoint-3 interrupt flag */
	uint32_t volatile DOEP3INTF;
	/* Back-to-back SETUP packets */
#define USBFS_DEVICE_DOEP3INTF_BTBSTP				6u
	/* Endpoint Rx FIFO overrun */
#define USBFS_DEVICE_DOEP3INTF_EPRXFOVR				4u
	/* Setup phase finished */
#define USBFS_DEVICE_DOEP3INTF_STPF				3u
	/* Endpoint disabled */
#define USBFS_DEVICE_DOEP3INTF_EPDIS				1u
	/* Transfer finished */
#define USBFS_DEVICE_DOEP3INTF_TF				0u

	/* 0x110: device IN endpoint-0 transfer length */
	uint32_t volatile DIEP0LEN;
	/* Packet count */
#define USBFS_DEVICE_DIEP0LEN_PCNT_msb				19u
#define USBFS_DEVICE_DIEP0LEN_PCNT_lsb				20u
	/* Transfer length */
#define USBFS_DEVICE_DIEP0LEN_TLEN_msb				0u
#define USBFS_DEVICE_DIEP0LEN_TLEN_lsb				6u

	/* 0x110 */
	uint8_t RESERVED24[0x310-0x110];

	/* 0x310: device OUT endpoint-0 transfer length */
	uint32_t volatile DOEP0LEN;
	/* SETUP packet count */
#define USBFS_DEVICE_DOEP0LEN_STPCNT_msb			29u
#define USBFS_DEVICE_DOEP0LEN_STPCNT_lsb			30u
	/* Packet count */
#define USBFS_DEVICE_DOEP0LEN_PCNT				19u
	/* Transfer length */
#define USBFS_DEVICE_DOEP0LEN_TLEN_msb				0u
#define USBFS_DEVICE_DOEP0LEN_TLEN_lsb				6u

	/* 0x130: device IN endpoint-1 transfer length */
	uint32_t volatile DIEP1LEN;
	/* Multi packet count per frame */
#define USBFS_DEVICE_DIEP1LEN_MCPF_msb				29u
#define USBFS_DEVICE_DIEP1LEN_MCPF_lsb				30u
	/* Packet count */
#define USBFS_DEVICE_DIEP1LEN_PCNT_msb				19u
#define USBFS_DEVICE_DIEP1LEN_PCNT_lsb				28u
	/* Transfer length */
#define USBFS_DEVICE_DIEP1LEN_TLEN_msb				0u
#define USBFS_DEVICE_DIEP1LEN_TLEN_lsb				18u

