josuah/mcu-gd32vf103/registers.h
	/* 0x130 */
	uint8_t RESERVED25[0x150-0x130];

	/* 0x150: device IN endpoint-2 transfer length */
	uint32_t volatile DIEP2LEN;
	/* Multi packet count per frame */
#define USBFS_DEVICE_DIEP2LEN_MCPF_msb				29u
#define USBFS_DEVICE_DIEP2LEN_MCPF_lsb				30u
	/* Packet count */
#define USBFS_DEVICE_DIEP2LEN_PCNT_msb				19u
#define USBFS_DEVICE_DIEP2LEN_PCNT_lsb				28u
	/* Transfer length */
#define USBFS_DEVICE_DIEP2LEN_TLEN_msb				0u
#define USBFS_DEVICE_DIEP2LEN_TLEN_lsb				18u

	/* 0x150 */
	uint8_t RESERVED26[0x170-0x150];

	/* 0x170: device IN endpoint-3 transfer length */
	uint32_t volatile DIEP3LEN;
	/* Multi packet count per frame */
#define USBFS_DEVICE_DIEP3LEN_MCPF_msb				29u
#define USBFS_DEVICE_DIEP3LEN_MCPF_lsb				30u
	/* Packet count */
#define USBFS_DEVICE_DIEP3LEN_PCNT_msb				19u
#define USBFS_DEVICE_DIEP3LEN_PCNT_lsb				28u
	/* Transfer length */
#define USBFS_DEVICE_DIEP3LEN_TLEN_msb				0u
#define USBFS_DEVICE_DIEP3LEN_TLEN_lsb				18u

	/* 0x170 */
	uint8_t RESERVED27[0x330-0x170];

	/* 0x330: device OUT endpoint-1 transfer length */
	uint32_t volatile DOEP1LEN;
	/* SETUP packet count/Received data PID */
#define USBFS_DEVICE_DOEP1LEN_STPCNT_RXDPID_msb			29u
#define USBFS_DEVICE_DOEP1LEN_STPCNT_RXDPID_lsb			30u
	/* Packet count */
#define USBFS_DEVICE_DOEP1LEN_PCNT_msb				19u
#define USBFS_DEVICE_DOEP1LEN_PCNT_lsb				28u
	/* Transfer length */
#define USBFS_DEVICE_DOEP1LEN_TLEN_msb				0u
#define USBFS_DEVICE_DOEP1LEN_TLEN_lsb				18u

	/* 0x330 */
	uint8_t RESERVED28[0x350-0x330];

	/* 0x350: device OUT endpoint-2 transfer length */
	uint32_t volatile DOEP2LEN;
	/* SETUP packet count/Received data PID */
#define USBFS_DEVICE_DOEP2LEN_STPCNT_RXDPID_msb			29u
#define USBFS_DEVICE_DOEP2LEN_STPCNT_RXDPID_lsb			30u
	/* Packet count */
#define USBFS_DEVICE_DOEP2LEN_PCNT_msb				19u
#define USBFS_DEVICE_DOEP2LEN_PCNT_lsb				28u
	/* Transfer length */
#define USBFS_DEVICE_DOEP2LEN_TLEN_msb				0u
#define USBFS_DEVICE_DOEP2LEN_TLEN_lsb				18u

	/* 0x350 */
	uint8_t RESERVED29[0x370-0x350];

	/* 0x370: device OUT endpoint-3 transfer length */
	uint32_t volatile DOEP3LEN;
	/* SETUP packet count/Received data PID */
#define USBFS_DEVICE_DOEP3LEN_STPCNT_RXDPID_msb			29u
#define USBFS_DEVICE_DOEP3LEN_STPCNT_RXDPID_lsb			30u
	/* Packet count */
#define USBFS_DEVICE_DOEP3LEN_PCNT_msb				19u
#define USBFS_DEVICE_DOEP3LEN_PCNT_lsb				28u
	/* Transfer length */
#define USBFS_DEVICE_DOEP3LEN_TLEN_msb				0u
#define USBFS_DEVICE_DOEP3LEN_TLEN_lsb				18u

	/* 0x118: device IN endpoint  0 transmit FIFO */
	uint32_t volatile DIEP0TFSTAT;
	/* IN endpoint TxFIFO space */
#define USBFS_DEVICE_DIEP0TFSTAT_IEPTFS_msb			0u
#define USBFS_DEVICE_DIEP0TFSTAT_IEPTFS_lsb			15u

	/* 0x118 */
	uint8_t RESERVED30[0x138-0x118];

	/* 0x138: device IN endpoint 1 transmit FIFO */
	uint32_t volatile DIEP1TFSTAT;
	/* IN endpoint TxFIFO space */
#define USBFS_DEVICE_DIEP1TFSTAT_IEPTFS_msb			0u
#define USBFS_DEVICE_DIEP1TFSTAT_IEPTFS_lsb			15u

	/* 0x138 */
	uint8_t RESERVED31[0x158-0x138];

	/* 0x158: device IN endpoint  2 transmit FIFO */
	uint32_t volatile DIEP2TFSTAT;
	/* IN endpoint TxFIFO space */
#define USBFS_DEVICE_DIEP2TFSTAT_IEPTFS_msb			0u
#define USBFS_DEVICE_DIEP2TFSTAT_IEPTFS_lsb			15u

	/* 0x158 */
	uint8_t RESERVED32[0x178-0x158];

	/* 0x178: device IN endpoint  3 transmit FIFO */
	uint32_t volatile DIEP3TFSTAT;
	/* IN endpoint TxFIFO space */
#define USBFS_DEVICE_DIEP3TFSTAT_IEPTFS_msb			0u
#define USBFS_DEVICE_DIEP3TFSTAT_IEPTFS_lsb			15u

};


#define USBFS_PWRCLK ((struct sdk_usbfs_pwrclk *)0x50000E00)

struct sdk_usbfs_pwrclk {

	/* 0x00: power and clock gating control */
	uint32_t volatile PWRCLKCTL;
	/* Stop the USB clock */
#define USBFS_PWRCLK_PWRCLKCTL_SUCLK				0u
	/* Stop HCLK */
#define USBFS_PWRCLK_PWRCLKCTL_SHCLK				1u

};


#define WWDGT ((struct sdk_wwdgt *)0x40002C00)

struct sdk_wwdgt {

	/* 0x00: Control register */
	uint32_t volatile CTL;
	/* Activation bit */
#define WWDGT_CTL_WDGTEN					7u
	/* 7-bit counter */
#define WWDGT_CTL_CNT_msb					0u
#define WWDGT_CTL_CNT_lsb					6u

	/* 0x00 */
	uint8_t RESERVED0[0x04-0x00];

	/* 0x04: Configuration register */
	uint32_t volatile CFG;
	/* Early wakeup interrupt */
#define WWDGT_CFG_EWIE						9u
	/* Prescaler */
#define WWDGT_CFG_PSC_msb					7u
#define WWDGT_CFG_PSC_lsb					8u
	/* 7-bit window value */
#define WWDGT_CFG_WIN_msb					0u
#define WWDGT_CFG_WIN_lsb					6u

	/* 0x04 */
	uint8_t RESERVED1[0x08-0x04];

	/* 0x08: Status register */
	uint32_t volatile STAT;
	/* Early wakeup interrupt */
#define WWDGT_STAT_EWIF						0u

};

#endif
